		 
#Область ОбработчикиСобытийФормы
		 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Параметры.Свойство("ДополнительнаяОбработкаСсылка", Объект.ДополнительнаяОбработкаСсылка);
	Узел = ПланыОбмена.РозницаСтандартАлко.НайтиПоКоду("ЦЕНТР");
	ОбновитьСписокДокументовНаСервере();
		
	УстановитьПривилегированныйРежим(Истина);
	ДатаПоследнегоОбмена 			= Константы.ТрадДатаПоследнегоОбмена.Получить();
	ДатаПоследнегоУдачногоОбмена	= Константы.ТрадДатаПоследнегоУдачногоОбмена.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	 	
	МакетЗапросНоменклатуры = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетЗапросНоменклатуры"); 
	
	ОбластьДанные = МакетЗапросНоменклатуры.ПолучитьОбласть("Данные");
	ТабличныйДокументЗапросНоменклатуры.Присоединить(ОбластьДанные);
		
	ТабличныйДокументЗапросНоменклатуры.ФиксацияСверху = 1;
     
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазвернутьСписокДокументов();
	УстановитьВидимостьЭлементов();
	
	ЗаполнитьСписокТТНВходящиеЕГАИСКПодтверждению();
	ЗаполнитьСписокАктСписанияЕГАИСКПодтверждению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыбранДокументВыгрузки" Тогда
		ОбработкаВыбораДокумента(Параметр);
		РазвернутьСписокДокументов();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКоманду(Команда) Экспорт
	
 	Если Команда = "ВыполнитьОбмен" Тогда
		ВыполнитьОбменНаСервере();
		Если ЗначениеЗаполнено(Объект.ДокументУстановкиЦен) Тогда
			ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.Форма",НачатьПечатьЦенников(Объект.ДокументУстановкиЦен),	,Новый УникальныйИдентификатор);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Цены не изменялись!");
		КонецЕсли;
		
		ЗагрузитьФайлыВнешнихОбработок();
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ВыполнитьПроверкуНастроекБазыДанных();
	
	лЕГАИСВключен = ЕГАИСВключен();
	 
	Если лЕГАИСВключен Тогда
			
		ВыполнитьОбменЕГАИС();
		   			  				
	КонецЕсли;	
	
	ВыполнитьКоманду("ВыполнитьОбмен");
	
	Если лЕГАИСВключен Тогда
						
		ПодозрениеНаАвтоматическоеОбновлениеОбработки = Ложь;
		
		//Попытка
		//	СформироватьДокументыОстаткиЕГАИС();
		//Исключение
		//	ПодозрениеНаАвтоматическоеОбновлениеОбработки = Истина;
		//КонецПопытки;		
		
		Если НЕ ПодозрениеНаАвтоматическоеОбновлениеОбработки Тогда
				
			ЗаполнитьСписокТТНВходящиеЕГАИСКПодтверждению();
			
			ПодтвердитьТТНВходящиеЕГАИС();
						
			СформироватьАктыСписанияЕГАИСРеализацияДляКафе();
			
			ПодтвердитьАктыСписанияЕГАИС();
			
			ВыполнитьОбменЕГАИС();
			
		КонецЕсли;
		  		
	КонецЕсли;
	
	Попытка
					
		ОбновитьОтображениеДанных();
		ОбновитьСписокДокументовНаСервере();
	
		ОбновитьДатаПоследнегоОбмена();
		ОчиститьТаблицыЗакладкиЕГАИСНаСервере();
	Исключение	
	КонецПопытки;	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДокументКВыгрузке(Команда)
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ОприходованиеТоваров"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.СписаниеТоваров"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ПересортицаТоваров"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
	
	ОткрытьФорму("ВнешняяОбработка.Синхронизация.Форма.ФормаВыбораДокументов", Новый Структура("ТипыДокументов", ТипыДокументов) , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбмена(Команда) 
	ОткрытьФорму("ПланОбмена.РозницаСтандартАлко.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДокументов(Команда)
	ОбновитьСписокДокументовНаСервере();
	РазвернутьСписокДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНомера(Команда)
	ОчиститьНомераНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодборТТНВходящейЕГАИС(Команда)
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ТТНВходящаяЕГАИС"));
	ОткрытьФорму("ВнешняяОбработка.Синхронизация.Форма.ФормаВыбораДокументов", Новый Структура("ТипыДокументов", ТипыДокументов) , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНоменклатуру(Команда)
	ОповещениеВводКода = Новый ОписаниеОповещения("ОбработкаВводаКодаНоменклатуры", ЭтаФорма, Неопределено);
	ПоказатьВводСтроки(ОповещениеВводКода, , "Введите код номенклатуры из ТТН (5 знаков)", 5); 
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВходящиеТТН(Команда)
	ПодтвердитьТТНВходящиеЕГАИС();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокумент(Команда)
	Если Элементы.ДокументыКВыгрузке.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.ДокументыКВыгрузке.ТекущиеДанные.Документ) Тогда
		УдалитьДокументНаСервере(Узел, Элементы.ДокументыКВыгрузке.ТекущиеДанные.Документ);
		ОбновитьСписокДокументовНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	УдалитьВсеНаСервере(Узел);
	ОбновитьСписокДокументовНаСервере();
	РазвернутьСписокДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаВЕГАИС_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + ДополнительныеПараметры.Ссылка + " успешно выгружен.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктСписанияЕГАИСКПодтверждениюЗаполнить(Команда)
	ЗаполнитьСписокАктСписанияЕГАИСКПодтверждению(Истина);
КонецПроцедуры

&НаКлиенте
Процедура АктСписанияЕГАИСКПодтверждениюПодтвердить(Команда)
	
	ПодтвердитьАктыСписанияЕГАИС();
	ВыполнитьОбменЕГАИС();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНоменклатурыЗагрузить(Команда)
	
	ЗаполненыНоменклатураКод = ЗначениеЗаполнено(ТабличныйДокументЗапросНоменклатуры.Область("R2C1").Текст);
			
	Если Не ЗаполненыНоменклатураКод Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;

	
	ЗапросНоменклатурыЗагрузитьНаСервере();
КонецПроцедуры
 
#КонецОбласти

		 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ И ФУНКЦИИ ВЫДРАННЫЕ ИЗ КОНФИГУРАЦИИ

&НаСервереБезКонтекста
Функция ПараметрыПередачиВЕГАИС(ДокументСсылка)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ЕстьРасхождения, ТТНВходящаяЕГАИС");
	
	Результат = Новый Структура;
	Результат.Вставить("ВидДокумента"  , Перечисления.ВидыДокументовЕГАИС.АктПодтвержденияТТН);
	Результат.Вставить("ДокументСсылка", ЗначенияРеквизитов.ТТНВходящаяЕГАИС);
	Результат.Вставить("Отказ"         , Ложь);
	
	Если НЕ ЗначенияРеквизитов.ЕстьРасхождения Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.НомерСтроки,
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.ИдентификаторСтроки,
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.АлкогольнаяПродукция,
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.КоличествоУпаковок КАК Количество
	|ПОМЕСТИТЬ ТаблицаПоступленияДанныеПоставщика
	|ИЗ
	|	Документ.ПоступлениеТоваров.ТоварыПоДаннымПоставщика КАК ПоступлениеТоваровТоварыПоДаннымПоставщика
	|ГДЕ
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.Ссылка = &Ссылка
	|	И НЕ ПоступлениеТоваровТоварыПоДаннымПоставщика.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТТНВходящаяЕГАИСТовары.НомерСтроки,
	|	ТТНВходящаяЕГАИСТовары.ИдентификаторСтроки,
	|	ТТНВходящаяЕГАИСТовары.Ссылка,
	|	ТТНВходящаяЕГАИСТовары.Справка2 КАК Справка2
	|ПОМЕСТИТЬ ТаблицаТТН
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС.Товары КАК ТТНВходящаяЕГАИСТовары
	|ГДЕ
	|	ТТНВходящаяЕГАИСТовары.Ссылка = &СсылкаТТН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоступленияДанныеПоставщика.НомерСтроки,
	|	ТаблицаПоступленияДанныеПоставщика.ИдентификаторСтроки,
	|	ТаблицаПоступленияДанныеПоставщика.АлкогольнаяПродукция,
	|	ТаблицаПоступленияДанныеПоставщика.Количество,
	|	ТаблицаТТН.Справка2
	|ПОМЕСТИТЬ ТаблицаТТНПоДаннымПоставщика
	|ИЗ
	|	ТаблицаПоступленияДанныеПоставщика КАК ТаблицаПоступленияДанныеПоставщика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТТН КАК ТаблицаТТН
	|		ПО ТаблицаПоступленияДанныеПоставщика.ИдентификаторСтроки = ТаблицаТТН.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровТовары.НомерСтроки,
	|	ПоступлениеТоваровТовары.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
	|			ТОГДА ПоступлениеТоваровТовары.Количество * ПоступлениеТоваровТовары.Номенклатура.ОбъемДАЛ
	|		ИНАЧЕ ПоступлениеТоваровТовары.КоличествоУпаковок
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ТоварыПоФакту
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	|	И НЕ ПоступлениеТоваровТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыПоФакту.НомерСтроки, 0) КАК НомерСтроки,
	|	ТаблицаТТНПоДаннымПоставщика.ИдентификаторСтроки,
	|	ТаблицаТТНПоДаннымПоставщика.АлкогольнаяПродукция,
	|	ТаблицаТТНПоДаннымПоставщика.Количество,
	|	ТаблицаТТНПоДаннымПоставщика.Справка2,
	|	ЕСТЬNULL(ТоварыПоФакту.Количество, 0) КАК КоличествоФакт
	|ПОМЕСТИТЬ ТаблицаСравнения
	|ИЗ
	|	ТаблицаТТНПоДаннымПоставщика КАК ТаблицаТТНПоДаннымПоставщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыПоФакту КАК ТоварыПоФакту
	|		ПО ТаблицаТТНПоДаннымПоставщика.ИдентификаторСтроки = ТоварыПоФакту.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСравнения.НомерСтроки,
	|	ТаблицаСравнения.ИдентификаторСтроки,
	|	ТаблицаСравнения.АлкогольнаяПродукция,
	|	ТаблицаСравнения.Справка2,
	|	ТаблицаСравнения.Количество,
	|	ТаблицаСравнения.КоличествоФакт
	|ИЗ
	|	ТаблицаСравнения КАК ТаблицаСравнения
	|ГДЕ
	|	ТаблицаСравнения.Количество <> ТаблицаСравнения.КоличествоФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСравнения.НомерСтроки,
	|	ТаблицаСравнения.ИдентификаторСтроки,
	|	ТаблицаСравнения.АлкогольнаяПродукция,
	|	ТаблицаСравнения.Справка2,
	|	ТаблицаСравнения.Количество,
	|	ТаблицаСравнения.КоличествоФакт
	|ИЗ
	|	ТаблицаСравнения КАК ТаблицаСравнения";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СсылкаТТН", ЗначенияРеквизитов.ТТНВходящаяЕГАИС);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Отказ = Ложь;
	
	ТаблицаРасхождений = Новый ТаблицаЗначений;
	ТаблицаРасхождений.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаРасхождений.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка"));
	ТаблицаРасхождений.Колонки.Добавить("КоличествоФакт", Новый ОписаниеТипов("Число"));
	
	ВыборкаПроверкиРасхождений = МассивРезультатов[5].Выбрать();
	Если ВыборкаПроверкиРасхождений.Количество() > 0 Тогда
		Выборка = МассивРезультатов[6].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Результат.ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктРасхожденийТТН;
			
			Если Выборка.КоличествоФакт > Выборка.Количество Тогда
				СтрокаОшибки = НСтр("ru = 'В строке %1 фактическое количество %2 превышает количество поставщика %3, передача такого расхождения в ЕГАИС не допускается.'");
				СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					СтрокаОшибки,
					Выборка.НомерСтроки,
					Выборка.КоличествоФакт,
					Выборка.Количество);
				Если Выборка.НомерСтроки > 0 Тогда
					ИмяПоляТоваров = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", Выборка.НомерСтроки, "КоличествоУпаковок");
				Иначе
					ИмяПоляТоваров = "Объект.Товары";
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрокаОшибки,
					ДокументСсылка,
					ИмяПоляТоваров);
					
				Отказ = Истина;
			КонецЕсли;
			
			СтрокаРасхождений = ТаблицаРасхождений.Добавить();
			СтрокаРасхождений.НомерСтроки = Выборка.НомерСтроки;
			СтрокаРасхождений.ИдентификаторСтроки = Выборка.ИдентификаторСтроки;
			СтрокаРасхождений.КоличествоФакт = Выборка.КоличествоФакт;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Отказ И ТаблицаРасхождений.Количество() > 0 Тогда
		ТТН = ЗначенияРеквизитов.ТТНВходящаяЕГАИС.ПолучитьОбъект();
		ТТН.Товары.ЗагрузитьКолонку(Новый Массив(ТТН.Товары.Количество()), "КоличествоФакт");
		
		Для Каждого СтрокаРасхождений Из ТаблицаРасхождений Цикл
			СтрокаТЧ = ТТН.Товары.Найти(СтрокаРасхождений.ИдентификаторСтроки, "ИдентификаторСтроки");
			Если СтрокаТЧ = Неопределено Тогда
				СтрокаОшибки = НСтр("ru = 'В строке %1 указан неизвестный идентификатор %2 строки ТТН.'");
				СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					СтрокаОшибки,
					СтрокаРасхождений.НомерСтроки,
					СтрокаРасхождений.ИдентификаторСтроки);
				
				Если СтрокаРасхождений.НомерСтроки > 0 Тогда
					ИмяПоляТоваров = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", СтрокаРасхождений.НомерСтроки, "Номенклатура");
				Иначе
					ИмяПоляТоваров = "Объект.Товары";
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрокаОшибки,
					ДокументСсылка,
					ИмяПоляТоваров,,
					Отказ);
			Иначе
				СтрокаТЧ.КоличествоФакт = СтрокаРасхождений.КоличествоФакт;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			ТТН.Комментарий = "Обработан Синхронизацией";
			ТТН.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Результат.Отказ = Отказ;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаРасхожденийТТН_ЕГАИС(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АлкогольнаяПродукция");
	Результат.Колонки.Добавить("Справка2");
	Результат.Колонки.Добавить("Количество");
	Результат.Колонки.Добавить("КоличествоФакт");
	Результат.Колонки.Добавить("Расхождение");
	Результат.Колонки.Добавить("ИдентификаторСтроки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТТНВходящаяЕГАИС", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Проведен
	|	И ПоступлениеТоваров.ЕстьРасхождения
	|	И ПоступлениеТоваров.ТТНВходящаяЕГАИС = &ТТНВходящаяЕГАИС";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РасхожденияПоДокументу = ПолучитьТаблицуРасхождений(ДокументСсылка, Выборка.Ссылка);
		
		Для Каждого СтрокаРасхождений Из РасхожденияПоДокументу Цикл
			СтрокаТаблицы = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаРасхождений);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьРасхожденияТоваровПоступленияТТН_ЕГАИС(ДокументСсылка) Экспорт
	
	Результат = Новый Структура("ЕстьРасхожденияБольшеТТН, ЕстьРасхожденияМеньшеТТН", Ложь, Ложь);
	
	ТаблицаРасхождений = ТаблицаРасхожденийТТН_ЕГАИС(ДокументСсылка);
	ТаблицаРасхождений.Свернуть("АлкогольнаяПродукция", "Расхождение");
	
	Для Каждого СтрокаТаблицы Из ТаблицаРасхождений Цикл
		Если СтрокаТаблицы.Расхождение < 0 Тогда
			Результат.ЕстьРасхожденияБольшеТТН = Истина;
		КонецЕсли;
		
		Если СтрокаТаблицы.Расхождение > 0 Тогда
			Результат.ЕстьРасхожденияМеньшеТТН = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТаблицуРасхождений(ТТНСсылка, ДокументСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АлкогольнаяПродукция");
	Результат.Колонки.Добавить("Справка2");
	Результат.Колонки.Добавить("Количество");
	Результат.Колонки.Добавить("КоличествоФакт");
	Результат.Колонки.Добавить("Расхождение");
	Результат.Колонки.Добавить("ИдентификаторСтроки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СсылкаТТН", ТТНСсылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.НомерСтроки,
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.ИдентификаторСтроки,
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.АлкогольнаяПродукция,
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.КоличествоУпаковок КАК Количество
	|ПОМЕСТИТЬ ТаблицаПоступленияДанныеПоставщика
	|ИЗ
	|	Документ.ПоступлениеТоваров.ТоварыПоДаннымПоставщика КАК ПоступлениеТоваровТоварыПоДаннымПоставщика
	|ГДЕ
	|	ПоступлениеТоваровТоварыПоДаннымПоставщика.Ссылка = &Ссылка
	|	И НЕ ПоступлениеТоваровТоварыПоДаннымПоставщика.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТТНВходящаяЕГАИСТовары.НомерСтроки,
	|	ТТНВходящаяЕГАИСТовары.ИдентификаторСтроки,
	|	ТТНВходящаяЕГАИСТовары.Ссылка,
	|	ТТНВходящаяЕГАИСТовары.Справка2 КАК Справка2
	|ПОМЕСТИТЬ ТаблицаТТН
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС.Товары КАК ТТНВходящаяЕГАИСТовары
	|ГДЕ
	|	ТТНВходящаяЕГАИСТовары.Ссылка = &СсылкаТТН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоступленияДанныеПоставщика.НомерСтроки,
	|	ТаблицаПоступленияДанныеПоставщика.ИдентификаторСтроки,
	|	ТаблицаПоступленияДанныеПоставщика.АлкогольнаяПродукция,
	|	ТаблицаПоступленияДанныеПоставщика.Количество,
	|	ТаблицаТТН.Справка2
	|ПОМЕСТИТЬ ТаблицаТТНПоДаннымПоставщика
	|ИЗ
	|	ТаблицаПоступленияДанныеПоставщика КАК ТаблицаПоступленияДанныеПоставщика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТТН КАК ТаблицаТТН
	|		ПО ТаблицаПоступленияДанныеПоставщика.ИдентификаторСтроки = ТаблицаТТН.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровТовары.НомерСтроки,
	|	ПоступлениеТоваровТовары.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
	|			ТОГДА ПоступлениеТоваровТовары.Количество * ПоступлениеТоваровТовары.Номенклатура.ОбъемДАЛ
	|		ИНАЧЕ ПоступлениеТоваровТовары.КоличествоУпаковок
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ТоварыПоФакту
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	|	И НЕ ПоступлениеТоваровТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыПоФакту.НомерСтроки, 0) КАК НомерСтроки,
	|	ТаблицаТТНПоДаннымПоставщика.ИдентификаторСтроки,
	|	ТаблицаТТНПоДаннымПоставщика.АлкогольнаяПродукция,
	|	ТаблицаТТНПоДаннымПоставщика.Количество,
	|	ТаблицаТТНПоДаннымПоставщика.Справка2,
	|	ЕСТЬNULL(ТоварыПоФакту.Количество, 0) КАК КоличествоФакт
	|ПОМЕСТИТЬ ТаблицаСравнения
	|ИЗ
	|	ТаблицаТТНПоДаннымПоставщика КАК ТаблицаТТНПоДаннымПоставщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыПоФакту КАК ТоварыПоФакту
	|		ПО ТаблицаТТНПоДаннымПоставщика.ИдентификаторСтроки = ТоварыПоФакту.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСравнения.НомерСтроки,
	|	ТаблицаСравнения.ИдентификаторСтроки,
	|	ТаблицаСравнения.АлкогольнаяПродукция,
	|	ТаблицаСравнения.Справка2,
	|	ТаблицаСравнения.Количество,
	|	ТаблицаСравнения.КоличествоФакт
	|ИЗ
	|	ТаблицаСравнения КАК ТаблицаСравнения
	|ГДЕ
	|	ТаблицаСравнения.Количество <> ТаблицаСравнения.КоличествоФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСравнения.НомерСтроки,
	|	ТаблицаСравнения.ИдентификаторСтроки,
	|	ТаблицаСравнения.АлкогольнаяПродукция,
	|	ТаблицаСравнения.Справка2,
	|	ТаблицаСравнения.Количество,
	|	ТаблицаСравнения.КоличествоФакт
	|ИЗ
	|	ТаблицаСравнения КАК ТаблицаСравнения";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[5].Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = МассивРезультатов[6].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		СтрокаТаблицы.Расхождение = СтрокаТаблицы.Количество - СтрокаТаблицы.КоличествоФакт;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////
//СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ЗапросПроверкиСписанияАкцизнойМаркиДляКафе(КодАкцизнойМарки) Экспорт
	 		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАкцизнойМарки",                 КодАкцизнойМарки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктСписанияЕГАИСАкцизныеМарки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктСписанияЕГАИС.АкцизныеМарки КАК АктСписанияЕГАИСАкцизныеМарки
	|ГДЕ
	|	АктСписанияЕГАИСАкцизныеМарки.Ссылка.Проведен
	|	И АктСписанияЕГАИСАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода = &КодАкцизнойМарки";
	
	Результат =  Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ВыполнитьПроверкуНастроекБазыДанных()
	
	УстановитьПривилегированныйРежим(Истина);
		
	//Отключить контроль опасных действий
	
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей(); 
	Для Каждого ПользовательИБ Из МассивПользователейИБ Цикл 
		Если ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях Тогда
			ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
            Попытка
				ПользовательИБ.Записать();	
			Исключение
	   		КонецПопытки; 
		КонецЕсли;	
	КонецЦикла;	
	    
КонецПроцедуры	

&НаСервере
Функция ВернутьСправку2(пАкцизнаяМарка)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТТНВходящаяЕГАИСАкцизныеМарки.Справка2 КАК Справка2
	                      |ИЗ
	                      |	Документ.ТТНВходящаяЕГАИС.АкцизныеМарки КАК ТТНВходящаяЕГАИСАкцизныеМарки
	                      |ГДЕ
	                      |	ТТНВходящаяЕГАИСАкцизныеМарки.АкцизнаяМарка = &АкцизнаяМарка");
	
	Запрос.Параметры.Вставить("АкцизнаяМарка",пАкцизнаяМарка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
	КонецЕсли;	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Справка2; 
	
КонецФункции

&НаСервере
Функция СформироватьДокументыОстаткиЕГАИССервис()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ОстаткиЕГАИС.ВидДокумента КАК ВидДокумента
	             |ИЗ
	             |	Документ.ОстаткиЕГАИС КАК ОстаткиЕГАИС
	             |ГДЕ
	             |	НЕ ОстаткиЕГАИС.ПометкаУдаления
	             |	И ОстаткиЕГАИС.Дата >= &ТекущийДень";
	Запрос.УстановитьПараметр("ТекущийДень",НачалоДня(ТекущаяДата()));
	
	Результат=Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	    	
	
	ЗапросОстатковЕГАИС = Документы.ОстаткиЕГАИС.СоздатьДокумент();
    ЗапросОстатковЕГАИС.Комментарий = "Создан обработкой синхронизации";
	ЗапросОстатковЕГАИС.Дата = ТекущаяДата();
	ЗапросОстатковЕГАИС.Ответственный    = Справочники.Пользователи.Автомат;
	ЗапросОстатковЕГАИС.ТорговыйОбъект   = ЗначениеНастроекПовтИсп.МагазинПоУмолчанию(ЗапросОстатковЕГАИС.ТорговыйОбъект);
	ЗапросОстатковЕГАИС.Организация      = ЗначениеНастроекПовтИсп.ОрганизацияПоУмолчанию(ЗапросОстатковЕГАИС.Организация, ЗапросОстатковЕГАИС.Ответственный);
	ЗапросОстатковЕГАИС.ОрганизацияЕГАИС = Справочники.КлассификаторОрганизацийЕГАИС.ОрганизацияЕГАИСПоОрганизацииИТорговомуОбъекту(ЗапросОстатковЕГАИС.Организация, ЗапросОстатковЕГАИС.ТорговыйОбъект);
	ЗапросОстатковЕГАИС.ВидДокумента 	 = Перечисления.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре1;
	ЗапросОстатковЕГАИС.Записать(РежимЗаписиДокумента.Проведение);	
	
	ЭтотОбъект.ОстаткиСклад=ЗапросОстатковЕГАИС.Ссылка;
	
	ЗапросОстатковЕГАИС = Документы.ОстаткиЕГАИС.СоздатьДокумент();
    ЗапросОстатковЕГАИС.Комментарий = "Создан обработкой синхронизации";
	ЗапросОстатковЕГАИС.Дата = ТекущаяДата();
	ЗапросОстатковЕГАИС.Ответственный    = Справочники.Пользователи.Автомат;
	ЗапросОстатковЕГАИС.ТорговыйОбъект   = ЗначениеНастроекПовтИсп.МагазинПоУмолчанию(ЗапросОстатковЕГАИС.ТорговыйОбъект);
	ЗапросОстатковЕГАИС.Организация      = ЗначениеНастроекПовтИсп.ОрганизацияПоУмолчанию(ЗапросОстатковЕГАИС.Организация, ЗапросОстатковЕГАИС.Ответственный);
	ЗапросОстатковЕГАИС.ОрганизацияЕГАИС = Справочники.КлассификаторОрганизацийЕГАИС.ОрганизацияЕГАИСПоОрганизацииИТорговомуОбъекту(ЗапросОстатковЕГАИС.Организация, ЗапросОстатковЕГАИС.ТорговыйОбъект);
	ЗапросОстатковЕГАИС.ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре2;
	ЗапросОстатковЕГАИС.Записать(РежимЗаписиДокумента.Проведение);	
	
	ЭтотОбъект.ОстаткиТорговыйЗал=ЗапросОстатковЕГАИС.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ВернутьНоменклатуруПоКодуЕгаис(ПКодЕГАИС)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	НЕ Номенклатура.ПометкаУдаления
	                      |	И Номенклатура.КодЕГАИС = &КодЕГАИС");
	
	Запрос.Параметры.Вставить("КодЕГАИС",СокрЛП(ПКодЕГАИС));

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции	

&НаСервере
Функция ЕГАИСВключен()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.ВестиСведенияДляДекларацийПоАлкогольнойПродукции.Получить();

КонецФункции

&НаСервере
Функция ПроверитьАктСписанияЕГАИСПередПодтверждением(ДокументСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Истина;
	
	ДокОбъект = ДокументСсылка.ПолучитьОбъект();
	ДокОбъект.Дата = ТекущаяДата();
	ДокОбъект.Комментарий = "Автоматическая обработка"; 
	ДокОбъект.Ответственный = Справочники.Пользователи.Автомат;
	
	Если НЕ ДокОбъект.Проведен Тогда
		Для Каждого Строка ИЗ ДокОбъект.Товары Цикл
			Строка.АлкогольнаяПродукция = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.НайтиПоКоду(Строка.Номенклатура.КодЕГАИС);
			
			Если НЕ ЗначениеЗаполнено(Строка.АлкогольнаяПродукция) Тогда
				
				ДокОбъект.ОбменДанными.Загрузка = Истина;
							
				Попытка 
					ДокОбъект.Записать();
				Исключение
				КонецПопытки;	
				
				ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Ложь;				
							
				Возврат Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	
			
	Попытка 
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Ложь;
		Возврат Ложь;
	КонецПопытки;	
	
	ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Ложь;
	
	Возврат Истина;
	
КонецФункции	

&НаКлиенте
Процедура ВыгрузкаДокумента_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлыВнешнихОбработок()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Для Каждого Строка Из Объект.ФайлыВнешнихОбработок Цикл
			
			Наименование   = Строка.Наименование;
			ДвоичныеДанные = Base64Значение(Строка.Данные);
			Расширение 	   = Строка.Расширение;
			
			ИмяВременногоФайла = КаталогВременныхФайлов()+Наименование+"."+Расширение;
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			
			АдресДанныхОбработки 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			ДвоичныеДанныеОбработки = ПолучитьИзВременногоХранилища(АдресДанныхОбработки);
			
			текСправочник = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Строка.Наименование);
			
			Если текСправочник = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
				обСправочник = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
				обСправочник.Наименование = Наименование;
				обСправочник.Ответственный = Справочники.Пользователи.Автомат;
			Иначе	 
				обСправочник = текСправочник.ПолучитьОбъект(); 
			КонецЕсли;	
			
			обСправочник.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
			обСправочник.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеОбработки, Новый СжатиеДанных(9));
			
			ПараметрыРегистрации = Новый Структура;
			ПараметрыРегистрации.Вставить("Успех", Ложь);
			ПараметрыРегистрации.Вставить("АдресДанныхОбработки", АдресДанныхОбработки);
			ПараметрыРегистрации.Вставить("ОтключатьПубликацию", Ложь);
			ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие", Ложь);
			ПараметрыРегистрации.Вставить("Конфликтующие", Новый СписокЗначений);
			ПараметрыРегистрации.Вставить("ЭтоОтчет",?(Расширение="erf",Истина,Ложь));
			ПараметрыРегистрации.Вставить("ИмяФайла",Наименование+"."+Расширение);
			
			РезультатРегистрации = ДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(обСправочник, ПараметрыРегистрации);
			
			обСправочник.Разделы.Очистить();
			новСтрокаРазделы = обСправочник.Разделы.Добавить();
			новСтрокаРазделы.Раздел = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Продажи (Подсистема)");
			
			обСправочник.Записать();
			
			//Прописать пользователей
			
			Запись = РегистрыСведений.ПользовательскиеНастройкиДоступаКОбработкам.СоздатьМенеджерЗаписи();
			Запись.ДополнительныйОтчетИлиОбработка  = обСправочник.Ссылка;
			Запись.ИдентификаторКоманды             = обСправочник.Команды[0].Идентификатор;
			Запись.Пользователь                     = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
			Запись.Доступно                         = Истина;
			Запись.Записать(Истина);
			
			Если Строка.Товаровед Тогда
				Запись = РегистрыСведений.ПользовательскиеНастройкиДоступаКОбработкам.СоздатьМенеджерЗаписи();
				Запись.ДополнительныйОтчетИлиОбработка  = обСправочник.Ссылка;
				Запись.ИдентификаторКоманды             = обСправочник.Команды[0].Идентификатор;
				Запись.Пользователь                     = Справочники.Пользователи.НайтиПоНаименованию("Товаровед");
				Запись.Доступно                         = Истина;
				Запись.Записать(Истина);
			КонецЕсли;	
			
			Если Строка.ТорговыйПредставитель Тогда
				Запись = РегистрыСведений.ПользовательскиеНастройкиДоступаКОбработкам.СоздатьМенеджерЗаписи();
				Запись.ДополнительныйОтчетИлиОбработка  = обСправочник.Ссылка;
				Запись.ИдентификаторКоманды             = обСправочник.Команды[0].Идентификатор;
				Запись.Пользователь                     = Справочники.Пользователи.НайтиПоНаименованию("Торговый представитель");
				Запись.Доступно                         = Истина;
				Запись.Записать(Истина);
			КонецЕсли;	
			
		КонецЦикла;
		
		Объект.ФайлыВнешнихОбработок.Очистить();
		
	Исключение
	КонецПопытки;
		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокТТНВходящиеЕГАИСКПодтверждению()
	
	УстановитьПривилегированныйРежим(Истина);
	
	лТТНВходящиеЕГАИСКПодтверждению = ЭтотОбъект.ТТНВходящиеЕГАИСКПодтверждению;
	лТТНВходящиеЕГАИСКПодтверждению.Очистить();
		
	ЭтоКафе = Константы.ТрадицияКонфигурацияДляКафе.Получить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Результат.ТТНВходящаяЕГАИС КАК ТТНВходящаяЕГАИС,
	                      |	Результат.ТТНВходящаяЕГАИС.Дата КАК ТТНВходящаяЕГАИСДата,
	                      |	Результат.ВидОперации КАК ВидОперации,
	                      |	Результат.ИдентификаторЕГАИС КАК ИдентификаторЕГАИС,
	                      |	Результат.СтатусОбработки КАК СтатусОбработки,
	                      |	Результат.ТТНВходящаяЕГАИС.ДокументОснование КАК ДокументОснование
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ЕГАИС.Ссылка КАК ТТНВходящаяЕГАИС,
	                      |		ЕГАИС.ВидОперации КАК ВидОперации,
	                      |		ЕГАИС.ИдентификаторЕГАИС КАК ИдентификаторЕГАИС,
	                      |		СтатусыДокументовЕГАИС.Статус КАК СтатусОбработки
	                      |	ИЗ
	                      |		Документ.ТТНВходящаяЕГАИС КАК ЕГАИС
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	                      |			ПО ЕГАИС.Ссылка = СтатусыДокументовЕГАИС.Документ
	                      |	ГДЕ
	                      |		ЕГАИС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТТНВходящейЕГАИС.ПриходнаяНакладная)
	                      |		И ЕГАИС.Дата МЕЖДУ &ДатаНачало И &ТекущаяДата
	                      |		И СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.ПринятИзЕГАИС)
	                      |		И ЕГАИС.ДатаТТН <= &ТекущаяДата) КАК Результат
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Результат.ТТНВходящаяЕГАИС,
	                      |	Результат.СтатусОбработки,
	                      |	Результат.ИдентификаторЕГАИС,
	                      |	Результат.ВидОперации,
	                      |	Результат.ТТНВходящаяЕГАИС.Дата,
	                      |	Результат.ТТНВходящаяЕГАИС.ДокументОснование");
			
	Запрос.Параметры.Вставить("ТекущаяДата",КонецДня(ТекущаяДата()));
	Запрос.Параметры.Вставить("ДатаНачало",НачалоДня(ТекущаяДата() -60*60*24*45));
		
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		 ТТНВходящаяЕГАИС =  Выборка.ТТНВходящаяЕГАИС;
		 
		 Попытка
		 
		 	лОбъект 						= ТТНВходящаяЕГАИС.ПолучитьОбъект();
		 	ДанныеПроверяемогоДокумента 	= Документы.ТТНВходящаяЕГАИС.ВходящееДеревоУпаковок(ТТНВходящаяЕГАИС);
		 	ДеревоУпаковок 					= ДанныеПроверяемогоДокумента.ДеревоУпаковок;
		 
		 	ПрисутствуетАкцизныйТовар = ?(ДеревоУпаковок.Строки.Количество() = 0,Ложь,Истина);
		                                                                                  
		 	Если ПрисутствуетАкцизныйТовар Тогда
				Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
					Продолжить;
				КонецЕсли;
	     	КонецЕсли;	 
		 
		 	НоваяСтрока = лТТНВходящиеЕГАИСКПодтверждению.Добавить();
		 	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		 	НоваяСтрока.АкцизныйТовар = ПрисутствуетАкцизныйТовар;
		Исключение	
		КонецПопытки;	
			
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокАктСписанияЕГАИСКПодтверждению(ЗаВесьПериод=Ложь)
	
	лАктСписанияЕГАИСКПодтверждению = ЭтотОбъект.АктСписанияЕГАИСКПодтверждению;
	лАктСписанияЕГАИСКПодтверждению.Очистить();
	    	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АктСписанияЕГАИС.Ссылка КАК АктСписанияЕГАИС
	                      |ИЗ
	                      |	Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	                      |		ПО АктСписанияЕГАИС.Ссылка = СтатусыДокументовЕГАИС.Документ
	                      |ГДЕ
	                      |	АктСписанияЕГАИС.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЕГАИС.АктСписанияИзРегистра2)
	                      |	И АктСписанияЕГАИС.ПричинаСписания = ЗНАЧЕНИЕ(Перечисление.ПричиныСписанийЕГАИС.Реализация)
	                      |	И АктСписанияЕГАИС.Дата <= &ДатаОкончания
	                      |	И АктСписанияЕГАИС.Дата >= &ДатаНачала
	                      |	И НЕ АктСписанияЕГАИС.ПометкаУдаления
	                      |	И (СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиАктаСписанияЕГАИС.Черновик)
	                      |			ИЛИ СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПередачи)
	                      |			ИЛИ СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПроведенияЕГАИС))
	                      |	И НЕ АктСписанияЕГАИС.Ответственный = &Автомат
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	АктСписанияЕГАИС.Дата");
	
	Запрос.Параметры.Вставить("Автомат",Справочники.Пользователи.Автомат);
	
	Если ЗаВесьПериод Тогда
		Запрос.Параметры.Вставить("ДатаНачала",Дата(1, 1, 1));    
		Запрос.Параметры.Вставить("ДатаОкончания",ТекущаяДата());
	Иначе	
		Запрос.Параметры.Вставить("ДатаНачала",НачалоДня(ТекущаяДата() -60*60*24*30));    
		Запрос.Параметры.Вставить("ДатаОкончания",НачалоДня(ТекущаяДата() -60*60*24*7));
	КонецЕсли;	
	  	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	лАктСписанияЕГАИСКПодтверждению.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСписокДокументовНаСервере()  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОтчетОРозничныхПродажахИзменения.Ссылка.Ссылка КАК Документ,
	               |	ОтчетОРозничныхПродажахИзменения.Ссылка.СуммаДокумента КАК Сумма,
	               |	""Отчет о розн. продажах"" КАК ТипДокумента
	               |ПОМЕСТИТЬ СписокДокументов
	               |ИЗ
	               |	Документ.ОтчетОРозничныхПродажах.Изменения КАК ОтчетОРозничныхПродажахИзменения
	               |ГДЕ
	               |	ОтчетОРозничныхПродажахИзменения.Узел = &Узел
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетОРозничныхПродажахИзменения.Ссылка.Ссылка,
	               |	ОтчетОРозничныхПродажахИзменения.Ссылка.СуммаДокумента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровИзменения.Ссылка.Ссылка,
	               |	ПоступлениеТоваровИзменения.Ссылка.СуммаДокумента,
	               |	""Поступления""
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Изменения КАК ПоступлениеТоваровИзменения
	               |ГДЕ
	               |	ПоступлениеТоваровИзменения.Узел = &Узел
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровИзменения.Ссылка.Ссылка,
	               |	ПоступлениеТоваровИзменения.Ссылка.СуммаДокумента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОприходованиеТоваровИзменения.Ссылка,
	               |	ОприходованиеТоваровИзменения.Ссылка.СуммаДокумента,
	               |	""Корректировки""
	               |ИЗ
	               |	Документ.ОприходованиеТоваров.Изменения КАК ОприходованиеТоваровИзменения
	               |ГДЕ
	               |	ОприходованиеТоваровИзменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СписаниеТоваровИзменения.Ссылка,
	               |	СписаниеТоваровИзменения.Ссылка.СуммаДокумента,
	               |	""Корректировки""
	               |ИЗ
	               |	Документ.СписаниеТоваров.Изменения КАК СписаниеТоваровИзменения
	               |ГДЕ
	               |	СписаниеТоваровИзменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РасходныйКассовыйОрдерИзменения.Ссылка,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.СуммаДокумента,
	               |	""РКО""
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер.Изменения КАК РасходныйКассовыйОрдерИзменения
	               |ГДЕ
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	               |	И РасходныйКассовыйОрдерИзменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратТоваровОтПокупателяИзменения.Ссылка,
	               |	ВозвратТоваровОтПокупателяИзменения.Ссылка.СуммаДокумента,
	               |	""Возвраты от покупателя""
	               |ИЗ
	               |	Документ.ВозвратТоваровОтПокупателя.Изменения КАК ВозвратТоваровОтПокупателяИзменения
	               |ГДЕ
	               |	ВозвратТоваровОтПокупателяИзменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратТоваровПоставщикуИзменения.Ссылка,
	               |	ВозвратТоваровПоставщикуИзменения.Ссылка.СуммаДокумента,
	               |	""Возвраты поставщику""
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Изменения КАК ВозвратТоваровПоставщикуИзменения
	               |ГДЕ
	               |	ВозвратТоваровПоставщикуИзменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПересортицаТоваровИзменения.Ссылка,
	               |	0,
	               |	""Корректировки""
	               |ИЗ
	               |	Документ.ПересортицаТоваров.Изменения КАК ПересортицаТоваровИзменения
	               |ГДЕ
	               |	ПересортицаТоваровИзменения.Узел = &Узел
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдерИзменения.Ссылка,
	               |	ПриходныйКассовыйОрдерИзменения.Ссылка.СуммаДокумента,
	               |	""ПКО""
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.Изменения КАК ПриходныйКассовыйОрдерИзменения
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерИзменения.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеДоходы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СписокДокументов.Документ КАК Документ,
	               |	СписокДокументов.Сумма КАК Сумма,
	               |	СписокДокументов.ТипДокумента КАК ТипДокумента,
	               |	ЕСТЬNULL(РезультатыОбменаДанными.Причина, """") КАК Ошибка
	               |ИЗ
	               |	СписокДокументов КАК СписокДокументов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РезультатыОбменаДанными КАК РезультатыОбменаДанными
	               |		ПО СписокДокументов.Документ = РезультатыОбменаДанными.ПроблемныйОбъект
	               |ИТОГИ ПО
	               |	ТипДокумента";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗначениеВДанныеФормы(Результат, ДокументыКВыгрузке);
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораДокумента(СсылкаНаДокумент)
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ТТНВходящаяЕГАИС") Тогда
		НоваяСтрока = ЭтотОбъект.ТТНВходящиеЕГАИСКПодтверждению.Добавить();
		НоваяСтрока.ТТНВходящаяЕГАИС = СсылкаНаДокумент;
		Попытка
			лПараметрыДокумента = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(СсылкаНаДокумент);
			НоваяСтрока.СтатусОбработки = лПараметрыДокумента.Статус;
		Исключение
		КонецПопытки;	
		
	Иначе	
		Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СсылкаНаДокумент);
		КонецЕсли;
		ОбновитьСписокДокументовНаСервере();
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатаПоследнегоОбмена()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаПоследнегоОбмена		 = Константы.ТрадДатаПоследнегоОбмена.Получить();
	ДатаПоследнегоУдачногоОбмена = Константы.ТрадДатаПоследнегоУдачногоОбмена.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВводаКодаНоменклатуры(Строка, ДопПараметры) Экспорт
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодНоменклатуры = СокрЛП(Строка);
	СоответствуетШаблону = (СтрДлина(КодНоменклатуры) = 5);
	ДопустимыеСимволы = "0123456789Т";//код номенклатуры сторонних поставщиков начинается с Т
	Для Индекс = 1 По СтрДлина(КодНоменклатуры) Цикл
		Если Найти(ДопустимыеСимволы, Сред(КодНоменклатуры, Индекс, 1)) = 0 Тогда
			СоответствуетШаблону = Ложь;
		КонецЕсли;
	КонецЦикла;
		
	Если НЕ СоответствуетШаблону Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код номенклатуры не соответствует шаблону - должен состоять из 5 цифр или буквы ""Т"" и 4 цифр");
	Иначе	
		Если ВыполнитьЗагрузкуНоменклатуры(Строка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура " + Строка + " загружена");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка не выполнена");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьНомераНаСервере()
	Узел = ПланыОбмена.РозницаСтандартАлко.НайтиПоКоду("ЦЕНТР");
	Объект = Узел.ПолучитьОбъект();
	Объект.НомерОтправленного = 0;
	Объект.НомерПринятого = 0;
	Объект.Записать();
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицыЗакладкиЕГАИСНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	лТТНВходящиеЕГАИСКПодтверждению = ЭтотОбъект.ТТНВходящиеЕГАИСКПодтверждению;
	лТТНВходящиеЕГАИСКПодтверждению.Очистить();
		
КонецПроцедуры	

&НаКлиенте
Процедура РазвернутьСписокДокументов()
	СтрокиДокументов = ДокументыКВыгрузке.ПолучитьЭлементы();
	Для Каждого Строка Из СтрокиДокументов Цикл
		Элементы.ДокументыКВыгрузке.Развернуть(Строка.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	Элементы.ДокументыКВыгрузкеУдалитьВсе.Видимость = РольДоступна("ПолныеПрава");
	Элементы.ДокументыКВыгрузкеУдалитьДокумент.Видимость = РольДоступна("ПолныеПрава");
	Элементы.ЗапросНоменклатуры.Видимость  = РольДоступна("ПолныеПрава");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьДокументНаСервере(Узел, СсылкаНаДокумент)
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, СсылкаНаДокумент);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсеНаСервере(Узел)
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
КонецПроцедуры

&НаСервере
Процедура СформироватьАктыСписанияЕГАИСРеализацияДляКафеСервер()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭтоКафе = Ложь;
	
	Попытка 
		ЭтоКафе =  Константы.ТрадицияКонфигурацияДляКафе.Получить();
	Исключение
	КонецПопытки;	
	
	Если НЕ ЭтоКафе Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах,
	                      |	ЧекККМТовары.Номенклатура КАК Номенклатура,
	                      |	ЧекККМАкцизныеМарки.КодАкцизнойМарки КАК КодАкцизнойМарки,
	                      |	МАКСИМУМ(ЧекККМТовары.Цена) КАК Цена,
	                      |	ВЫБОР
	                      |		КОГДА ЧекККМАкцизныеМарки.КодАкцизнойМарки ПОДОБНО &ПолеПоиска
	                      |				ИЛИ АкцизныеМаркиЕГАИС.Справка2.Поштучная = ИСТИНА
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК ПомарочныйУчет,
	                      |	АкцизныеМаркиЕГАИС.Справка2 КАК Справка2,
	                      |	АкцизныеМаркиЕГАИС.Статус КАК СтатусАкцизнойМарки,
	                      |	ЧекККМАкцизныеМарки.АкцизнаяМарка КАК АкцизнаяМарка
	                      |ИЗ
	                      |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
	                      |				ПО ЧекККМАкцизныеМарки.АкцизнаяМарка = АкцизныеМаркиЕГАИС.АкцизнаяМарка
	                      |			ПО ЧекККМТовары.Ссылка = ЧекККМАкцизныеМарки.Ссылка
	                      |				И ЧекККМТовары.КлючСвязи = ЧекККМАкцизныеМарки.КлючСвязи
	                      |		ПО ОтчетОРозничныхПродажах.Ссылка = ЧекККМТовары.Ссылка.ОтчетОРозничныхПродажах
	                      |ГДЕ
	                      |	НЕ ОтчетОРозничныхПродажах.Ссылка В
	                      |				(ВЫБРАТЬ
	                      |					АктСписанияЕГАИС.ДокументОснование КАК ДокументОснование
	                      |				ИЗ
	                      |					Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
	                      |				ГДЕ
	                      |					АктСписанияЕГАИС.Проведен
	                      |					И АктСписанияЕГАИС.ПричинаСписания = ЗНАЧЕНИЕ(Перечисление.ПричиныСписанийЕГАИС.Реализация))
	                      |	И ОтчетОРозничныхПродажах.Проведен
	                      |	И НЕ ЕСТЬNULL(ЧекККМАкцизныеМарки.КодАкцизнойМарки, 0) = 0
	                      |	И ЧекККМТовары.Номенклатура.ВидНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОтчетОРозничныхПродажах.Ссылка,
	                      |	ЧекККМТовары.Номенклатура,
	                      |	ЧекККМАкцизныеМарки.КодАкцизнойМарки,
	                      |	АкцизныеМаркиЕГАИС.Справка2,
	                      |	ЧекККМАкцизныеМарки.АкцизнаяМарка,
	                      |	АкцизныеМаркиЕГАИС.Статус,
	                      |	ВЫБОР
	                      |		КОГДА ЧекККМАкцизныеМарки.КодАкцизнойМарки ПОДОБНО &ПолеПоиска
	                      |				ИЛИ АкцизныеМаркиЕГАИС.Справка2.Поштучная = ИСТИНА
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ОтчетОРозничныхПродажах
	                      |ИТОГИ ПО
	                      |	ОтчетОРозничныхПродажах,
	                      |	ПомарочныйУчет");
	
	Запрос.Параметры.Вставить("ПолеПоиска","______________________________________________________________________________________________________________________________________________________");
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ;
	КонецЕсли;	  
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		ВыборкаПризнакПомарочныйУчет  = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПризнакПомарочныйУчет.Следующий() Цикл
			
			Списание = Документы.АктСписанияЕГАИС.СоздатьДокумент();
			Списание.Дата			   = ТекущаяДата();
			Списание.ПричинаСписания   = Перечисления.ПричиныСписанийЕГАИС.Реализация;
			Списание.Ответственный     = ПараметрыСеанса.ТекущийПользователь;
			Списание.ТорговыйОбъект    = ЗначениеНастроекПовтИсп.МагазинПоУмолчанию(Списание.ТорговыйОбъект);
			Списание.Организация       = ЗначениеНастроекПовтИсп.ОрганизацияПоУмолчанию(Списание.Организация, Списание.Ответственный);
			Списание.ОрганизацияЕГАИС  = Справочники.КлассификаторОрганизацийЕГАИС.ОрганизацияЕГАИСПоОрганизацииИТорговомуОбъекту(Списание.Организация, Списание.ТорговыйОбъект);
			Списание.ДокументОснование = Выборка.ОтчетОРозничныхПродажах;
			
			Если ВыборкаПризнакПомарочныйУчет.ПомарочныйУчет Тогда
				Списание.ВидДокумента  = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра1; 
				Списание.СтатусПроверкиИПодбора = Перечисления.СтатусыПроверкиИПодбораИС.Завершено;
			Иначе	                                     
				Списание.ВидДокумента  = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра2;
			КонецЕсли;	
						
			ВыборкаДетали = ВыборкаПризнакПомарочныйУчет.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				
				Если НЕ ЗапросПроверкиСписанияАкцизнойМаркиДляКафе(ВыборкаДетали.КодАкцизнойМарки) Тогда
					Продолжить;
				КонецЕсли;	 
				
				лИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
				
				лСправка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
				
				Если ВыборкаПризнакПомарочныйУчет.ПомарочныйУчет Тогда
					Если ЗначениеЗаполнено(ВыборкаДетали.Справка2) Тогда
						лСправка2 = ВыборкаДетали.Справка2;
					Иначе
						лСправка2 = ВернутьСправку2(ВыборкаДетали.АкцизнаяМарка);						
					КонецЕсли;
					
					Если лСправка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка() Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;	
			        				
				НоваяСтрока = Списание.Товары.Добавить();
				НоваяСтрока.ИдентификаторСтроки  = лИдентификаторСтроки;
				НоваяСтрока.Номенклатура 		 = ВыборкаДетали.Номенклатура;
				НоваяСтрока.АлкогольнаяПродукция = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.НайтиПоКоду(ВыборкаДетали.Номенклатура.КодЕгаис);
				НоваяСтрока.Количество 		     = 1;
				НоваяСтрока.КоличествоУпаковок   = 1;
				НоваяСтрока.Сумма                = ВыборкаДетали.Цена; 
				НоваяСтрока.Цена                 = ВыборкаДетали.Цена;

				
				Если ВыборкаПризнакПомарочныйУчет.ПомарочныйУчет Тогда
					 НоваяСтрока.Справка2 = лСправка2;
				КонецЕсли;	
				 
				ОбработатьРегистрСведенийАкцизныеМарки(ВыборкаДетали.АкцизнаяМарка,Списание.ОрганизацияЕГАИС);
 
					
				НоваяСтрока = Списание.АкцизныеМарки.Добавить();
				НоваяСтрока.ИдентификаторСтроки = лИдентификаторСтроки;
				НоваяСтрока.КодАкцизнойМарки 	= ВыборкаДетали.КодАкцизнойМарки;
				//НоваяСтрока.АкцизнаяМарка		= Справочники.ШтрихкодыУпаковокТоваров. .ПолучитьАкцизнуюМаркуПоКоду(ВыборкаДетали.КодАкцизнойМарки);
				НоваяСтрока.АкцизнаяМарка		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(ВыборкаДетали.КодАкцизнойМарки);

				НоваяСтрока.Количество			= 1;
				
			КонецЦикла;
			
			Если НЕ Списание.Товары.Количество()  = 0 Тогда
				Списание.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				НоваяСтрока = ЭтотОбъект.АктСписанияЕГАИСКПодтверждению.Добавить();
				НоваяСтрока.АктСписанияЕГАИС =   Списание.Ссылка;
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьРегистрСведенийАкцизныеМарки(пАкцизнаяМарка,пОрганизацияЕГАИС)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.АкцизныеМаркиЕГАИС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.АкцизнаяМарка.Установить(пАкцизнаяМарка);
	НаборЗаписей.Записать();   
		
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////////////////////////////////
//СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ  ЕГАИС

&НаСервере
Функция ЗаполнитьРасхожденияВДокументеТТНВходящая(пТТНВходящаяЕГАИС)
	
	ТаблицаРасхождений =  ТаблицаРасхожденийТТН_ЕГАИС(пТТНВходящаяЕГАИС);
	 		
	Попытка
		
		ДокументОбъект = пТТНВходящаяЕГАИС.ПолучитьОбъект();
		
		Для каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
			
			ЭтоТоварБезАкцизныхМарок = ?(пТТНВходящаяЕГАИС.АкцизныеМарки.Найти(СтрокаТовары.Справка2,"Справка2")= Неопределено,Истина,Ложь);
						
			Если ТаблицаРасхождений <> Неопределено Тогда
				НайденнаяСтрока = ТаблицаРасхождений.Найти(СтрокаТовары.ИдентификаторСтроки, "ИдентификаторСтроки");
				Если ЗначениеЗаполнено(НайденнаяСтрока) И ЭтоТоварБезАкцизныхМарок Тогда
					СтрокаТовары.КоличествоФакт = НайденнаяСтрока.КоличествоФакт;
				Иначе
					СтрокаТовары.КоличествоФакт = СтрокаТовары.Количество;
				КонецЕсли;
			Иначе
				СтрокаТовары.КоличествоФакт = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		ДокументОбъект.СтатусПроверкиИПодбора = Перечисления.СтатусыПроверкиИПодбораИС.Завершено;
		ДокументОбъект.ЕстьРасхождения = Истина;
		ДокументОбъект.Записать();
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура НовыеПоступленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поступление = Объект.НовыеПоступления[ВыбраннаяСтрока].ПоступлениеТоваров;
	Если ЗначениеЗаполнено(Поступление) Тогда
		ОткрытьФорму("Документ.ПоступлениеТоваров.ФормаОбъекта", Новый Структура("Ключ", Поступление), ЭтаФорма, Поступление);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКВыгрузкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция НачатьПечатьЦенников(СсылкаНаДокумент)
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить(СсылкаНаДокумент);
	
	ПараметрыПечатиЦенников = УправлениеПечатьюРТ.СтруктураПараметровПечатиЦенниковИЭтикеток();
	ПараметрыПечатиЦенников.ИмяПроцедурыПодготовкиСтруктурыДанных = "УправлениеПечатьюРТВызовСервера.ПодготовитьСтруктуруДанныхЦенниковИЭтикетокДляУстановкиЦен";
	ПараметрыПечатиЦенников.ИмяДокумента = "УстановкаЦенНоменклатуры";
	ПараметрыПечатиЦенников.УстановитьРежим = "ПечатьЦенников";
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(УправлениеПечатьюРТ.СтруктураДанныхЦенниковИЭтикетокДляУстановкиЦен(СписокДокументов, Новый Массив, ПараметрыПечатиЦенников));
	СтруктураДанных.СтруктураДействий.Вставить("ЗаполнитьМагазин", ПараметрыСеанса.ТекущийМагазин);
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("АдресВХранилище", ПоместитьВоВременноеХранилище(СтруктураДанных));
	
	Возврат ПараметрыЗапуска;
КонецФункции

&НаСервере
Процедура ВыполнитьОбменНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыполнитьОбмен();
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	Элементы.ЗагруженныеДанные.Заголовок = "Загруженные поступления (" + Объект.НовыеПоступления.Количество() + ")";
	Если Объект.НовыеПоступления.Количество() > 0 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ЗагруженныеДанные;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗагрузкуНоменклатуры(КодНоменклатуры)
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ЗапроситьНоменклатуруПоКоду(КодНоменклатуры);
	
	Возврат ЗначениеЗаполнено(Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры));
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ДОКУМЕНТАМИ ЕГАИС

&НаСервере
Функция ПодготовитьВходящуюТТНДляПодтверждения(ТТНВходящаяЕГАИС) 
	
    	УстановитьПривилегированныйРежим(Истина);
	
	    лОбъект 						= ТТНВходящаяЕГАИС.ПолучитьОбъект();
		
		//
		Попытка
			
			ПоступлениеТоваров 		 =  ТТНВходящаяЕГАИС.ДокументОснование;
			ПоступлениеТоваровТовары =  ПоступлениеТоваров.Товары;
						
			лТребЗапистьТТН = Ложь;
			Для Каждого лСтрока Из  лОбъект.Товары Цикл
				Если ЗначениеЗаполнено(лСтрока.Номенклатура) Тогда
					 Продолжить;
				КонецЕсли;
				
				лТребЗапистьТТН = Истина;
				
				НайденнаяСтрока = ПоступлениеТоваровТовары.Найти(лСтрока.АлкогольнаяПродукция,"АлкогольнаяПродукция"); 
				Если Не НайденнаяСтрока = Неопределено Тогда 
					лСтрока.Номенклатура = НайденнаяСтрока.Номенклатура; 
				Иначе	
					лСтрока.Номенклатура = ВернутьНоменклатуруПоКодуЕгаис(лСтрока.АлкогольнаяПродукция.Код); 
				КонецЕсли;	
					
			КонецЦикла;
			
			Если лТребЗапистьТТН Тогда
		    	лОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;	
						
		Исключение	
        КонецПопытки;
		
		//
		
		ДанныеПроверяемогоДокумента 	= Документы.ТТНВходящаяЕГАИС.ВходящееДеревоУпаковок(ТТНВходящаяЕГАИС);

		ДеревоУпаковок 					= ДанныеПроверяемогоДокумента.ДеревоУпаковок;
				
	    ДеревоУпаковок.Колонки.Добавить("ШтрихкодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
		ДеревоУпаковок.Колонки.Добавить("КоличествоАкцизныхМарок", ОбщегоНазначения.ОписаниеТипаЧисло(15));
		ДеревоУпаковок.Колонки.Добавить("Коэффициент", ОбщегоНазначения.ОписаниеТипаЧисло(15,4));   			
		
		ТаблицаНеМаркируемойПродукции  	= ДанныеПроверяемогоДокумента.ТоварыБезАкцизныхМарок;
		ТаблицаНеМаркируемойПродукции.Колонки.Добавить("КоличествоФактическое", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
				
		//ШтрихкодыУпаковок = ИнтеграцияЕГАИС.ШтрихкодыУпаковок(ИнтеграцияЕГАИС.ЗначенияШтрихкодовИзДереваУпаковок(ДеревоУпаковок));
		ШтрихкодыУпаковок = ШтрихкодированиеИС.ШтрихкодыУпаковок(ИнтеграцияЕГАИС.ЗначенияШтрихкодовИзДереваУпаковок(ДеревоУпаковок));
			                       		
		
		НачатьТранзакцию();
	
		Попытка
		    лОбъект.АкцизныеМарки.Очистить();
			
			ШтрихкодированиеЕГАИС.СоздатьШтрихкодыУпаковок(ДеревоУпаковок,ШтрихкодыУпаковок,Ложь, лОбъект.Грузополучатель);
				
			//Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодыУпаковок(ДеревоУпаковок,ШтрихкодыУпаковок, Ложь, лОбъект.Грузополучатель);
		
			Документы.ТТНВходящаяЕГАИС.ЗаполнитьАкцизныеМарки(лОбъект,ДеревоУпаковок);
			Документы.ТТНВходящаяЕГАИС.ЗаполнитьФактическоеКоличество(лОбъект,ДеревоУпаковок,ТаблицаНеМаркируемойПродукции);
		
			лОбъект.СтатусПроверкиИПодбора = Перечисления.СтатусыПроверкиИПодбораИС.Завершено;    
			
			Для Каждого лСтрока Из  лОбъект.Товары Цикл
				лСтрока.КоличествоФакт = лСтрока.Количество;
			КонецЦикла;	
			
			лОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ПараметрыОбновленияСтатуса = ИнтеграцияЕГАИС.ПараметрыОбновленияСтатуса();
			ПараметрыОбновленияСтатуса.ОбновлятьДвижения = Ложь;
			ПараметрыОбновленияСтатуса.СтатусОбработки   = Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС;
			ПараметрыОбновленияСтатуса.ДокументОбъект    = лОбъект;
		
			Документы.ТТНВходящаяЕГАИС.ОбновитьСтатусПослеПолученияДанных(лОбъект.Ссылка, Перечисления.ВидыДокументовЕГАИС.ТТН, ПараметрыОбновленияСтатуса);
		
			ЗафиксироватьТранзакцию();
			
			Возврат Истина;
		
		Исключение
		
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось сохранить результаты проверки в документе: %1 по причине: %2'"),лОбъект.Ссылка,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ОтменитьТранзакцию();
			
			Возврат Ложь;
			
		КонецПопытки;
		
КонецФункции	

&НаСервере
Процедура ВыполнитьОбменЕГАИС()

	//ИнтеграцияЕГАИСВызовСервера
	ОбменДаннымиЕГАИСВызовСервера.ВыполнитьОбмен(Неопределено);
	  
КонецПроцедуры

&НаКлиенте  
Процедура ПодтвердитьТТНВходящиеЕГАИС()
	 	
	Если ЭтотОбъект.ТТНВходящиеЕГАИСКПодтверждению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
		
	Для Каждого Строка ИЗ ЭтотОбъект.ТТНВходящиеЕГАИСКПодтверждению Цикл
		
		лРезультат = ПодготовитьВходящуюТТНДляПодтверждения(Строка.ТТНВходящаяЕГАИС);
		Если НЕ лРезультат Тогда 
			Продолжить;
		КонецЕсли;	
		
		СтруктураРасхождений = ПроверитьРасхожденияТоваровПоступленияТТН_ЕГАИС(Строка.ТТНВходящаяЕГАИС);
		
		Если СтруктураРасхождений.ЕстьРасхожденияБольшеТТН ИЛИ СтруктураРасхождений.ЕстьРасхожденияМеньшеТТН Тогда
			
			Если НЕ ЗаполнитьРасхожденияВДокументеТТНВходящая(Строка.ТТНВходящаяЕГАИС) Тогда
				Продолжить;
			КонецЕсли;	
			
			ОбменДаннымиЕГАИСКлиент.ПодготовитьКПередаче(Строка.ТТНВходящаяЕГАИС,ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ПодтвердитеПолучениеАктРасхождений"));
			
		Иначе	
			
			ОбменДаннымиЕГАИСКлиент.ПодготовитьКПередаче(Строка.ТТНВходящаяЕГАИС,ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ПодтвердитеПолучениеАктПодтверждения"));
			
		КонецЕсли;	
		   		
	КонецЦикла;	
	   	
	ЭтотОбъект.ТТНВходящиеЕГАИСКПодтверждению.Очистить();
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры	

&НаКлиенте
Процедура СформироватьАктыСписанияЕГАИСРеализацияДляКафе()

	СформироватьАктыСписанияЕГАИСРеализацияДляКафеСервер();

КонецПроцедуры	

&НаКлиенте
Процедура ПодтвердитьАктыСписанияЕГАИС()
	 	
	Если ЭтотОбъект.АктСписанияЕГАИСКПодтверждению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
		
	ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.АктСписанияИзРегистра2");
	
	
	Для Каждого Строка ИЗ ЭтотОбъект.АктСписанияЕГАИСКПодтверждению Цикл
		
		ДокументСсылка = Строка.АктСписанияЕГАИС;
		
		Если НЕ ПроверитьАктСписанияЕГАИСПередПодтверждением(ДокументСсылка) Тогда
			Продолжить;
		КонецЕсли;	
		
		
		ОбменДаннымиЕГАИСКлиент.ПодготовитьКПередаче(ДокументСсылка,ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ПередайтеДанные"));
		
	КонецЦикла;		
	
	ЭтотОбъект.АктСписанияЕГАИСКПодтверждению.Очистить();
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры
	
&НаКлиенте
Процедура СформироватьДокументыОстаткиЕГАИС()
	
	Если Не Объект.ЗапрашиватьОстаткиЕгаис Тогда
		Возврат;
	КонецЕсли;	
			
	Если НЕ СформироватьДокументыОстаткиЕГАИССервис() Тогда
		Возврат;
	КонецЕсли;	
	
	Попытка 
		ОбменДаннымиЕГАИСКлиент.ПодготовитьКПередаче(ЭтотОбъект.ОстаткиСклад,ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ЗапроситеОстатки"));
	Исключение
	КонецПопытки;
	
	Попытка 
		ОбменДаннымиЕГАИСКлиент.ПодготовитьКПередаче(ЭтотОбъект.ОстаткиТорговыйЗал,ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюЕГАИС.ЗапроситеОстатки"));
	Исключение
	КонецПопытки;
	       	  	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Запрос номенклатуры по кодам

&НаСервере
Процедура ЗапросНоменклатурыЗагрузитьНаСервере()  
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");

	
	Узел = ПланыОбмена.РозницаСтандартАлко.ЭтотУзел();
	УзелЦентр = ПланыОбмена.РозницаСтандартАлко.НайтиПоКоду("ЦЕНТР");
	Если НЕ ЗначениеЗаполнено(УзелЦентр) Тогда
		Возврат;
	КонецЕсли;
	
	WSПрокси = ОбъектОбработки.ИнициализацияВебСервиса(УзелЦентр);
	Если WSПрокси = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
    ЗапросНоменклатурыЗагруженныеДанные.Очистить();
	
	НомерСтроки = 2;  
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ЗаполненыНоменклатураКод = ЗначениеЗаполнено(ТабличныйДокументЗапросНоменклатуры.Область("R" + СтроковыйНомер).Текст);
		
    Пока ЗаполненыНоменклатураКод Цикл
		
		НоваяСтрока = ЗапросНоменклатурыЗагруженныеДанные.Добавить();
         	
		Попытка
			НоваяСтрока.Код =	ТабличныйДокументЗапросНоменклатуры.Область("R" + СтроковыйНомер).Текст;
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	
		КодНоменклатуры = ВРег(СтрЗаменить(НоваяСтрока.Код, " ", "")); 
		
		//Загрузка номенклатуры
		
		СоответствуетШаблону = (СтрДлина(КодНоменклатуры) = 5) ИЛИ (СтрДлина(КодНоменклатуры) = 6);
		ДопустимыеСимволы = "0123456789Т";//код номенклатуры сторонних поставщиков начинается с Т
		Для Индекс = 1 По СтрДлина(КодНоменклатуры) Цикл
			Если Найти(ДопустимыеСимволы, Сред(КодНоменклатуры, Индекс, 1)) = 0 Тогда
				СоответствуетШаблону = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СоответствуетШаблону Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код номенклатуры не соответствует шаблону - должен состоять из 5 цифр или буквы ""Т"" и 4 цифр");
		Иначе	  
			
			РезультатОбмена = WSПрокси.ПолучитьНоменклатуру(Узел.Код, КодНоменклатуры);
			Попытка
				ДанныеНоменклатуры = РезультатОбмена.Получить();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка загрузки номенклатуры: " + ОписаниеОшибки());
			КонецПопытки;
			
			Если ТипЗнч(ДанныеНоменклатуры) = Тип("Структура") Тогда
				ОбъектОбработки.ЗагрузитьНоменклатуру(ДанныеНоменклатуры);
		        НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);
			КонецЕсли;
	        			
		КонецЕсли;
        	
		
		НомерСтроки = НомерСтроки + 1;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		Попытка
			ЗаполненыНоменклатураКод =
				ЗначениеЗаполнено(ТабличныйДокументЗапросНоменклатуры.Область("R" + СтроковыйНомер).Текст);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
         		
	КонецЦикла;	
	
КонецПроцедуры

