
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Тип Из Параметры.ТипыДокументов Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(Тип);
		Если НЕ ЗначениеЗаполнено(ТипДокумента) Тогда
			ТипДокумента = Тип;
		КонецЕсли;
	КонецЦикла;
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ТипДокумента", ТипДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	ТипДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипДокументаПриИзмененииНаСервере()
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ТипДокумента", ТипДокумента);
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Команды["Выбрать"]);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	
	Оповестить("ВыбранДокументВыгрузки", ТекущиеДанные.Ссылка);
КонецПроцедуры
