
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", "Синхронизация данных");
	ПараметрыРегистрации.Вставить("Версия", "0.12.4.4");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "Обмен данными с общей базы розницы");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Подготовить документы", "ПодготовитьДокументы", "ОткрытиеФормы", Истина);
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат ПараметрыРегистрации;
КонецФункции

Функция ЕГАИСВключен() Экспорт
	
	Возврат Константы.ВестиСведенияДляДекларацийПоАлкогольнойПродукции.Получить();
	
КонецФункции

Процедура ВыполнитьОбмен() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
		
	ПроверитьСоздатьВыемкуНаОснованииПоследнегоОРП();
	       	
	СоздатьКассовыеДокументы(); 
			
	ОбновитьКонстантуДатаПоследнегоОбмена();
	
	Узел = ПланыОбмена.РозницаСтандартАлко.ЭтотУзел();
	УзелЦентр = ПланыОбмена.РозницаСтандартАлко.НайтиПоКоду("ЦЕНТР");
	Если НЕ ЗначениеЗаполнено(УзелЦентр) Тогда
		Возврат;
	КонецЕсли;
	
	WSПрокси = ИнициализацияВебСервиса(УзелЦентр);
	Если WSПрокси = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("Регистрация", ВыгрузитьРегистрациюДанных(УзелЦентр));
	ПолучитьДанные(УзелЦентр, Данные);
	
	РезультатОбмена = WSПрокси.ВыполнитьОбмен(Узел.Код, Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
	Попытка
		ПолученныеДанные = РезультатОбмена.Получить();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка загрузки номенклатуры: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(ПолученныеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;    
	
		
	ЗагрузитьРегистрациюДанных(ПолученныеДанные.Регистрация);
	ЗагрузитьДанныеДокументов(УзелЦентр, ПолученныеДанные.ДанныеДокументов);
	ЗагрузитьНоменклатуру(ПолученныеДанные);
	
	Если ПолученныеДанные.Свойство("ТребуетсяПроводитьСверкуДанныхСЕгаис") Тогда
		УстановитьМаркерТребуетсяПроводитьСверкуДанныхСЕгаис(ПолученныеДанные.ТребуетсяПроводитьСверкуДанныхСЕгаис);
	КонецЕсли;
	
	Если ПолученныеДанные.Свойство("КонтролироватьОстатокПриПроведении") Тогда
		УстановитьМаркерКонтролироватьОстатокПриПроведении(ПолученныеДанные.КонтролироватьОстатокПриПроведении);
	КонецЕсли;

		
	Если ПолученныеДанные.Свойство("ЗапрашиватьОстаткиЕгаис") Тогда
	     ЗапрашиватьОстаткиЕгаис = ПолученныеДанные.ЗапрашиватьОстаткиЕгаис;
	КонецЕсли;
		
	Если ПолученныеДанные.Свойство("РегМинимальныеЦены") Тогда
		ЗагрузитьРегистрМинимальныеЦены(ПолученныеДанные.РегМинимальныеЦены);
	КонецЕсли;
	
	Если ПолученныеДанные.Свойство("ДниЗапретаПродажАлкоголя") Тогда
		ЗагрузитьРегистрТрадДниЗапретаПродажиАлкоголя(ПолученныеДанные.ДниЗапретаПродажАлкоголя);
	КонецЕсли;	
	
	Если ПолученныеДанные.Свойство("ПропускатьОшибкиЕГАИСПриПечатиЧека") Тогда
		ЗагрузитьРегистрТрадПропускатьОшибкиЕГАИСПриПечатиЧека(ПолученныеДанные.ПропускатьОшибкиЕГАИСПриПечатиЧека);
	КонецЕсли;	
		
	Если ПолученныеДанные.Свойство("Поставщики") Тогда
		ЗагрузитьПоставщиков(ПолученныеДанные.Поставщики);
	КонецЕсли;
	
	Если ПолученныеДанные.Свойство("ДанныеПоставок") Тогда
		ЗагрузитьПоставки(ПолученныеДанные.ДанныеПоставок);
	КонецЕсли;
		
	Если ПолученныеДанные.Свойство("ЦеныНоменклатуры") Тогда
		ЗагрузитьЦены(ПолученныеДанные.ЦеныНоменклатуры);
	КонецЕсли;
	
	Если ПолученныеДанные.Свойство("ФайлыВнешнихОбработок") Тогда
		ЗаполнитьТаблицуФайлыВнешнихОбработок(ПолученныеДанные.ФайлыВнешнихОбработок);
	КонецЕсли;
	
	Если ПолученныеДанные.Свойство("ФайлРасширения") Тогда
		ЗагрузитьРасширение(ПолученныеДанные.ФайлРасширения);
	КонецЕсли;  
	
	Если ПолученныеДанные.Свойство("ПарольАдминистратораТТ") Тогда
		УстановитьПарольАдминистратораТТ(ПолученныеДанные.ПарольАдминистратораТТ);
	КонецЕсли;   
	
	//Кассир
	Если ПолученныеДанные.Свойство("ФизЛицоКассира") Тогда
		УстановитьФизЛицоКассира(ПолученныеДанные.ФизЛицоКассира);
	КонецЕсли; 
	
	УстановитьКонстантыТрадВремяПродаж(ПолученныеДанные); 
		
	    			
	КоличествоДнейРазрешения = 2;
	
	Если ПолученныеДанные.Свойство("КоличествоДнейРазрешения") Тогда
		КоличествоДнейРазрешения =  ПолученныеДанные.КоличествоДнейРазрешения;
	КонецЕсли;
		
	УстановитьДатуЗапретаРедактирования(КоличествоДнейРазрешения);
	ОбновитьКонстантуДатаПоследнегоУдачногоОбмена();
	ПроверитьНастройкиЕГАИС();
	
	НесоответсвиеНоменклатурыАкцизныхМарокИсправитьНоменклатуруВМарке();
	
	ПроставитьПризнакПредметаРасчетаВВидахНоменклатуры();
		
	ПроверитьЗаполнениеЦенниковВВидеНоменклатуры(); 
	
	//ПроверитьЗаполнениеПризнакПредметаРасчетаВВидеНоменклатурыТабачнаяПродукция();  
	//ПроверитьЗаполнениеПризнакПредметаРасчетаВВидеНоменклатурыПиво();
	ПроверитьЗаполнениеОсобенностиУчётаПиво();
	
	ЗаполнитьОписаниеGTINИСПиво(); 
	
	ЗаполнитьСтавку22();  
	
	УстановитьНастройкиРабочегоМестаКассира();
	
КонецПроцедуры 

Процедура ЗапроситьНоменклатуруПоКоду(КодНоменклатуры) Экспорт
	Узел = ПланыОбмена.РозницаСтандартАлко.ЭтотУзел();
	УзелЦентр = ПланыОбмена.РозницаСтандартАлко.НайтиПоКоду("ЦЕНТР");
	Если НЕ ЗначениеЗаполнено(УзелЦентр) Тогда
		Возврат;
	КонецЕсли;
	
	WSПрокси = ИнициализацияВебСервиса(УзелЦентр);
	Если WSПрокси = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОбмена = WSПрокси.ПолучитьНоменклатуру(Узел.Код, КодНоменклатуры);
	Попытка
		ДанныеНоменклатуры = РезультатОбмена.Получить();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка загрузки номенклатуры: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(ДанныеНоменклатуры) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНоменклатуру(ДанныеНоменклатуры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВернутьНоменклатуруПоКодуЕгаис(ПКодЕГАИС)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	НЕ Номенклатура.ПометкаУдаления
	                      |	И Номенклатура.КодЕГАИС = &КодЕГАИС");
	
	Запрос.Параметры.Вставить("КодЕГАИС",СокрЛП(ПКодЕГАИС));

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции	

Функция ИнициализацияВебСервиса(Узел) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
     
	Попытка                                       
		//Рабочий контур
		WSОпределения = Новый WSОпределения("https://web.garm.ru/tradition/ws/retail.1cws" + "?wsdl","robot","pwd123321"); 
		
		//Тестовый контур	
		//WSОпределения = Новый WSОпределения("https://web.garm.ru/TRD/tradition_andrey/ws/retail.1cws" + "?wsdl","robot","pwd123321");   
				
		
		WSСервис = WSОпределения.Сервисы[0];
		Для Каждого ТочкаПодключения Из WSСервис.ТочкиПодключения Цикл
			Попытка
				WSПрокси = Новый WSПрокси(WSОпределения, WSСервис.URIПространстваИмен, WSСервис.Имя, ТочкаПодключения.Имя);
				WSПрокси.Пользователь="robot";
				WSПрокси.Пароль="pwd123321";
				Прервать;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проблема подключения к веб-сервису: " + ОписаниеОшибки());
				Возврат Неопределено;
			КонецПопытки;
		КонецЦикла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проблема подключения к веб-сервису: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
		
	Возврат WSПрокси;
  	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Функция ВыгрузитьРегистрациюДанных(УзелОбмена)
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.Отступ = Ложь;
	ЗаписьХМЛ.УстановитьСтроку();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьХМЛ, УзелОбмена);
	
	ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения);
	
	ЗаписьСообщения.ЗакончитьЗапись();
	ЗаписьХМЛСтрока = ЗаписьХМЛ.Закрыть();
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ЗаписьХМЛСтрока;
КонецФункции

Функция ЗагрузитьРегистрациюДанных(РегистрацияДанных)
	УстановитьПривилегированныйРежим(Истина);
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(РегистрацияДанных);
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	
	Успех = Истина;
	Попытка
		ЧтениеСообщения.НачатьЧтение(ЧтениеХМЛ);
	Исключение
		Успех = Ложь;
	КонецПопытки; 
	
	Если Успех Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
		
		Попытка
			ЧтениеСообщения.ЗакончитьЧтение();	
		Исключение
			Успех = Ложь;
		КонецПопытки; 
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Успех;
КонецФункции

Функция ПолучитьТаблицуТоваровТТН(ТТН_ЕГАИС)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТНВходящаяЕГАИСТовары.НомерСправки2Поставщика КАК СправкаБ,
	               |	ТТНВходящаяЕГАИСТовары.Справка2.НомерСправки1 КАК СправкаА,
	               |	ТТНВходящаяЕГАИСТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	               |	ТТНВходящаяЕГАИСТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	               |ИЗ
	               |	Документ.ТТНВходящаяЕГАИС.Товары КАК ТТНВходящаяЕГАИСТовары
	               |ГДЕ
	               |	ТТНВходящаяЕГАИСТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТТН_ЕГАИС);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДатуИзСтроки(Стр) 
	 
	 Д = Дата("00010101000000");
	 
	 Если ПустаяСтрока(Стр) Тогда
		 Возврат Д;
	 КонецЕсли;
	 
	 М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"-");
	  	 
	 Попытка
		 Д = Дата(М[0],М[1],М[2]);
	 Исключение
	 КонецПопытки; 
	 
	 Возврат Д; 

 КонецФункции
 
Функция ПолучитьСуммуВыемкиОтчета(пОтчетОРозничныхПродажах)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		&СуммаДокумента КАК Сумма
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		-ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма
	|	ИЗ
	|		Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ОтчетОРозничныхПродажахОплатаПлатежнымиКартами
	|	ГДЕ
	|		ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		-ОтчетОРозничныхПродажахОплатаБанковскимиКредитами.Сумма
	|	ИЗ
	|		Документ.ОтчетОРозничныхПродажах.ОплатаБанковскимиКредитами КАК ОтчетОРозничныхПродажахОплатаБанковскимиКредитами
	|	ГДЕ
	|		ОтчетОРозничныхПродажахОплатаБанковскимиКредитами.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		-&ОплатаПодарочнымиСертификатами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		-ОплатаНаличнымиАгентскихПлатежей.Сумма
	|	ИЗ
	|		Документ.ОтчетОРозничныхПродажах.ОплатаНаличнымиАгентскихПлатежей КАК ОплатаНаличнымиАгентскихПлатежей
	|	ГДЕ
	|		ОплатаНаличнымиАгентскихПлатежей.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		-ОтчетОРозничныхПродажахПрочаяВыручка.СуммаПоступления
	|	ИЗ
	|		Документ.ОтчетОРозничныхПродажах.ПрочаяВыручка КАК ОтчетОРозничныхПродажахПрочаяВыручка
	|	ГДЕ
	|		ОтчетОРозничныхПродажахПрочаяВыручка.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтчетОРозничныхПродажахПрочаяВыручка.СуммаВозврата
	|	ИЗ
	|		Документ.ОтчетОРозничныхПродажах.ПрочаяВыручка КАК ОтчетОРозничныхПродажахПрочаяВыручка
	|	ГДЕ
	|		ОтчетОРозничныхПродажахПрочаяВыручка.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ОплатаНаличнымиАгентскихПлатежей.Сумма)
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ОплатаНаличнымиАгентскихПлатежей КАК ОплатаНаличнымиАгентскихПлатежей
	|ГДЕ
	|	ОплатаНаличнымиАгентскихПлатежей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", пОтчетОРозничныхПродажах);
	Запрос.УстановитьПараметр("СуммаДокумента", пОтчетОРозничныхПродажах.СуммаДокумента);
	Запрос.УстановитьПараметр("ОплатаПодарочнымиСертификатами", пОтчетОРозничныхПродажах.ОплатаПодарочнымиСертификатами);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаВыемки = 0;
	Если Выборка.Следующий() Тогда
		СуммаВыемки = Выборка.Сумма;
	КонецЕсли;
	
	Возврат СуммаВыемки;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры
 
Процедура ПерезаполнитьТоварыПоДаннымПоставщикаПоФакту(ДокументПоступления)
	
	ДокументПоступления.ТоварыПоДаннымПоставщика.Очистить();
	КолонкиГруппы = "Номенклатура, Характеристика, Упаковка, Цена, СтавкаНДС, ХарактеристикиИспользуются,
					 |АлкогольнаяПродукция, ИдентификаторУпаковки, ИдентификаторСтроки";
	КолонкиПоказатели = "КоличествоУпаковок, Количество, Сумма, СуммаНДС";
	
	Товары = ДокументПоступления.Товары.Выгрузить(  , КолонкиГруппы + ", " + КолонкиПоказатели);
	Товары.Свернуть(КолонкиГруппы, КолонкиПоказатели);
	
	Для каждого ТекСтрока Из Товары Цикл
		НоваяСтрока = ДокументПоступления.ТоварыПоДаннымПоставщика.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	ОбработкаТабличнойЧастиТоварыКлиентСервер.ЗаполнитьСуммуВсегоВТаблице(ДокументПоступления.ТоварыПоДаннымПоставщика, ДокументПоступления.ЦенаВключаетНДС);
КонецПроцедуры

#КонецОбласти

#Область Обновление_и_проверка_данных_при_завершении_обмена

Процедура ОбновитьКонстантуДатаПоследнегоОбмена()
	
	УстановитьПривилегированныйРежим(Истина);

	Константы.ТрадДатаПоследнегоОбмена.Установить(ТекущаяДата());
	
	УстановитьПривилегированныйРежим(Ложь);
	  	
КонецПроцедуры	

Процедура ОбновитьКонстантуДатаПоследнегоУдачногоОбмена()
	
	УстановитьПривилегированныйРежим(Истина);

	Константы.ТрадДатаПоследнегоУдачногоОбмена.Установить(ТекущаяДата());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

Процедура УстановитьДатуЗапретаРедактирования(пКоличествоДнейРазрешения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.ИспользоватьДатыЗапретаИзменения.Установить(Истина);
	Набор = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
		
	Константы.ИспользоватьДатыЗапретаИзменения.Установить(Истина);
				
	Запись = РегистрыСведений.ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
	Запись.Объект = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
	Запись.Раздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
	Запись.ДатаЗапрета = Дата('00020202');
	//Запись.ОписаниеДатыЗапрета = "КонецПрошлогоМесяца" + Символы.ПС + "2";
	Запись.ОписаниеДатыЗапрета = "КонецПрошлогоМесяца" + Символы.ПС + Строка(пКоличествоДнейРазрешения);
	Запись.Записать();
	
КонецПроцедуры

Процедура ПроверитьСоздатьВыемкуНаОснованииПоследнегоОРП()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	                      |ГДЕ
	                      |	ОтчетОРозничныхПродажах.Проведен
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ОтчетОРозничныхПродажах.Дата УБЫВ");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
	    Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	лОтчетОРозничныхПродажах = Выборка.Ссылка;
	
	ВыемкиДС = Документы.ВыемкаДенежныхСредствИзКассыККМ.ПолучитьВыемкиДСОтчетаОРозничныхПродажах(лОтчетОРозничныхПродажах);
	
	Если НЕ ВыемкиДС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СуммаВыемки = ПолучитьСуммуВыемкиОтчета(лОтчетОРозничныхПродажах);
    Если СуммаВыемки = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	ДополнительныеПараметры = Новый Структура;
	
	Попытка                                                                                                                 
		
		Отказ = Истина;
		
		ДокументВыемкаДенежныхСредствСсылка = ДенежныеСредстваВызовСервера.СоздатьДокументВыемкаДенежныхСредствИзКассыККМ(Отказ,
				СуммаВыемки,
				лОтчетОРозничныхПродажах.КассаККМ,
				лОтчетОРозничныхПродажах.Ссылка,
				ДополнительныеПараметры
		        );
	
	Исключение			
	КонецПопытки;			
				
КонецПроцедуры	

Процедура ПроверитьНастройкиЕГАИС()
	 	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", "ОбработкаОтветовЕГАИС");
	РегЗадание = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];

	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Истина);
	РегламентныеЗаданияСервер.ИзменитьЗадание(РегЗадание.УникальныйИдентификатор, ПараметрыЗадания);
	
	Исключение
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

Процедура НесоответсвиеНоменклатурыАкцизныхМарокИсправитьНоменклатуруВМарке()
	
	УстановитьПривилегированныйРежим(Истина);
		
	ПараметрыТаблицаТоваров = Новый Структура("Справка2");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТТНМарка.ТТН КАК ТТН,
	                      |	ТТНМарка.АкцизнаяМарка КАК АкцизнаяМарка,
	                      |	ПоступлениеТоваровТовары.Номенклатура КАК НоменклатураПриход,
	                      |	ТТНМарка.АкцизнаяМаркаНоменклатура КАК АкцизнаяМаркаНоменклатура,
	                      |	ТТНМарка.Справка2 КАК Справка2,
	                      |	ПоступлениеТоваровТовары.Ссылка КАК ПоступлениеТоваров
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ТТНВходящаяЕГАИСТовары.Ссылка КАК ТТН,
	                      |		ТТНВходящаяЕГАИСТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	                      |		ТТНВходящаяЕГАИСАкцизныеМарки.АкцизнаяМарка КАК АкцизнаяМарка,
	                      |		ТТНВходящаяЕГАИСАкцизныеМарки.АкцизнаяМарка.Номенклатура КАК АкцизнаяМаркаНоменклатура,
	                      |		ТТНВходящаяЕГАИСАкцизныеМарки.Справка2 КАК Справка2
	                      |	ИЗ
	                      |		Документ.ТТНВходящаяЕГАИС.Товары КАК ТТНВходящаяЕГАИСТовары
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТТНВходящаяЕГАИС.АкцизныеМарки КАК ТТНВходящаяЕГАИСАкцизныеМарки
	                      |			ПО ТТНВходящаяЕГАИСТовары.Ссылка = ТТНВходящаяЕГАИСАкцизныеМарки.Ссылка
	                      |				И ТТНВходящаяЕГАИСТовары.Справка2 = ТТНВходящаяЕГАИСАкцизныеМарки.Справка2
	                      |	ГДЕ
	                      |		НЕ ЕСТЬNULL(ТТНВходящаяЕГАИСАкцизныеМарки.АкцизнаяМарка, 0) = 0
	                      |		И НЕ ТТНВходящаяЕГАИСТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК ТТНМарка
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	                      |		ПО ТТНМарка.ТТН = ПоступлениеТоваровТовары.Ссылка.ТТНВходящаяЕГАИС
	                      |			И ТТНМарка.АлкогольнаяПродукция = ПоступлениеТоваровТовары.АлкогольнаяПродукция
	                      |			И ТТНМарка.АкцизнаяМаркаНоменклатура <> ПоступлениеТоваровТовары.Номенклатура");
			
	Запрос.Параметры.Вставить("Дата",НачалоДня(ТекущаяДата() -60*60*24*15));	
			
	Результат	=	Запрос.Выполнить();	
	Выборка 	= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
				
		АкцизнаяМаркаОбъект =  Выборка.АкцизнаяМарка.ПолучитьОбъект();
		
		АкцизнаяМаркаОбъект.Номенклатура = Выборка.НоменклатураПриход; 
		АкцизнаяМаркаОбъект.Записать();
		
		///////
	
		обТТНВходящая = Выборка.ТТН.ПолучитьОбъект();
		
		ПараметрыТаблицаТоваров.Вставить("Справка2", Выборка.Справка2);
					
		МассивСтрок = обТТНВходящая.Товары.НайтиСтроки(ПараметрыТаблицаТоваров);
			
		Если НЕ МассивСтрок.Количество() = 0 Тогда
			МассивСтрок[0].Номенклатура = Выборка.НоменклатураПриход;
		КонецЕсли;	 
		Попытка	
			обТТНВходящая.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	
		   		
	КонецЦикла;	
	  	
КонецПроцедуры	

Процедура ПроставитьПризнакПредметаРасчетаВВидахНоменклатуры()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка,
	|	ВидыНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ВидыНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.ПризнакПредметаРасчета = ЗНАЧЕНИЕ(Справочник.ПризнакиПредметовРасчета.ПустаяСсылка)");
	
	Результат	=	Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		лОбъект	=Выборка.Ссылка.ПолучитьОбъект();	
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
				
			Если Выборка.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция
				ИЛИ Выборка.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция 
				ИЛИ Выборка.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Пиво 
				ИЛИ Выборка.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АльтернативныйТабак 
				ИЛИ Выборка.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезалкогольноеПиво 
				ИЛИ Выборка.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.СоковаяПродукция Тогда
				лОбъект.ПризнакПредметаРасчета = Справочники.ПризнакиПредметовРасчета.ПодакцизныйТовар;
			Иначе
				лОбъект.ПризнакПредметаРасчета = Справочники.ПризнакиПредметовРасчета.Товар;
			КонецЕсли;
		Иначе
			лОбъект.ПризнакПредметаРасчета = Справочники.ПризнакиПредметовРасчета.Товар;
		КонецЕсли;
		
		Попытка
			лОбъект.Записать();
		Исключение
		КонецПопытки;	
		
	КонецЦикла;	
	    	
КонецПроцедуры	

Процедура ПроверитьЗаполнениеЦенниковВВидеНоменклатуры()

	УстановитьПривилегированныйРежим(Истина);
	Попытка     
		
		ШаблонЦенника = Справочники.ХранилищеШаблонов.НайтиПоНаименованию("Ценник");
		
		Если НЕ ЗначениеЗаполнено(ШаблонЦенника) Тогда
			Возврат;
		КонецЕсли;	
		
		ТабачнаяПродукция =Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Табачная продукция");
		
		Запрос = Новый Запрос;
		Запрос.Параметры.Вставить("ТабачнаяПродукция",ТабачнаяПродукция);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыНоменклатуры.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		               |ГДЕ
		               |	ВидыНоменклатуры.ШаблонЦенника = ЗНАЧЕНИЕ(Справочник.ХранилищеШаблонов.ПустаяСсылка)
		               |	И НЕ ВидыНоменклатуры.Ссылка = &ТабачнаяПродукция";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Об = Выборка.Ссылка.ПолучитьОбъект();
			Об.ШаблонЦенника = ШаблонЦенника;
			Об.Записать();
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(ТабачнаяПродукция) Тогда
			Если ЗначениеЗаполнено(ТабачнаяПродукция.ШаблонЦенника) Тогда
				ОБ = ТабачнаяПродукция.ПолучитьОбъект();
				Об.ШаблонЦенника = Неопределено;
				Об.Записать();
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПризнакПредметаРасчетаВВидеНоменклатурыТабачнаяПродукция()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ТабачнаяПродукция = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Табачная продукция");  
		
		ПодакцизныйТоварМаркируемыйСИИмеющийКМ = Справочники.ПризнакиПредметовРасчета.ПодакцизныйТоварМаркируемыйСИИмеющийКМ;
		
		Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТабачнаяПродукция,"ПризнакПредметаРасчета") =  ПодакцизныйТоварМаркируемыйСИИмеющийКМ Тогда
			
			ТПОбъект =  ТабачнаяПродукция.ПолучитьОбъект(); 
			ТПОбъект.ПризнакПредметаРасчета = ПодакцизныйТоварМаркируемыйСИИмеющийКМ;
			ТПОбъект.Записать();
			
		КонецЕсли;	
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры  

Процедура ПроверитьЗаполнениеПризнакПредметаРасчетаВВидеНоменклатурыПиво()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка    
		
		ПодакцизныйТоварМаркируемыйСИИмеющийКМ 	= Справочники.ПризнакиПредметовРасчета.ТоварМаркируемыйСИИмеющийКМ;
		ПивоВПотребительскихУпаковках 			= Перечисления.ОсобенностиУчетаНоменклатуры.ПивоВПотребительскихУпаковках;
				
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВидыНоменклатуры.Ссылка КАК Ссылка,
		                      |	ВидыНоменклатуры.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
		                      |	ВидыНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчета
		                      |ИЗ
		                      |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		                      |ГДЕ
		                      |	ВидыНоменклатуры.Наименование = &Наименование");
		
		Запрос.Параметры.Вставить("Наименование","Пиво");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл  
						
			Если НЕ Выборка.ПризнакПредметаРасчета =  ПодакцизныйТоварМаркируемыйСИИмеющийКМ 
				ИЛИ НЕ Выборка.ОсобенностьУчета =  ПивоВПотребительскихУпаковках	 Тогда
				
				ТПОбъект =  Выборка.Ссылка.ПолучитьОбъект(); 
				ТПОбъект.ПризнакПредметаРасчета = ПодакцизныйТоварМаркируемыйСИИмеющийКМ; 
				ТПОбъект.ОсобенностьУчета 		= ПивоВПотребительскихУпаковках;
				ТПОбъект.Записать();
				
			КонецЕсли;
			
		КонецЦикла;	
			
	Исключение
	КонецПопытки;
	
КонецПроцедуры 

Процедура ПроверитьЗаполнениеОсобенностиУчётаПиво()

УстановитьПривилегированныйРежим(Истина);
	
	Попытка    
		
		ВидНоменклатурыПиво					 	= Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Пиво");
		ПивоВПотребительскихУпаковках 			= Перечисления.ОсобенностиУчетаНоменклатуры.ПивоВПотребительскихУпаковках; 
		ТипНоменклатурыТовар					= Перечисления.ТипыНоменклатуры.Товар;		
				
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Номенклатура.Ссылка КАК Ссылка,
		                      |	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		                      |	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		                      |	Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета
		                      |ИЗ
		                      |	Справочник.Номенклатура КАК Номенклатура
		                      |ГДЕ
		                      |	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
		                      |	И Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
		                      |	И Номенклатура.ОсобенностьУчета <> &ОсобенностьУчета");
		
		Запрос.Параметры.Вставить("ВидНоменклатуры",ВидНоменклатурыПиво);
		Запрос.Параметры.Вставить("ТипНоменклатуры",ТипНоменклатурыТовар);
        Запрос.Параметры.Вставить("ОсобенностьУчета",ПивоВПотребительскихУпаковках);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл  
							
			ТПОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
			ТПОбъект.ОсобенностьУчета = ПивоВПотребительскихУпаковках;
			ТПОбъект.Записать();
							
		КонецЦикла;	
			
	Исключение
	КонецПопытки;	
	
КонецПроцедуры	

Процедура ЗаполнитьОписаниеGTINИСПиво() 
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Попытка
				
		ВидНоменклатуры = справочники.ВидыНоменклатуры.НайтиПоНаименованию("Пиво");
		
		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			Возврат;
		КонецЕсли;	
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Штрихкоды.Штрихкод КАК Штрихкод
		                      |ИЗ
		                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
		                      |ГДЕ
		                      |	Штрихкоды.Владелец.ВидНоменклатуры = &ВидНоменклатуры
		                      |	И Штрихкоды.Упаковка = &Упаковка");
		
		Запрос.Параметры.Вставить("ВидНоменклатуры",ВидНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			УстановитьПривилегированныйРежим(Истина);
			
			Набор = РегистрыСведений.ОписаниеGTINИС.СоздатьМенеджерЗаписи();
			Набор.GTIN 								= "0"+Выборка.Штрихкод;
			Набор.ВидУпаковки 						= Перечисления.ВидыУпаковокИС.Потребительская;
			Набор.КоличествоПотребительскихУпаковок 	= 1;  
			Набор.Записать();
			
		КонецЦикла;	 
		
	Исключение
	КонецПопытки;
		
КонецПроцедуры   

Процедура ЗаполнитьСтавку22()  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	НЕ Номенклатура.ЭтоГруппа
	                      |	И Номенклатура.СтавкаНДС <> &СтавкаНДС");
	
	Запрос.Параметры.Вставить("СтавкаНДС",Перечисления.СтавкиНДС.НДС22);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
    Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоменклатураОбъект =  Выборка.Ссылка.ПолучитьОбъект();
		НоменклатураОбъект.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
		НоменклатураОбъект.Записать();
		
	КонецЦикла;	
		
КонецПроцедуры	

Процедура УстановитьНастройкиРабочегоМестаКассира()  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиРабочегоМестаКассира.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	                      |ГДЕ
	                      |	НЕ НастройкиРабочегоМестаКассира.ПометкаУдаления
	                      |	И (НЕ НастройкиРабочегоМестаКассира.КонтролироватьЕМРЦ
	                      |			ИЛИ НЕ НастройкиРабочегоМестаКассира.ОжидатьРезультатПроверкиМарок)");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НастройкаРабочегоМестаКассира =  Выборка.Ссылка.ПолучитьОбъект();
		НастройкаРабочегоМестаКассира.КонтролироватьЕМРЦ 			= Истина;
		НастройкаРабочегоМестаКассира.ОжидатьРезультатПроверкиМарок = Истина;
		НастройкаРабочегоМестаКассира.Записать();
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#Область РаботаСДанными

Функция ПрочитатьНоменклатуру(Реквизиты, ВидыНоменклатуры)
	НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Реквизиты.Идентификатор));
	Номенклатура = НоменклатураСсылка.ПолучитьОбъект();
	
	Если Номенклатура = Неопределено Тогда
		Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
		Номенклатура.УстановитьСсылкуНового(НоменклатураСсылка);
	КонецЕсли;
	
	КлассификаторСсылка = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.НайтиПоКоду(Реквизиты.КодЕГАИС);
	Если НЕ ЗначениеЗаполнено(КлассификаторСсылка) Тогда
		Классификатор = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.СоздатьЭлемент();
		Классификатор.Код = Реквизиты.КодЕГАИС;
		
		РеквизитыКлассификатор = Новый Структура;
		РеквизитыКлассификатор.Вставить("Наименование", Реквизиты.НаименованиеЕГАИС);
		РеквизитыКлассификатор.Вставить("Объем", Реквизиты.Объем);
		РеквизитыКлассификатор.Вставить("Крепость", Реквизиты.Крепость);
		РеквизитыКлассификатор.Вставить("Производитель", Справочники.КлассификаторОрганизацийЕГАИС.НайтиПоКоду(Реквизиты.КодПроизводителяЕГАИС));
		РеквизитыКлассификатор.Вставить("Импортер", ?(ПустаяСтрока(Реквизиты.КодИмпортераЕГАИС), Справочники.КлассификаторОрганизацийЕГАИС.ПустаяСсылка(), Справочники.КлассификаторОрганизацийЕГАИС.НайтиПоКоду(Реквизиты.КодИмпортераЕГАИС)));
		РеквизитыКлассификатор.Вставить("НаименованиеПолное", Реквизиты.НаименованиеЕГАИС);
		РеквизитыКлассификатор.Вставить("ВидПродукции", Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду(Реквизиты.ВидПродукции));
		
		Для Каждого Реквизит Из РеквизитыКлассификатор Цикл
			Если Классификатор[Реквизит.Ключ] <> Реквизит.Значение Тогда
				Классификатор[Реквизит.Ключ] = Реквизит.Значение;
			КонецЕсли;
		КонецЦикла;
		
	Иначе	
		Классификатор = КлассификаторСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если Номенклатура.ЭтоНовый() Тогда
		Номенклатура.ЕдиницаИзмерения = Справочники.БазовыеЕдиницыИзмерения.НайтиПоКоду("796");
		Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	КонецЕсли;
	    	
	РеквизитыНоменклатуры = Новый Структура;
	РеквизитыНоменклатуры.Вставить("Код", Реквизиты.Код);
	РеквизитыНоменклатуры.Вставить("Наименование", Реквизиты.Наименование);
	РеквизитыНоменклатуры.Вставить("Родитель", Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Реквизиты.Родитель)));
	Если НЕ Реквизиты.ЭтоГруппа Тогда
		РеквизитыНоменклатуры.Вставить("ОбъемДАЛ", Реквизиты.Объем / 10);
		РеквизитыНоменклатуры.Вставить("Крепость", Реквизиты.Крепость);
		РеквизитыНоменклатуры.Вставить("АлкогольнаяПродукция", Реквизиты.АлкогольнаяПродукция);
		РеквизитыНоменклатуры.Вставить("СтавкаНДС",Перечисления.СтавкиНДС.НДС22);
		
		ЭтоТабачнаяПродукция 	= Ложь;
		ЭтоПиво 				= Ложь;
		ЭтоСоковаяПродукция 	= Ложь; 
		ЭтоБезалкогольноеПиво	= Ложь;
		
		Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП") Тогда
	        ЭтоТабачнаяПродукция	=  Реквизиты.ТабачнаяПродукция; 
			ЭтоПиво 				=  Реквизиты.Пиво;  
			ЭтоСоковаяПродукция 	=  Реквизиты.СоковаяПродукция; 
			ЭтоБезалкогольноеПиво	=  Реквизиты.БезалкогольноеПиво;
    	КонецЕсли;	
		
		РеквизитыНоменклатуры.Вставить("КодЕГАИС", Реквизиты.КодЕГАИС);
		Если ЗначениеЗаполнено(Реквизиты.ВидПродукции) Тогда
			РеквизитыНоменклатуры.Вставить("ВидАлкогольнойПродукцииЕГАИС", Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду(Реквизиты.ВидПродукции));
		КонецЕсли;
		РеквизитыНоменклатуры.Вставить("Вес", Реквизиты.Вес);
		РеквизитыНоменклатуры.Вставить("СтранаПроисхождения", ЗагрузитьСтрану(Реквизиты.Страна));
		
		Если РеквизитыНоменклатуры.АлкогольнаяПродукция И Не ЭтоПиво  =  Истина Тогда
			РеквизитыНоменклатуры.Вставить("ВидНоменклатуры", ?(Реквизиты.Импортная, ВидыНоменклатуры.Импортная, ВидыНоменклатуры.Российская));
			РеквизитыНоменклатуры.Вставить("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция);//09-04-19
		ИначеЕсли ЭтоТабачнаяПродукция  =  Истина Тогда	
			РеквизитыНоменклатуры.Вставить("ВидНоменклатуры", ВидыНоменклатуры.ТабачнаяПродукция);
			РеквизитыНоменклатуры.Вставить("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция);//17-10-19 
		ИначеЕсли ЭтоПиво  =  Истина Тогда	
			РеквизитыНоменклатуры.Вставить("ВидНоменклатуры", ВидыНоменклатуры.Пиво);
			РеквизитыНоменклатуры.Вставить("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.Пиво);//04-06-24  
		ИначеЕсли ЭтоСоковаяПродукция  =  Истина Тогда		
			РеквизитыНоменклатуры.Вставить("ВидНоменклатуры", ВидыНоменклатуры.СоковаяПродукция);
			РеквизитыНоменклатуры.Вставить("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.СоковаяПродукция);  
		ИначеЕсли ЭтоБезалкогольноеПиво  =  Истина Тогда		
			РеквизитыНоменклатуры.Вставить("ВидНоменклатуры", ВидыНоменклатуры.БезалкогольноеПиво);
			РеквизитыНоменклатуры.Вставить("ОсобенностьУчета",Перечисления.ОсобенностиУчетаНоменклатуры.БезалкогольноеПиво);  
		Иначе
			РеквизитыНоменклатуры.Вставить("ВидНоменклатуры", ВидыНоменклатуры.Безалкогольная);
			РеквизитыНоменклатуры.Вставить("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета);
		КонецЕсли;
							
		Если ЗначениеЗаполнено(Реквизиты.Производитель) Тогда
			РеквизитыНоменклатуры.Вставить("ПроизводительИмпортерАлкогольнойПродукции", Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Реквизиты.Производитель)));
			Если Реквизиты.АлкогольнаяПродукция И  НЕ Реквизиты.Импортная Тогда
				РеквизитыНоменклатуры.Вставить("Производитель", РеквизитыНоменклатуры.ПроизводительИмпортерАлкогольнойПродукции); 
			КонецЕсли;
		КонецЕсли;
		РеквизитыНоменклатуры.Вставить("НаименованиеПолное", Реквизиты.Наименование);
		РеквизитыНоменклатуры.Вставить("Описание", Реквизиты.НаименованиеЕГАИС);
	КонецЕсли;
	
	Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
		РеквизитЗначение 		= Реквизит.Значение;
		НоменклатураРеквизит 	= Номенклатура[Реквизит.Ключ];
		
		Если Реквизит.Ключ = "Код" Тогда
			НоменклатураРеквизит = СокрЛП(НоменклатураРеквизит);
		КонецЕсли;	
		
		Если Реквизит.Ключ = "Наименование" Тогда
			РеквизитЗначение = Лев(Реквизит.Значение,100);
		КонецЕсли;	
		 		
		Если НоменклатураРеквизит <> РеквизитЗначение Тогда
			Номенклатура[Реквизит.Ключ] = РеквизитЗначение;
		КонецЕсли;
	КонецЦикла;
	
	ИзмененнаяНоменклатура = Неопределено;
	НачатьТранзакцию();
	Попытка
		Если Номенклатура.Модифицированность() Тогда
			Номенклатура.Записать();
			НоменклатураСсылка = Номенклатура.Ссылка;
			ИзмененнаяНоменклатура = НоменклатураСсылка;
		КонецЕсли;
		
		Если Классификатор.Модифицированность() Тогда
			Классификатор.Записать();
			КлассификаторСсылка = Классификатор.Ссылка;
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("АлкогольнаяПродукция", КлассификаторСсылка);
		Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Порядок) КАК Порядок,
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|ГДЕ
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура = &Номенклатура
		|	И СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = &АлкогольнаяПродукция
		|
		|СГРУППИРОВАТЬ ПО
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура";
	
        Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
						
			Порядок = 0;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("АлкогольнаяПродукция", КлассификаторСсылка);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Порядок) КАК Порядок
			|ИЗ
			|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
			|ГДЕ
			|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = &АлкогольнаяПродукция";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если ТипЗнч(Выборка.Порядок) = Тип("Число") Тогда
					Порядок = Выборка.Порядок;
				КонецЕсли;
			КонецЕсли;
			
			Запись = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьМенеджерЗаписи();
			Запись.Номенклатура         = НоменклатураСсылка;
			Запись.АлкогольнаяПродукция = КлассификаторСсылка;
			Запись.Порядок              = Порядок + 1;
			Запись.Записать();
			
		КонецЕсли;
		
		//EAN13
		ВсеШтрихкоды = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		ВсеШтрихкоды.Отбор.Владелец.Установить(НоменклатураСсылка);
		ВсеШтрихкоды.Отбор.ТипШтрихкода.Установить(ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13);
		ВсеШтрихкоды.Прочитать();
		ВсеШтрихкоды.Очистить();
		Для Индекс = 1 По СтрЧислоСтрок(Реквизиты.Штрихкод) Цикл
			Штрихкод = СокрЛП(СтрПолучитьСтроку(Реквизиты.Штрихкод, Индекс));
			Если СтрДлина(Штрихкод) <> 13 Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйШтрихкод = ВсеШтрихкоды.Добавить();
			НовыйШтрихкод.Владелец = НоменклатураСсылка;
			НовыйШтрихкод.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
			НовыйШтрихкод.Штрихкод = Штрихкод;
		КонецЦикла;
		Если ВсеШтрихкоды.Количество() = 0 Тогда
			НовыйШтрихкод = ВсеШтрихкоды.Добавить();
			НовыйШтрихкод.Владелец = НоменклатураСсылка;
			НовыйШтрихкод.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
			НовыйШтрихкод.Штрихкод = "0000000000000";
		КонецЕсли;
		ВсеШтрихкоды.Записать();
		
		//EAN8
		ВсеШтрихкоды = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		ВсеШтрихкоды.Отбор.Владелец.Установить(НоменклатураСсылка);
		ВсеШтрихкоды.Отбор.ТипШтрихкода.Установить(ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8);
		ВсеШтрихкоды.Прочитать();
		ВсеШтрихкоды.Очистить();
		Для Индекс = 1 По СтрЧислоСтрок(Реквизиты.Штрихкод) Цикл
			Штрихкод = СокрЛП(СтрПолучитьСтроку(Реквизиты.Штрихкод, Индекс));
			Если СтрДлина(Штрихкод) <> 8  Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйШтрихкод = ВсеШтрихкоды.Добавить();
			НовыйШтрихкод.Владелец = НоменклатураСсылка;
			НовыйШтрихкод.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8;
			НовыйШтрихкод.Штрихкод = Штрихкод;
		КонецЦикла;
		ВсеШтрихкоды.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка загрузки номенклатуры: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ИзмененнаяНоменклатура;
КонецФункции

Функция ПолучитьВидыНоменклатуры()
	
	ОбрабатыватьМаркируемуюПродукцию = ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");   

	Если ОбрабатыватьМаркируемуюПродукцию Тогда 
		
		Виды = Новый Структура("Безалкогольная, Импортная, Российская, ТабачнаяПродукция, Пиво,СоковаяПродукция,БезалкогольноеПиво");   
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыНоменклатуры.Ссылка КАК Ссылка,
		               |	ВидыНоменклатуры.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		               |	ВидыНоменклатуры.ИмпортнаяАлкогольнаяПродукция КАК Импортная,
		               |	ВЫБОР
		               |		КОГДА ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ТабачнаяПродукция,
		               |	ВЫБОР
		               |		КОГДА ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезалкогольноеПиво)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК БезалкогольноеПиво,
		               |	ВЫБОР
		               |		КОГДА ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.СоковаяПродукция)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК СоковаяПродукция,
		               |	ВЫБОР
		               |		КОГДА ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Пиво)
		               |				ИЛИ ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПивоВПотребительскихУпаковках)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Пиво
		               |ИЗ
		               |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		               |ГДЕ
		               |	ВидыНоменклатуры.ВидАлкогольнойПродукцииЕГАИС = ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
		               |	И НЕ ВидыНоменклатуры.ПометкаУдаления
		               |	И ВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		               |	И ВидыНоменклатуры.Наименование В (""Товар"", ""Соковая продукция"", ""Безалкогольное пиво"", ""Пиво"", ""Алкоголь (Россия)"", ""Алкоголь (Импорт)"", ""Табачная продукция"")
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВидыНоменклатуры.Ссылка,
		               |	ВидыНоменклатуры.ИмпортнаяАлкогольнаяПродукция,
		               |	ВидыНоменклатуры.АлкогольнаяПродукция,
		               |	ВЫБОР
		               |		КОГДА ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Пиво)
		               |				ИЛИ ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПивоВПотребительскихУпаковках)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезалкогольноеПиво)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ВидыНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.СоковаяПродукция)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.АлкогольнаяПродукция И НЕ Выборка.ТабачнаяПродукция И  НЕ Выборка.СоковаяПродукция И НЕ Выборка.БезалкогольноеПиво Тогда
				Виды.Безалкогольная = Выборка.Ссылка;
			ИначеЕсли Выборка.АлкогольнаяПродукция И Выборка.Импортная И НЕ Выборка.Пиво  Тогда
				Виды.Импортная = Выборка.Ссылка;
			ИначеЕсли Выборка.АлкогольнаяПродукция И НЕ Выборка.Импортная И НЕ Выборка.Пиво Тогда
				Виды.Российская = Выборка.Ссылка;
			ИначеЕсли НЕ Выборка.АлкогольнаяПродукция И Выборка.ТабачнаяПродукция Тогда
				Виды.ТабачнаяПродукция = Выборка.Ссылка; 
			ИначеЕсли Выборка.АлкогольнаяПродукция И Выборка.Пиво Тогда
				Виды.Пиво = Выборка.Ссылка; 
			ИначеЕсли Выборка.СоковаяПродукция Тогда
				Виды.СоковаяПродукция = Выборка.Ссылка; 
			ИначеЕсли Выборка.БезалкогольноеПиво Тогда
				Виды.БезалкогольноеПиво = Выборка.Ссылка; 
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Элемент Из Виды Цикл
			Если ЗначениеЗаполнено(Элемент.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйВид = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
			Если Элемент.Ключ = "Безалкогольная" Тогда
				НовыйВид.Наименование = "Товар";
				НовыйВид.АлкогольнаяПродукция = Ложь;
			ИначеЕсли Элемент.Ключ = "Импортная" Тогда
				НовыйВид.Наименование = "Алкоголь (Импорт)";
				НовыйВид.АлкогольнаяПродукция = Истина;
				НовыйВид.ИмпортнаяАлкогольнаяПродукция = Истина;
			ИначеЕсли Элемент.Ключ = "Российская" Тогда
				НовыйВид.Наименование = "Алкоголь (Россия)";
				НовыйВид.АлкогольнаяПродукция = Истина;
			ИначеЕсли Элемент.Ключ = "ТабачнаяПродукция" Тогда
				НовыйВид.Наименование = "Табачная продукция";
				НовыйВид.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;  
			ИначеЕсли Элемент.Ключ = "Пиво" Тогда
				НовыйВид.Наименование = "Пиво";
				НовыйВид.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Пиво;
			ИначеЕсли Элемент.Ключ = "СоковаяПродукция" Тогда
				НовыйВид.Наименование = "Соковая продукция";
				НовыйВид.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.СоковаяПродукция;
			ИначеЕсли Элемент.Ключ = "БезалкогольноеПиво" Тогда
				НовыйВид.Наименование = "Безалкогольное пиво";
				НовыйВид.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезалкогольноеПиво;
			КонецЕсли;     
			НовыйВид.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			НовыйВид.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
			НовыйВид.Записать();
			Виды[Элемент.Ключ] = НовыйВид.Ссылка;
		КонецЦикла;
		
		Возврат Виды;
		
	Иначе
		
		Виды = Новый Структура("Безалкогольная, Импортная, Российская");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВидыНоменклатуры.Ссылка КАК Ссылка,
		|	ВидыНоменклатуры.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ВидыНоменклатуры.ИмпортнаяАлкогольнаяПродукция КАК Импортная
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.ВидАлкогольнойПродукцииЕГАИС = ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
		|	И НЕ ВидыНоменклатуры.ПометкаУдаления
		|	И ВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И ВидыНоменклатуры.Наименование В (""Товар"", ""Алкоголь (Россия)"", ""Алкоголь (Импорт)"")
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыНоменклатуры.Ссылка,
		|	ВидыНоменклатуры.ИмпортнаяАлкогольнаяПродукция,
		|	ВидыНоменклатуры.АлкогольнаяПродукция";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.АлкогольнаяПродукция Тогда
				Виды.Безалкогольная = Выборка.Ссылка;
			ИначеЕсли Выборка.АлкогольнаяПродукция И Выборка.Импортная Тогда
				Виды.Импортная = Выборка.Ссылка;
			ИначеЕсли Выборка.АлкогольнаяПродукция И НЕ Выборка.Импортная Тогда
				Виды.Российская = Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Элемент Из Виды Цикл
			Если ЗначениеЗаполнено(Элемент.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйВид = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
			Если Элемент.Ключ = "Безалкогольная" Тогда
				НовыйВид.Наименование = "Товар";
				НовыйВид.АлкогольнаяПродукция = Ложь;
			ИначеЕсли Элемент.Ключ = "Импортная" Тогда
				НовыйВид.Наименование = "Алкоголь (Импорт)";
				НовыйВид.АлкогольнаяПродукция = Истина;
				НовыйВид.ИмпортнаяАлкогольнаяПродукция = Истина;
			ИначеЕсли Элемент.Ключ = "Российская" Тогда
				НовыйВид.Наименование = "Алкоголь (Россия)";
				НовыйВид.АлкогольнаяПродукция = Истина;
			КонецЕсли;     
			НовыйВид.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			НовыйВид.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
			НовыйВид.Записать();
			Виды[Элемент.Ключ] = НовыйВид.Ссылка;
		КонецЦикла;
		
		Возврат Виды;
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьКлассификаторНоменклатуры(Реквизиты)
	КлассификаторСсылка = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.НайтиПоКоду(Реквизиты.КодЕГАИС);
	Если ЗначениеЗаполнено(КлассификаторСсылка) Тогда
		Классификатор = КлассификаторСсылка.ПолучитьОбъект();
	Иначе
		Классификатор = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.СоздатьЭлемент();
		Классификатор.Код = Реквизиты.КодЕГАИС;
	КонецЕсли;
	
	Если Реквизиты.НаименованиеЕГАИС <> Классификатор.Наименование Тогда
		Классификатор.Наименование = Реквизиты.НаименованиеЕГАИС;
		Классификатор.НаименованиеПолное = Реквизиты.НаименованиеЕГАИС;
	КонецЕсли;
	
	Если Реквизиты.Крепость <> Классификатор.Крепость Тогда
		Классификатор.Крепость = Реквизиты.Крепость;
	КонецЕсли;
	
	Возврат КлассификаторСсылка;
КонецФункции

Процедура ПрочитатьВидПродукции(ДанныеСправочника)
	ОбъектыДанных = Новый Массив;
	ОбъектыДанных.Добавить(Новый Структура("Справочник, Ссылка, Объект", "ВидыАлкогольнойПродукции"));
	
	Для Каждого Элемент Из ОбъектыДанных Цикл
		Элемент.Ссылка = Справочники[Элемент.Справочник].НайтиПоКоду(ДанныеСправочника.Код);
		Если ЗначениеЗаполнено(Элемент.Ссылка) Тогда
			Элемент.Объект = Элемент.Ссылка.ПолучитьОбъект();
		Иначе
			Элемент.Объект = Справочники[Элемент.Справочник].СоздатьЭлемент();
			Элемент.Объект.Код = ДанныеСправочника.Код;
		КонецЕсли;
	КонецЦикла;
	
	ЗагруженныеРеквизиты = Новый Структура("Наименование, ВидЛицензии, Маркируемый",
	ДанныеСправочника.Наименование, Перечисления.ВидыЛицензийАлкогольнойПродукции.ПустаяСсылка(), Ложь);     
	
	ДанныеСправочникаКод = Лев(ДанныеСправочника.Код,3);
	
	Если ДанныеСправочникаКод > "000" И ДанныеСправочникаКод < "200"
		ИЛИ ДанныеСправочникаКод = "300" ИЛИ ДанныеСправочникаКод = "310" ИЛИ ДанныеСправочникаКод = "340" Тогда
		ЗагруженныеРеквизиты.ВидЛицензии = Перечисления.ВидыЛицензийАлкогольнойПродукции.Спирт;
	ИначеЕсли ДанныеСправочникаКод >= "200" И ДанныеСправочникаКод <= "260"
		ИЛИ ДанныеСправочникаКод = "270" ИЛИ ДанныеСправочникаКод = "280"
		ИЛИ ДанныеСправочникаКод >= "400" И ДанныеСправочникаКод <= "462" Тогда
		ЗагруженныеРеквизиты.ВидЛицензии = Перечисления.ВидыЛицензийАлкогольнойПродукции.АлкогольнаяПродукция;
		ЗагруженныеРеквизиты.Маркируемый = Истина;
	ИначеЕсли ДанныеСправочникаКод >= "261" И ДанныеСправочникаКод <= "263"
		ИЛИ ДанныеСправочникаКод >= "500" И ДанныеСправочникаКод <= "520" Тогда
		ЗагруженныеРеквизиты.ВидЛицензии = Перечисления.ВидыЛицензийАлкогольнойПродукции.Пиво;
		ЗагруженныеРеквизиты.Маркируемый = Ложь;
	ИначеЕсли ДанныеСправочникаКод >= "320" И ДанныеСправочникаКод <> "340" И ДанныеСправочникаКод <= "350" Тогда
		ЗагруженныеРеквизиты.ВидЛицензии = Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяПищеваяПродукция;
	ИначеЕсли ДанныеСправочникаКод >= "481" И ДанныеСправочникаКод <= "485" Тогда
		ЗагруженныеРеквизиты.ВидЛицензии = Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяНепищеваяПродукция;
	КонецЕсли;
	
	Для Каждого Элемент Из ОбъектыДанных Цикл
		Если Элемент.Объект.Наименование <> ЗагруженныеРеквизиты.Наименование Тогда
			Элемент.Объект.Наименование = ЗагруженныеРеквизиты.Наименование;
		КонецЕсли;
		
		Если Элемент.Объект.ВидЛицензии <> ЗагруженныеРеквизиты.ВидЛицензии Тогда
			Элемент.Объект.ВидЛицензии = ЗагруженныеРеквизиты.ВидЛицензии;
		КонецЕсли;
		
		Если Элемент.Объект.Метаданные().Реквизиты.Найти("Маркируемый") <> Неопределено И Элемент.Объект.Маркируемый <> ЗагруженныеРеквизиты.Маркируемый Тогда
			Элемент.Объект.Маркируемый = ЗагруженныеРеквизиты.Маркируемый;
		КонецЕсли;
		
		Если Элемент.Объект.Модифицированность() Тогда
			Попытка
				Элемент.Объект.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при записи вида продукции: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПрочитатьГруппуНоменклатуры(Реквизиты)
	НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Реквизиты.Идентификатор));
	Номенклатура = НоменклатураСсылка.ПолучитьОбъект();
	
	Если Номенклатура = Неопределено Тогда
		Номенклатура = Справочники.Номенклатура.СоздатьГруппу();
		Номенклатура.УстановитьСсылкуНового(НоменклатураСсылка);
	КонецЕсли;
	
	Если Номенклатура.Код <> Формат(Реквизиты.Код, "ЧГ=0") Тогда
		Номенклатура.Код = Формат(Реквизиты.Код, "ЧГ=0");
	КонецЕсли;
	
	Если Номенклатура.Наименование <> Реквизиты.Наименование Тогда
		Номенклатура.Наименование = Реквизиты.Наименование;
	КонецЕсли;
	
	Родитель = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Реквизиты.Родитель));
	Если Номенклатура.Родитель <> Родитель Тогда
		Номенклатура.Родитель = Родитель;
	КонецЕсли;
	
	Если Номенклатура.Модифицированность() Тогда
		Попытка
			Номенклатура.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка записи номенклатуры: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьКонтрагентаЕГАИС(Реквизиты)
	КонтрагентЕГАИССсылка = Справочники.КлассификаторОрганизацийЕГАИС.НайтиПоКоду(Реквизиты.Код);
	Если ЗначениеЗаполнено(КонтрагентЕГАИССсылка) Тогда
		КонтрагентЕГАИС = КонтрагентЕГАИССсылка.ПолучитьОбъект();
	Иначе
		КонтрагентЕГАИС = Справочники.КлассификаторОрганизацийЕГАИС.СоздатьЭлемент();
		КонтрагентЕГАИС.Код = Реквизиты.Код;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Структура();
	НовыеРеквизиты.Вставить("Наименование", Реквизиты.Наименование);
	НовыеРеквизиты.Вставить("НаименованиеПолное", Реквизиты.ПолнНаименование);
	НовыеРеквизиты.Вставить("КодСтраны", Число(Реквизиты.КодСтраны));
	НовыеРеквизиты.Вставить("ПредставлениеАдреса", Реквизиты.Адрес);
	
	Если Реквизиты.ТаможенныйСоюз Тогда
		НовыеРеквизиты.Вставить("ТипОрганизации", Перечисления.ТипыОрганизацийЕГАИС.КонтрагентТаможенногоСоюза);
		НовыеРеквизиты.Вставить("ИдентификаторОрганизацииТС", Реквизиты.ИНН);
		НовыеРеквизиты.Вставить("ИНН", "");
		НовыеРеквизиты.Вставить("КПП", "");
	ИначеЕсли Реквизиты.КодСтраны = "643" Тогда
		НовыеРеквизиты.Вставить("ТипОрганизации", Перечисления.ТипыОрганизацийЕГАИС.ЮридическоеЛицоРФ);
		НовыеРеквизиты.Вставить("ИНН", Реквизиты.ИНН);
		НовыеРеквизиты.Вставить("КПП", Реквизиты.КПП);
		Если ЗначениеЗаполнено(Реквизиты.КПП) Тогда
			Попытка
				НовыеРеквизиты.Вставить("КодРегиона", Число(Лев(СокрЛП(Реквизиты.КПП), 2)));
			Исключение
			КонецПопытки;
		КонецЕсли;
	Иначе
		НовыеРеквизиты.Вставить("ТипОрганизации", Перечисления.ТипыОрганизацийЕГАИС.ИностранныйКонтрагент);
	КонецЕсли;
	
	Для Каждого НовоеЗначение Из НовыеРеквизиты Цикл
		Если (ЗначениеЗаполнено(КонтрагентЕГАИС[НовоеЗначение.Ключ]) ИЛИ ЗначениеЗаполнено(НовоеЗначение.Значение))
			И КонтрагентЕГАИС[НовоеЗначение.Ключ] <> НовоеЗначение.Значение
			Тогда
			КонтрагентЕГАИС[НовоеЗначение.Ключ] = НовоеЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Если ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Реквизиты.Контрагент));
		Если ЗначениеЗаполнено(Контрагент.ИНН) И Контрагент.ИНН <> КонтрагентЕГАИС.ИНН Тогда
			КонтрагентЕГАИС.ИНН = Контрагент.ИНН;
		КонецЕсли;
		Если ЗначениеЗаполнено(Контрагент.КПП) И Контрагент.КПП <> КонтрагентЕГАИС.КПП Тогда
			КонтрагентЕГАИС.КПП = Контрагент.КПП;
		КонецЕсли;
	КонецЕсли;
	
	Если КонтрагентЕГАИС.Модифицированность() Тогда
		Попытка
			КонтрагентЕГАИС.Записать();
			КонтрагентЕГАИССсылка = КонтрагентЕГАИС.Ссылка;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при записи орг. ЕГАИС: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтрагентЕГАИССсылка) Тогда
		//СоответствиеКонтрагентов = РегистрыСведений.СоответствиеОрганизацийЕГАИС.Получить(Новый Структура("ОрганизацияЕГАИС", КонтрагентЕГАИССсылка));
		//Если СоответствиеКонтрагентов.Контрагент <> Контрагент Тогда
		//	СоответствиеКонтрагентов = РегистрыСведений.СоответствиеОрганизацийЕГАИС.СоздатьМенеджерЗаписи();
		//	СоответствиеКонтрагентов.ОрганизацияЕГАИС = КонтрагентЕГАИССсылка;
		//	СоответствиеКонтрагентов.Контрагент = Контрагент;
		//	Попытка
		//		СоответствиеКонтрагентов.Записать();
		//	Исключение
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка формирования соответствия орг. ЕГАИС: " + ОписаниеОшибки());
		//	КонецПопытки;
		//КонецЕсли;
		
		
		УстановитьПривилегированныйРежим(Истина);
		 		
		Спр = КонтрагентЕГАИССсылка.ПолучитьОбъект();
		Спр.СоответствуетОрганизации = ТипЗнч(Контрагент) = Тип("СправочникСсылка.Организации");
		Спр.Контрагент = Контрагент;
		Спр.ТорговыйОбъект = ?(Спр.СоответствуетОрганизации, ПараметрыСеанса.ТекущийМагазин, Неопределено);
	
		Спр.Записать();
 		
		
		
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьКонтрагента(Реквизиты)
	КонтрагентСсылка = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Реквизиты.Идентификатор));
	Контрагент = КонтрагентСсылка.ПолучитьОбъект();
	
	Если Контрагент = Неопределено Тогда
		Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
		Контрагент.УстановитьСсылкуНового(КонтрагентСсылка);
	КонецЕсли;
	
	Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Производители");
	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		Группа = Справочники.Контрагенты.СоздатьГруппу();
		Группа.Наименование = "Производители";
		Группа.Записать();
		Родитель = Группа.Ссылка;
	КонецЕсли;
	Контрагент.Родитель = Родитель;
	
	СоответствияРеквизитов = Новый Соответствие;
	СоответствияРеквизитов.Вставить("Наименование", "Наименование");
	СоответствияРеквизитов.Вставить("ИНН", "ИНН");
	СоответствияРеквизитов.Вставить("КПП", "КПП");
	СоответствияРеквизитов.Вставить("КодПоОКПО", "ОКПО");
	СоответствияРеквизитов.Вставить("НаименованиеПолное", "ПолноеНаименование");
	
	Для Каждого Элемент Из СоответствияРеквизитов Цикл
		Если (ЗначениеЗаполнено(Контрагент[Элемент.Ключ]) ИЛИ ЗначениеЗаполнено(Реквизиты[Элемент.Значение])) И Контрагент[Элемент.Ключ] <> Реквизиты[Элемент.Значение] Тогда
			Контрагент[Элемент.Ключ] = Реквизиты[Элемент.Значение];
		КонецЕсли;
	КонецЦикла;
	
	Контрагент.ЮрФизЛицо = ?(Реквизиты.ЮрФизЛицо = "физ", Перечисления.ЮрФизЛицо.ФизЛицо, Перечисления.ЮрФизЛицо.ЮрЛицо);
	
	Если Контрагент.Модифицированность() Тогда
		Попытка
			Контрагент.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при записи контрагента: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработкаДанныхПередОбменом

Процедура ЗаполнитьКассовуюКнигу(пОбъект)
	
	пОбъект.КассовыеОрдера.Очистить();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяКнига.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КассоваяКнига КАК КассоваяКнига
	|ГДЕ
	|	КассоваяКнига.Ссылка <> &ТекущийДокумент
	|	И КассоваяКнига.Организация = &Организация
	|	И КассоваяКнига.Магазин = &Магазин
	|	И КассоваяКнига.Проведен
	|	И НачалоПериода(КассоваяКнига.Дата, ДЕНЬ) = &ДатаНач
	|");
	
	Запрос.УстановитьПараметр("ТекущийДокумент", пОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация", пОбъект.Организация);
	Запрос.УстановитьПараметр("Магазин", пОбъект.Магазин);
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(пОбъект.Дата));
	
	ЗаполнятьДокументы = Истина;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнятьДокументы = Ложь;
	КонецЦикла;

	Если ЗаполнятьДокументы Тогда
		
		Запрос = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Кассы.Ссылка КАК Касса
		|ПОМЕСТИТЬ КассыМагазина
		|ИЗ
		|	Справочник.Кассы КАК Кассы
		|ГДЕ
		|	Кассы.Владелец = &Организация
		|	%УсловиеМагазин%
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДенежныеСредства.Регистратор КАК КассовыйОрдер,
		|	СУММА(ВЫБОР
		|			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ДенежныеСредства.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Приход,
		|	СУММА(ВЫБОР
		|			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ДенежныеСредства.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Расход,
		|	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет) КАК КорреспондирующийСчет
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяКнига.КассовыеОрдера КАК КассоваяКнига
		|		ПО (КассоваяКнига.Ссылка <> &Ссылка)
		|			И (КассоваяКнига.Ссылка.Проведен)
		|			И (КассоваяКнига.КассовыйОрдер = ДенежныеСредства.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		|		ПО (СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КассыМагазина КАК КассыМагазина
		|		ПО ДенежныеСредства.Касса = КассыМагазина.Касса
		|ГДЕ
		|	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ДенежныеСредства.Организация = &Организация
		|	%УсловиеМагазин1%
		|	%УсловиеХозОпераций%
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредства.Регистратор,
		|	ДенежныеСредства.Период
		|УПОРЯДОЧИТЬ ПО
		|	ДенежныеСредства.Период";
		
		Если ЗначениеЗаполнено(пОбъект.Магазин) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин%", "И Кассы.Магазин = &Магазин");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин1%", "И ДенежныеСредства.Касса.Магазин = &Магазин");
			
			УсловиеХозОпераций ="
			|	И ВЫБОР
			|			КОГДА ДенежныеСредства.СтатьяДвиженияДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
			|				ТОГДА ВЫБОР
			|						КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|							ТОГДА НЕ ДенежныеСредства.Регистратор.ДокументОснование.Касса.Магазин = ДенежныеСредства.Касса.Магазин
			|						ИНАЧЕ НЕ ДенежныеСредства.Касса.Магазин = ДенежныеСредства.Регистратор.КассаПолучатель.Магазин
			|					КОНЕЦ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеХозОпераций%", УсловиеХозОпераций);
			
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин%", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеМагазин1%", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеХозОпераций%", 
			"И НЕ ДенежныеСредства.СтатьяДвиженияДенежныхСредств.ХозяйственнаяОперация В
			|(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы),
			| ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу))");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(пОбъект.Дата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(пОбъект.Дата));
		Запрос.УстановитьПараметр("Организация", пОбъект.Организация);
		Запрос.УстановитьПараметр("Ссылка", пОбъект.Ссылка);
		Запрос.УстановитьПараметр("Магазин", пОбъект.Магазин);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			пОбъект.КассовыеОрдера.Загрузить(РезультатЗапроса.Выгрузить());
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьКассовыеДокументы()
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Истина;
	
	РегистрыНакопления.ДенежныеСредстваККМ.ПересчитатьИтоги();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДенежныеСредстваКПоступлениюНаличныеОстатки.ДокументПередачи КАК Выемка,
	               |	ДенежныеСредстваКПоступлениюНаличныеОстатки.ДокументПередачи.ОтчетОРозничныхПродажах КАК СсылкаНаОтчет,
	               |	ДенежныеСредстваКПоступлениюНаличныеОстатки.ДокументПередачи.ОтчетОРозничныхПродажах.Дата КАК СсылкаНаОтчетДата,
	               |	ДенежныеСредстваКПоступлениюНаличныеОстатки.ДокументПередачи.Дата КАК Дата,
	               |	ВложенныйЗапрос.Касса КАК Касса
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(Кассы.Ссылка) КАК Касса,
	               |		Кассы.Магазин КАК Магазин,
	               |		Кассы.Владелец КАК Организация
	               |	ИЗ
	               |		Справочник.Кассы КАК Кассы
	               |	ГДЕ
	               |		НЕ Кассы.ПометкаУдаления
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Кассы.Магазин,
	               |		Кассы.Владелец) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваКПоступлениюНаличные.Остатки(, ДокументПередачи ССЫЛКА Документ.ВыемкаДенежныхСредствИзКассыККМ) КАК ДенежныеСредстваКПоступлениюНаличныеОстатки
	               |		ПО (ДенежныеСредстваКПоступлениюНаличныеОстатки.ДокументПередачи.Магазин = ВложенныйЗапрос.Магазин)
	               |			И (ДенежныеСредстваКПоступлениюНаличныеОстатки.Организация = ВложенныйЗапрос.Организация)
	               |ГДЕ
	               |	ДенежныеСредстваКПоступлениюНаличныеОстатки.СуммаОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СписокСозданныхДокументов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		 		
		Выемка = Выборка.Выемка;
			
		//Перенос выемки на дату отчета о розничных продажах. 
		
		Если ЗначениеЗаполнено(Выборка.СсылкаНаОтчет) Тогда
			Если НЕ НачалоДня(Выборка.Дата) = НачалоДня(Выборка.СсылкаНаОтчетДата) Тогда
				обВыемка = Выемка.ПолучитьОбъект();
				обВыемка.Дата = Выборка.СсылкаНаОтчетДата+1;
				Попытка 
					обВыемка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение	
				КонецПопытки;	
			КонецЕсли;
		КонецЕсли;
		
		ПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		ПКО.Дата  = Выемка.Дата;
		ПКО.Касса = Выборка.Касса;
		ПКО.ДокументОснование = Выборка.Выемка;
		ПКО.Заполнить(Выборка.Выемка);
		ПКО.Основание = "Выручка за " + Формат(Выборка.Дата, "ДФ=dd/MM/yy");
		ПКО.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ПКО.Комментарий = "Создан автоматически";
		Попытка
			ПКО.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			СписокСозданныхДокументов.Добавить(ПКО.Ссылка);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.КассовыйОрдер,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.КассаМагазин КАК Магазин,
	|	ВложенныйЗапрос.День КАК День,
	|	ВложенныйЗапрос.Приход,
	|	ВложенныйЗапрос.Расход
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриходныйКассовыйОрдер.Ссылка КАК КассовыйОрдер,
	|		ПриходныйКассовыйОрдер.Организация КАК Организация,
	|		ПриходныйКассовыйОрдер.Касса.Магазин КАК КассаМагазин,
	|		НАЧАЛОПЕРИОДА(ПриходныйКассовыйОрдер.Дата, ДЕНЬ) КАК День,
	|		ПриходныйКассовыйОрдер.СуммаДокумента КАК Приход,
	|		0 КАК Расход
	|	ИЗ
	|		Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|	ГДЕ
	|		ПриходныйКассовыйОрдер.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходныйКассовыйОрдер.Ссылка,
	|		РасходныйКассовыйОрдер.Организация,
	|		РасходныйКассовыйОрдер.Касса.Магазин,
	|		НАЧАЛОПЕРИОДА(РасходныйКассовыйОрдер.Дата, ДЕНЬ),
	|		0,
	|		РасходныйКассовыйОрдер.СуммаДокумента
	|	ИЗ
	|		Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|	ГДЕ
	|		РасходныйКассовыйОрдер.Проведен) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КассоваяКнигаКассовыеОрдера.КассовыйОрдер КАК КассовыйОрдер,
	|			КассоваяКнигаКассовыеОрдера.Ссылка.Дата КАК Дата,
	|			КассоваяКнигаКассовыеОрдера.Ссылка.Организация КАК Организация,
	|			КассоваяКнигаКассовыеОрдера.Ссылка.Магазин КАК Магазин
	|		ИЗ
	|			Документ.КассоваяКнига.КассовыеОрдера КАК КассоваяКнигаКассовыеОрдера
	|		ГДЕ
	|			КассоваяКнигаКассовыеОрдера.Ссылка.Проведен
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КассоваяКнигаКассовыеОрдера.КассовыйОрдер,
	|			КассоваяКнигаКассовыеОрдера.Ссылка.Дата,
	|			КассоваяКнигаКассовыеОрдера.Ссылка.Организация,
	|			КассоваяКнигаКассовыеОрдера.Ссылка.Магазин) КАК ДанныеКассовойКниги
	|		ПО ВложенныйЗапрос.КассовыйОрдер = ДанныеКассовойКниги.КассовыйОрдер
	|ГДЕ
	|	ДанныеКассовойКниги.Дата ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	День";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ЛистыПоДням = Новый ТаблицаЗначений;
	ЛистыПоДням.Колонки.Добавить("КассоваяКнига");
	ЛистыПоДням.Колонки.Добавить("День");
	ЛистыПоДням.Колонки.Добавить("Организация");
	ЛистыПоДням.Колонки.Добавить("Магазин");
	ОтборЛиста = Новый Структура("День, Организация, Магазин");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОтборЛиста, Выборка);
		Лист = ЛистыПоДням.НайтиСтроки(ОтборЛиста);
		Если Лист.Количество() = 0 Тогда
			ЛистыСсылки = Документы.КассоваяКнига.Выбрать(Выборка.День, КонецДня(Выборка.День));
			ДокЛист = Неопределено;
			Пока ЛистыСсылки.Следующий() Цикл
				Если ЛистыСсылки.Проведен И ЛистыСсылки.Организация = Выборка.Организация И ЛистыСсылки.Магазин = Выборка.Магазин Тогда
					ДокЛист = ЛистыСсылки.ПолучитьОбъект();
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ДокЛист = Неопределено Тогда
				ДокЛист = Документы.КассоваяКнига.СоздатьДокумент();
				ДокЛист.Организация = Выборка.Организация;
				ДокЛист.Магазин = Выборка.Магазин;
				ДокЛист.ТипЛиста = Перечисления.ТипыЛистовКассовойКниги.Обычный;
				ДокЛист.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				ДокЛист.Дата = Выборка.День;
				ДокЛист.Комментарий = "Создан автоматически";
			КонецЕсли;
			
			НоваяСтрока = ЛистыПоДням.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Организация, Магазин");
			НоваяСтрока.День = Выборка.День;
			НоваяСтрока.КассоваяКнига = ДокЛист;
		Иначе
			ДокЛист = Лист[0].КассоваяКнига;
		КонецЕсли;
		
		СтрОрдер = ДокЛист.КассовыеОрдера.Найти(Выборка.КассовыйОрдер, "КассовыйОрдер");
		Если СтрОрдер = Неопределено Тогда
			ЗаполнитьКассовуюКнигу(ДокЛист);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из ЛистыПоДням Цикл
		Если Строка.КассоваяКнига.Модифицированность() Тогда
			Попытка
				Строка.КассоваяКнига.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
				Строка.КассоваяКнига.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				СписокСозданныхДокументов.Добавить(Строка.КассоваяКнига.Ссылка);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Ложь;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанных

Функция ЗагрузитьСтрану(КодСтраны)
	Страна = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
	Если ЗначениеЗаполнено(Страна) Тогда
		Возврат Страна;
	КонецЕсли;
	
	ДанныеСтраны = Справочники.СтраныМира.ДанныеКлассификатораСтранМираПоКоду(КодСтраны);
	Если ДанныеСтраны <> Неопределено Тогда
		НоваяСтрана = Справочники.СтраныМира.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НоваяСтрана, ДанныеСтраны);
		НоваяСтрана.Записать();
		Возврат НоваяСтрана.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.СтраныМира.ПустаяСсылка();
КонецФункции

Процедура ЗагрузитьДанныеДокументов(Узел, ТаблицаРезультат)
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого Строка Из ТаблицаРезультат Цикл
		СсылкаНаДокумент = Документы[СтрЗаменить(Строка.ТипИсточник, "Документ.", "")].ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.СсылкаИсточник));
		Если Строка.Успех ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") И Найти(Строка.ОписаниеОшибки, "период запрета") > 0 Тогда
			Если ЗначениеЗаполнено(Строка.СсылкаПриемник) Тогда
				Набор = РегистрыСведений.СоответствияОбъектовИнформационныхБаз.СоздатьНаборЗаписей();
				Набор.Отбор.УзелИнформационнойБазы.Установить(Узел);
				Набор.Отбор.УникальныйИдентификаторИсточника.Установить(СсылкаНаДокумент);
				Набор.Прочитать();
				Набор.Очистить();
				
				Запись = Набор.Добавить();
				Запись.ТипИсточника = Строка.ТипИсточник;
				Запись.УзелИнформационнойБазы = Узел;
				Запись.УникальныйИдентификаторИсточника = СсылкаНаДокумент;
				Запись.ТипПриемника = Строка.ТипПриемник;
				Запись.УникальныйИдентификаторПриемника = Строка.СсылкаПриемник;
				Запись.УникальныйИдентификаторИсточникаСтрокой = Строка.СсылкаИсточник;
				Запись.ОбъектВыгруженПоСсылке = Истина;
				Набор.Записать();
			КонецЕсли;
			
			Набор = РегистрыСведений.РезультатыОбменаДанными.СоздатьНаборЗаписей();
			Набор.Отбор.ПроблемныйОбъект.Установить(СсылкаНаДокумент);
			Набор.Прочитать();
			Набор.Очистить();
			Набор.Записать();
		Иначе
			Запись = РегистрыСведений.РезультатыОбменаДанными.СоздатьМенеджерЗаписи();
			Запись.ДатаВозникновения = ТекущаяДата();
			Запись.ПроблемныйОбъект = СсылкаНаДокумент;
			Запись.ТипПроблемы = Перечисления.ТипыПроблемОбменаДанными.НепроведенныйДокумент;
			Запись.УзелИнформационнойБазы = Узел;
			Запись.Причина = Строка.ОписаниеОшибки;
			Запись.Записать();
			
			Если Узел.Метаданные().Состав.Содержит(СсылкаНаДокумент.Метаданные()) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Узел, СсылкаНаДокумент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ЗагрузитьНоменклатуру(ПолученныеДанные) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ПолученныеДанные.Свойство("ВидыПродукции") Тогда
		Для Каждого Строка Из ПолученныеДанные.ВидыПродукции Цикл
			ПрочитатьВидПродукции(Строка);
		КонецЦикла;
	КонецЕсли;
	
	Если ПолученныеДанные.Свойство("Контрагенты") Тогда
		Для Каждого Строка Из ПолученныеДанные.Контрагенты Цикл
			ПрочитатьКонтрагента(Строка);
		КонецЦикла;
	КонецЕсли;
	
	Если ПолученныеДанные.Свойство("КонтрагентЕГАИС") Тогда
		Для Каждого Строка Из ПолученныеДанные.КонтрагентЕГАИС Цикл
			ПрочитатьКонтрагентаЕГАИС(Строка);
		КонецЦикла;
	КонецЕсли;
	
	ИзмененныйАлкоголь = Новый Массив;
	Если ПолученныеДанные.Свойство("Номенклатура") Тогда
		Для Каждого Строка Из ПолученныеДанные.Номенклатура Цикл
			Если Строка.ЭтоГруппа Тогда
				ПрочитатьГруппуНоменклатуры(Строка);
			Иначе
				НоваяНоменклатура = ПрочитатьНоменклатуру(Строка, ПолучитьВидыНоменклатуры());
				Если ЗначениеЗаполнено(НоваяНоменклатура) И НоваяНоменклатура.АлкогольнаяПродукция Тогда
					ИзмененныйАлкоголь.Добавить(НоваяНоменклатура);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Сегмент = Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Алкогольная продукция");
	Если ЗначениеЗаполнено(Сегмент) Тогда
		Для Каждого Алкоголь Из ИзмененныйАлкоголь Цикл
			Если ЗначениеЗаполнено(Алкоголь) Тогда
				Запись = РегистрыСведений.НоменклатураСегмента.СоздатьМенеджерЗаписи();
				Запись.Сегмент = Сегмент;
				Запись.Номенклатура = Алкоголь;
				Запись.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	
	УстановитьПривилегированныйРежим(Ложь);	
КонецПроцедуры

Процедура ЗагрузитьПоставки(ТаблицаПоставок)     
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПропуститьПроверкуЗапретаИзменения = Истина;
	       	
	НовыеПоступления.Очистить();
	ЕстьАлкоголь = Ложь;
	
	Для Каждого СтрДокумент Из ТаблицаПоставок Цикл
		СтрРезультат = НовыеПоступления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрРезультат, СтрДокумент);
		СтрРезультат.Загружено = Ложь;
		ЕстьАлкоголь = ЕстьАлкоголь ИЛИ СтрДокумент.ЕстьАлкоголь;
		
		Если НЕ ЗначениеЗаполнено(СтрДокумент.ДатаТТН) Тогда
			СтрРезультат[0].Сообщение = "Не заполнена дата ТТН";
			СтрРезультат[0].ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрДокумент.НомерТТН) Тогда
			СтрРезультат[0].Сообщение = "Не заполнен номер ТТН";
			СтрРезультат[0].ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	  	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.НомерТТН КАК НомерТТН,
	               |	Таб.ДатаТТН КАК ДатаТТН,
	               |	Таб.ПоставщикИНН КАК ПоставщикИНН,
	               |	Таб.ПоставщикКПП КАК ПоставщикКПП,
	               |	Таб.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ КПоступлению
	               |ИЗ
	               |	&Таб КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КПоступлению.НомерТТН КАК НомерТТН,
	               |	КПоступлению.ДатаТТН КАК ДатаТТН,
	               |	КПоступлению.НомерСтроки КАК НомерСтроки,
	               |	ТТНВходящаяЕГАИС.Ссылка КАК Ссылка,
	               |	ТТНВходящаяЕГАИС.ИдентификаторЕГАИС КАК ИдентификаторЕГАИС
	               |ПОМЕСТИТЬ ТТНЕГАИС
	               |ИЗ
	               |	КПоступлению КАК КПоступлению
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТТНВходящаяЕГАИС КАК ТТНВходящаяЕГАИС
	               |		ПО КПоступлению.НомерТТН = ТТНВходящаяЕГАИС.НомерТТН
	               |			И (НАЧАЛОПЕРИОДА(КПоступлению.ДатаТТН, ГОД) = НАЧАЛОПЕРИОДА(ТТНВходящаяЕГАИС.ДатаТТН, ГОД)
	               |				ИЛИ НАЧАЛОПЕРИОДА(КПоступлению.ДатаТТН, ГОД) = НАЧАЛОПЕРИОДА(ТТНВходящаяЕГАИС.ДатаОтгрузки, ГОД))
	               |			И КПоступлению.ПоставщикКПП = ТТНВходящаяЕГАИС.Грузоотправитель.КПП
	               |			И КПоступлению.ПоставщикКПП = ТТНВходящаяЕГАИС.Грузоотправитель.КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТНЕГАИС.НомерСтроки КАК НомерСтроки,
	               |	ТТНЕГАИС.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ПоследняяТТНЕГАИС
	               |ИЗ
	               |	ТТНЕГАИС КАК ТТНЕГАИС
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТНЕГАИС.НомерСтроки КАК НомерСтроки,
	               |			МАКСИМУМ(ТТНЕГАИС.ИдентификаторЕГАИС) КАК ИдентификаторЕГАИС
	               |		ИЗ
	               |			ТТНЕГАИС КАК ТТНЕГАИС
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТНЕГАИС.НомерСтроки) КАК ВложенныйЗапрос
	               |		ПО ТТНЕГАИС.НомерСтроки = ВложенныйЗапрос.НомерСтроки
	               |			И ТТНЕГАИС.ИдентификаторЕГАИС = ВложенныйЗапрос.ИдентификаторЕГАИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КПоступлению.НомерТТН КАК НомерТТН,
	               |	КПоступлению.ДатаТТН КАК ДатаТТН,
	               |	КПоступлению.НомерСтроки КАК НомерСтроки,
	               |	КПоступлению.ПоставщикИНН КАК ПоставщикИНН,
	               |	КПоступлению.ПоставщикКПП КАК ПоставщикКПП,
	               |	ЕСТЬNULL(Контрагенты.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	               |	ЕСТЬNULL(ПоследняяТТНЕГАИС.Ссылка, ЗНАЧЕНИЕ(Документ.ТТНВходящаяЕГАИС.ПустаяСсылка)) КАК ТТНВходящая
	               |ИЗ
	               |	КПоступлению КАК КПоступлению
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследняяТТНЕГАИС КАК ПоследняяТТНЕГАИС
	               |		ПО КПоступлению.НомерСтроки = ПоследняяТТНЕГАИС.НомерСтроки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КПоступлению.НомерСтроки КАК НомерСтроки,
	               |			МАКСИМУМ(Контрагенты.Ссылка) КАК Контрагент
	               |		ИЗ
	               |			КПоступлению КАК КПоступлению
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |				ПО КПоступлению.ПоставщикИНН = Контрагенты.ИНН
	               |					И КПоступлению.ПоставщикКПП = Контрагенты.КПП
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КПоступлению.НомерСтроки) КАК Контрагенты
	               |		ПО КПоступлению.НомерСтроки = Контрагенты.НомерСтроки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КПоступлению.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеТоваров.Ссылка КАК Поступление,
	               |	ПоступлениеТоваров.Проведен КАК Проведен,
	               |	ПоступлениеТоваров.Дата КАК Дата
	               |ИЗ
	               |	КПоступлению КАК КПоступлению
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	               |		ПО КПоступлению.НомерТТН = ПоступлениеТоваров.НомерВходящегоДокумента
	               |			И (НАЧАЛОПЕРИОДА(КПоступлению.ДатаТТН, ГОД) = НАЧАЛОПЕРИОДА(ПоступлениеТоваров.ДатаВходящегоДокумента, ГОД))
	               |			И КПоступлению.ПоставщикИНН = ПоступлениеТоваров.Контрагент.ИНН";
	
	Запрос.УстановитьПараметр("Таб", НовыеПоступления.Выгрузить(Новый Структура("ЕстьОшибки", Ложь)));
	Результаты = Запрос.ВыполнитьПакет();
	ТабПоступления = Результаты[4].Выгрузить();
	СтрПоставки = Результаты[3].Выбрать();
	
	Отбор = Новый Структура("НомерТТН, ДатаТТН, ПоставщикИНН, ПоставщикКПП");
	Пока СтрПоставки.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Отбор, СтрПоставки);
		СтрДокумент = ТаблицаПоставок.НайтиСтроки(Отбор);
		Если СтрДокумент.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДанныеДокумента = СтрДокумент[0];
		
		Если НЕ ЗначениеЗаполнено(СтрПоставки.Контрагент) Тогда
			НовыеПоступления[СтрПоставки.НомерСтроки - 1].Загружено = Ложь;
			НовыеПоступления[СтрПоставки.НомерСтроки - 1].Сообщение = "Не найден поставщик ИНН " + СтрДокумент.ПоставщикИНН + ", КПП " + СтрДокумент.ПоставщикКПП;
			Продолжить;
		КонецЕсли;
			
		Если ДанныеДокумента.ЕстьАлкоголь И НЕ ЗначениеЗаполнено(СтрПоставки.ТТНВходящая) Тогда
			НовыеПоступления[СтрПоставки.НомерСтроки - 1].Загружено = Ложь;
			НовыеПоступления[СтрПоставки.НомерСтроки - 1].Сообщение = "Отсутствует ТТН входящая ЕГАИС";
			Продолжить;
		КонецЕсли;
		
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("НоменклатураКод", Новый ОписаниеТипов("Строка"));
		ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТоваров.Колонки.Добавить("АлкогольнаяПродукция", Новый ОписаниеТипов("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"));
		ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		ТаблицаТоваров.Колонки.Добавить("Подобрано", Новый ОписаниеТипов("Булево"));
		ТаблицаТоваров.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
		ТаблицаТоваров.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		ТаблицаТоваров.Колонки.Добавить("Алкоголь", Новый ОписаниеТипов("Булево"));
		ТаблицаТоваров.Колонки.Добавить("ИдСправкиА", Новый ОписаниеТипов("Строка"));
		ТаблицаТоваров.Колонки.Добавить("ИдСправкиБ", Новый ОписаниеТипов("Строка"));
		
		Для Каждого СтрТовара Из ДанныеДокумента.ТабТовары Цикл
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТовара, "НоменклатураКод, Цена, Количество, Сумма, Алкоголь, ИдСправкиА, ИдСправкиБ");
			Если ЗначениеЗаполнено(СтрТовара.НоменклатураКодЕГАИС) Тогда
				 НоваяСтрока.АлкогольнаяПродукция = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.НайтиПоКоду(СтрТовара.НоменклатураКодЕГАИС);
			КонецЕсли;
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрТовара.Номенклатура));
		КонецЦикла;
		
		СуществующиеПоступления = ТабПоступления.Скопировать(Новый Структура("НомерСтроки", СтрПоставки.НомерСтроки));
		СуществующиеПоступления.Сортировать("Проведен Убыв, Дата Убыв");
		Если СуществующиеПоступления.Количество() > 0 Тогда
			ДокПоступление = СуществующиеПоступления[0].Поступление.ПолучитьОбъект();
			Если НЕ ДокПоступление.Проведен Тогда
				ДокПоступление.Дата = ТекущаяДата();
			КонецЕсли;
			ДокПоступление.Товары.Очистить();
			ДокПоступление.ТоварыПоДаннымПоставщика.Очистить();
			ДокПоступление.ЭтапыОплат.Очистить();
		Иначе
			ДокПоступление = Документы.ПоступлениеТоваров.СоздатьДокумент();
			//ДокПоступление.Дата = ТекущаяДата();
			ДокПоступление.Дата = НачалоДня(СтрПоставки.ДатаТТН) + 3600;
			ДокПоступление.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;		
		
		ДокПоступление.Магазин = ПараметрыСеанса.ТекущийМагазин;
		ДокПоступление.Склад = ДокПоступление.Магазин.СкладПоступления;
		ДокПоступление.Организация = ДокПоступление.Склад.Организация;
		ДокПоступление.УчитыватьНДС = Истина;
		ДокПоступление.ЦенаВключаетНДС = Истина;
		ДокПоступление.НомерВходящегоДокумента = СтрПоставки.НомерТТН;
		ДокПоступление.ДатаВходящегоДокумента = СтрПоставки.ДатаТТН;
		ДокПоступление.Контрагент = СтрПоставки.Контрагент;
		Если ДанныеДокумента.ЕстьАлкоголь Тогда
			ДокПоступление.ТТНВходящаяЕГАИС = СтрПоставки.ТТНВходящая;
		КонецЕсли;
		
		Если ЕстьАлкоголь Тогда
			Для Каждого СтрЕГАИС Из ДокПоступление.ТТНВходящаяЕГАИС.Товары Цикл
				СтрТовары = ДокПоступление.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТовары, СтрЕГАИС, "АлкогольнаяПродукция, Цена, Сумма, ИдентификаторСтроки, ИдентификаторУпаковки");
				СтрПоставщик = ДокПоступление.ТоварыПоДаннымПоставщика.Добавить();
				ЗаполнитьЗначенияСвойств(СтрПоставщик, СтрТовары);
				СтрПоставщик.Количество = СтрЕГАИС.Количество;
				СтрПоставщик.КоличествоУпаковок = СтрПоставщик.Количество;
				
				СтрПодходящие = ТаблицаТоваров.НайтиСтроки(Новый Структура("АлкогольнаяПродукция, ИдСправкиА, ИдСправкиБ, Подобрано", СтрЕГАИС.АлкогольнаяПродукция, СтрЕГАИС.Справка2.НомерСправки1, СтрЕГАИС.НомерСправки2Поставщика, Ложь));
				Если СтрПодходящие.Количество() > 0 Тогда
					СтрПодходящие[0].Подобрано = Истина;
					ЗаполнитьЗначенияСвойств(СтрТовары, СтрПодходящие[0], "Номенклатура, Количество, Цена, Сумма");
					СтрТовары.КоличествоУпаковок = СтрПодходящие[0].Количество;
					СтрПоставщик.Номенклатура = СтрТовары.Номенклатура;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого СтрТовара Из ТаблицаТоваров Цикл
			Если СтрТовара.Подобрано Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрТовара.Алкоголь Тогда
				//Повторное заполнение - если по каким-то причинам раньше не был найден товар по справкам А, Б
				СтрЕГАИС = ДокПоступление.Товары.НайтиСтроки(Новый Структура("АлкогольнаяПродукция, Количество", СтрТовара.АлкогольнаяПродукция, 0));
				Если СтрЕГАИС.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(СтрЕГАИС[0], СтрТовара, "Номенклатура, Количество, Цена, Сумма");
					СтрЕГАИС[0].КоличествоУпаковок = СтрЕГАИС[0].Количество;
					СтрТовара.Подобрано = Истина;
					СтрПоставщика = ДокПоступление.ТоварыПоДаннымПоставщика.Найти(СтрЕГАИС[0].ИдентификаторСтроки, "ИдентификаторСтроки");
					Если СтрПоставщика <> Неопределено Тогда
						СтрПоставщика.Номенклатура = СтрТовара.Номенклатура;
					КонецЕсли;
				КонецЕсли;
			Иначе //Добавление безалкогольных товаров
				НоваяСтрока = ДокПоступление.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТовара, "Номенклатура, Количество, Цена, Сумма");
				НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
				СтрТовара.Подобрано = Истина;
				
				НоваяСтрокаПоставщика = ДокПоступление.ТоварыПоДаннымПоставщика.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоставщика, НоваяСтрока, "Номенклатура, Количество, КоличествоУпаковок, Цена, Сумма");
			КонецЕсли;
		КонецЦикла;
		
		Пропущены = ТаблицаТоваров.НайтиСтроки(Новый Структура("Подобрано", Ложь));
		Если Пропущены.Количество() = 0 Тогда
			НулевыеСтроки = ДокПоступление.Товары.НайтиСтроки(Новый Структура("Количество", 0));
			Для Каждого Строка Из НулевыеСтроки Цикл
				ДокПоступление.Товары.Удалить(Строка);
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Таб.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
			               |	Таб.Номенклатура КАК Номенклатура,
			               |	Таб.ИдентификаторСтроки КАК ИдентификаторСтроки
			               |ПОМЕСТИТЬ ТоварыПоставщика
			               |ИЗ
			               |	&Таб КАК Таб
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВложенныйЗапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
			               |	Номенклатура.Ссылка КАК Номенклатура
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		ВЫРАЗИТЬ(ТоварыПоставщика.АлкогольнаяПродукция КАК Справочник.КлассификаторАлкогольнойПродукцииЕГАИС).Код КАК КодЕГАИС,
			               |		ТоварыПоставщика.ИдентификаторСтроки КАК ИдентификаторСтроки
			               |	ИЗ
			               |		ТоварыПоставщика КАК ТоварыПоставщика
			               |	ГДЕ
			               |		(ТоварыПоставщика.Номенклатура ЕСТЬ NULL
			               |				ИЛИ ВЫРАЗИТЬ(ТоварыПоставщика.Номенклатура КАК Справочник.Номенклатура).Код ЕСТЬ NULL)) КАК ВложенныйЗапрос
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			               |		ПО ВложенныйЗапрос.КодЕГАИС = Номенклатура.КодЕГАИС";
			
			Запрос.УстановитьПараметр("Таб", ДокПоступление.ТоварыПоДаннымПоставщика.Выгрузить());
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрПоставщик = ДокПоступление.ТоварыПоДаннымПоставщика.Найти(Выборка.ИдентификаторСтроки, "ИдентификаторСтроки");
				Если СтрПоставщик <> Неопределено Тогда
					СтрПоставщик.Номенклатура = Выборка.Номенклатура;
				КонецЕсли;
			КонецЦикла;
			
			
			Товары = ДокПоступление.Товары.Выгрузить( , "АлкогольнаяПродукция, Количество");
			Товары.Свернуть("АлкогольнаяПродукция", "Количество");
			ТоварыПоставщика = ДокПоступление.ТоварыПоДаннымПоставщика.Выгрузить( , "АлкогольнаяПродукция, Количество");
			ТоварыПоставщика.Свернуть("АлкогольнаяПродукция", "Количество");
			
			ДокПоступление.ЕстьРасхождения = НЕ ОбщегоНазначения.КоллекцииИдентичны(Товары, ТоварыПоставщика);
				
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ОбработкаТабличнойЧастиТоварыКлиентСервер.СтруктураПараметровСтавкиНДСУчитыватьНДС(ДокПоступление));
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", ОбработкаТабличнойЧастиТоварыКлиентСервер.СтруктураПересчетаСуммыНДСВТЧ(ДокПоступление));
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			
			СтруктураТЧ = Новый Структура;
			СтруктураТЧ.Вставить("СтрокиТЧ" , ДокПоступление.Товары);
			ОбработкаТабличнойЧастиТоварыСервер.ПриИзмененииРеквизитовВТЧСервер(СтруктураТЧ, СтруктураДействий, Неопределено);
					
			СтруктураТЧ.СтрокиТЧ = ДокПоступление.ТоварыПоДаннымПоставщика;
			ОбработкаТабличнойЧастиТоварыСервер.ПриИзмененииРеквизитовВТЧСервер(СтруктураТЧ, СтруктураДействий, Неопределено);
			
			ПриходЗаписанУдачно = Ложь;  
			
			Если ДокПоступление.ЕстьРасхождения = Истина Тогда
				НовыеПоступления[СтрПоставки.НомерСтроки - 1].Сообщение = "Ошибка: в Поступлении есть расхождение";
		  	Иначе	
				
				Попытка
					ДокПоступление.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					НовыеПоступления[СтрПоставки.НомерСтроки - 1].Загружено = Истина;
					НовыеПоступления[СтрПоставки.НомерСтроки - 1].ПоступлениеТоваров = ДокПоступление.Ссылка;
					ПриходЗаписанУдачно = Истина;
				Исключение
					НовыеПоступления[СтрПоставки.НомерСтроки - 1].Сообщение = "Ошибка записи поступления: " + ОписаниеОшибки();
				КонецПопытки;
				
			КонецЕсли;
			
			//15-12-18
			
			УстановитьПривилегированныйРежим(Истина);
			
			Попытка
				ПараметрыТаблицаТоваров = Новый Структура("АлкогольнаяПродукция, ИдСправкиБ");
							
				Если ПриходЗаписанУдачно И ДанныеДокумента.ЕстьАлкоголь Тогда
			    	обТТНВходящая = ДокПоступление.ТТНВходящаяЕГАИС.ПолучитьОбъект();
		         	Для Каждого лСтрока Из  обТТНВходящая.Товары Цикл
					  //  Если ЗначениеЗаполнено(лСтрока.Номенклатура) Тогда
					  //  	 Продолжить;
					  //КонецЕсли;
					 
						ПараметрыТаблицаТоваров.Вставить("АлкогольнаяПродукция", лСтрока.АлкогольнаяПродукция);
						ПараметрыТаблицаТоваров.Вставить("ИдСправкиБ",			 лСтрока.НомерСправки2Поставщика);
			        				 					 
						МассивСтрок = ТаблицаТоваров.НайтиСтроки(ПараметрыТаблицаТоваров);
					
						Если НЕ МассивСтрок.Количество() = 0 Тогда
							лСтрока.Номенклатура = МассивСтрок[0].Номенклатура;
						Иначе
							лСтрока.Номенклатура = ВернутьНоменклатуруПоКодуЕгаис(лСтрока.АлкогольнаяПродукция.Код); 
						КонецЕсли;	 
					 КонецЦикла;
				 
					 обТТНВходящая.Записать(РежимЗаписиДокумента.Проведение);
					 
					 //02-06-20
					    					 
					 Запрос = Новый Запрос("ВЫБРАТЬ
					                       |	ТТНВходящаяЕГАИСАкцизныеМарки.АкцизнаяМарка КАК АкцизнаяМарка,
					                       |	ТТНВходящаяЕГАИСТовары.Номенклатура КАК Номенклатура
					                       |ИЗ
					                       |	Документ.ТТНВходящаяЕГАИС.АкцизныеМарки КАК ТТНВходящаяЕГАИСАкцизныеМарки
					                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТТНВходящаяЕГАИС.Товары КАК ТТНВходящаяЕГАИСТовары
					                       |		ПО ТТНВходящаяЕГАИСАкцизныеМарки.Ссылка = ТТНВходящаяЕГАИСТовары.Ссылка
					                       |			И ТТНВходящаяЕГАИСАкцизныеМарки.Справка2 = ТТНВходящаяЕГАИСТовары.Справка2
					                       |			И ТТНВходящаяЕГАИСАкцизныеМарки.АкцизнаяМарка.Номенклатура <> ТТНВходящаяЕГАИСТовары.Номенклатура
					                       |ГДЕ
					                       |	ТТНВходящаяЕГАИСАкцизныеМарки.Ссылка = &ТТНВходящая");
					 
					 Запрос.Параметры.Вставить("ТТНВходящая",ДокПоступление.ТТНВходящаяЕГАИС);
					 Результат = Запрос.Выполнить();
					 Выборка = Результат.Выбрать();
					 Пока Выборка.Следующий() Цикл
						  обАкцизнаяМарка = Выборка.АкцизнаяМарка.ПолучитьОбъект();
						  обАкцизнаяМарка.Номенклатура = Выборка.Номенклатура;
						  обАкцизнаяМарка.Записать();
					 КонецЦикла;
					     		  
				 
				КонецЕсли;	
				
			Исключение	
			КонецПопытки;	
			
			УстановитьПривилегированныйРежим(Ложь);

			//Конец 02-06-20
				
		Иначе
			СписокКодов = "";
			Для Каждого Стр Из Пропущены Цикл
				СписокКодов = СписокКодов + Стр.НоменклатураКод + ", ";
			КонецЦикла;
			
			НовыеПоступления[СтрПоставки.НомерСтроки - 1].Сообщение = "Не найдена алк. продукция для номенклатуры " + Сред(СписокКодов, 1, СтрДлина(СписокКодов) - 2);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьПоставщиков(ТаблицаПоставщиков)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.ИНН,
	               |	Таб.КПП,
	               |	Таб.КодЕГАИС,
	               |	Таб.Наименование,
	               |	Таб.НаименованиеЕГАИС,
	               |	Таб.ПолнНаименование,
	               |	Таб.АдресЕГАИС,
	               |	Таб.КодРегиона,
	               |	Таб.Адрес
	               |ПОМЕСТИТЬ ОснРеквизиты
	               |ИЗ
	               |	&Таб КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОснРеквизиты.ИНН,
	               |	ОснРеквизиты.КПП,
	               |	ЕСТЬNULL(Контрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	               |	ЕСТЬNULL(КлассификаторОрганизацийЕГАИС.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификаторОрганизацийЕГАИС.ПустаяСсылка)) КАК ОрганизацияЕГАИС,
	               |	ОснРеквизиты.КодЕГАИС,
	               |	ОснРеквизиты.Наименование,
	               |	ОснРеквизиты.НаименованиеЕГАИС,
	               |	ОснРеквизиты.ПолнНаименование,
	               |	ОснРеквизиты.АдресЕГАИС,
	               |	ОснРеквизиты.КодРегиона,
	               |	ОснРеквизиты.Адрес
	               |ИЗ
	               |	ОснРеквизиты КАК ОснРеквизиты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО ОснРеквизиты.ИНН = Контрагенты.ИНН
	               |			И ОснРеквизиты.КПП = Контрагенты.КПП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	               |		ПО ОснРеквизиты.КодЕГАИС = КлассификаторОрганизацийЕГАИС.Код";
	
	Запрос.УстановитьПараметр("Таб", ТаблицаПоставщиков);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ГруппаРодитель = Неопределено;
	ВозможныеРодители = Справочники.Контрагенты.Выбрать( , , Новый Структура("Наименование", "Поставщики"));
	Пока ВозможныеРодители.Следующий() Цикл
		Если ВозможныеРодители.ЭтоГруппа Тогда
			ГруппаРодитель = ВозможныеРодители.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ГруппаРодитель = Неопределено Тогда
		Группа = Справочники.Контрагенты.СоздатьГруппу();
		Группа.Наименование = "Поставщики";
	КонецЕсли;

	Пока Выборка.Следующий() Цикл
		Поставщик = Выборка.Контрагент;
		Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
			ПоставщикОбъект = Справочники.Контрагенты.СоздатьЭлемент();
			ПоставщикОбъект.Родитель = ГруппаРодитель;
			ПоставщикОбъект.ИНН = Выборка.ИНН;
			ПоставщикОбъект.КПП = Выборка.КПП;
			ПоставщикОбъект.Наименование = Выборка.Наименование;
			ПоставщикОбъект.НаименованиеПолное = Выборка.ПолнНаименование;
			Если СтрДлина(Выборка.ИНН) = 12 Тогда
				ПоставщикОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;
			Иначе
				ПоставщикОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			КонецЕсли;
			ПоставщикОбъект.СтранаРегистрации = Справочники.СтраныМира.Россия;
			Попытка
				ПоставщикОбъект.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно создать поставщика ИНН/КПП " + Выборка.ИНН + "/" + Выборка.КПП + ": " + ОписаниеОшибки());  
				Продолжить;
			КонецПопытки;
			
			Поставщик = ПоставщикОбъект.Ссылка;
		КонецЕсли;	
		
		ОрганизацияЕГАИС = Выборка.ОрганизацияЕГАИС;
		Если НЕ ЗначениеЗаполнено(ОрганизацияЕГАИС) Тогда
			ОргЕГАИСОбъект = Справочники.КлассификаторОрганизацийЕГАИС.СоздатьЭлемент();
			ОргЕГАИСОбъект.Код = Выборка.КодЕГАИС;
			ОргЕГАИСОбъект.ИНН = Выборка.ИНН;
			ОргЕГАИСОбъект.КПП = Выборка.КПП;
			ОргЕГАИСОбъект.КодРегиона = Выборка.КодРегиона;
			ОргЕГАИСОбъект.КодСтраны = "643";
			ОргЕГАИСОбъект.Наименование = Выборка.НаименованиеЕГАИС;
			ОргЕГАИСОбъект.НаименованиеПолное = Выборка.ПолнНаименование;
			ОргЕГАИСОбъект.ПредставлениеАдреса = Выборка.АдресЕГАИС;
			Если СтрДлина(Выборка.ИНН) = 12 ТОГДА
				ОргЕГАИСОбъект.ТипОрганизации = Перечисления.ТипыОрганизацийЕГАИС.ИндивидуальныйПредпринимательРФ;
			Иначе
				ОргЕГАИСОбъект.ТипОрганизации = Перечисления.ТипыОрганизацийЕГАИС.ЮридическоеЛицоРФ;
			КонецЕсли;
			Попытка
				ОргЕГАИСОбъект.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно создать организацию ЕГАИС " + Выборка.КодЕГАИС + ": " + ОписаниеОшибки());  
				Продолжить;
			КонецПопытки;
			ОрганизацияЕГАИС = ОргЕГАИСОбъект.Ссылка;
		КонецЕсли;
		
		//Запись = РегистрыСведений.СоответствиеОрганизацийЕГАИС.СоздатьМенеджерЗаписи();
		//Запись.ОрганизацияЕГАИС = ОрганизацияЕГАИС;
		//Запись.Контрагент = Поставщик;
		//Запись.Записать(Истина);
					
		УстановитьПривилегированныйРежим(Истина);
		 		
		Спр = ОрганизацияЕГАИС.ПолучитьОбъект();
		Спр.СоответствуетОрганизации = ТипЗнч(Поставщик) = Тип("СправочникСсылка.Организации");
		Спр.Контрагент = Поставщик;
		Спр.ТорговыйОбъект = ?(Спр.СоответствуетОрганизации, ПараметрыСеанса.ТекущийМагазин, Неопределено);
	
		Спр.Записать();

		
	КонецЦикла;
	
	
	Для Каждого Строка Из ТаблицаПоставщиков Цикл
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьРегистрМинимальныеЦены(ПолученныеДанные)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МинимальныеЦены.НачДата,
	                      |	МинимальныеЦены.КонДата,
	                      |	МинимальныеЦены.ВидПродукции.Код,
	                      |	МинимальныеЦены.КрепостьИнтервал1,
	                      |	МинимальныеЦены.КрепостьИнтервал2,
	                      |	МинимальныеЦены.Цена
	                      |ИЗ
	                      |	РегистрСведений.МинимальныеЦены КАК МинимальныеЦены");
						  
	ТЗНач = Запрос.Выполнить().Выгрузить();
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ТЗНач, ПолученныеДанные) Тогда
		Возврат;
	КонецЕсли;
		
	ПолученныеДанные.Колонки.Добавить("ВидПродукции",Новый ОписаниеТипов("СправочникСсылка.ВидыАлкогольнойПродукции"));
	
	Для Каждого Строка Из ПолученныеДанные Цикл
		Строка.ВидПродукции = Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду(Строка.ВидПродукцииКод);
	КонецЦикла;	
	
	НаборЗаписей=РегистрыСведений.МинимальныеЦены.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ПолученныеДанные);
	НаборЗаписей.Записать();
	 		   	
КонецПроцедуры	

Процедура ЗагрузитьРегистрТрадПропускатьОшибкиЕГАИСПриПечатиЧека(ПолученныеДанные)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	традПропускатьОшибкиЕГАИСПриПечатиЧека.Ошибка КАК Ошибка
	                      |ИЗ
	                      |	РегистрСведений.традПропускатьОшибкиЕГАИСПриПечатиЧека КАК традПропускатьОшибкиЕГАИСПриПечатиЧека");
						  
	ТЗНач = Запрос.Выполнить().Выгрузить();
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ТЗНач, ПолученныеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей=РегистрыСведений.традПропускатьОшибкиЕГАИСПриПечатиЧека.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ПолученныеДанные);
	НаборЗаписей.Записать();
	 		   	
КонецПроцедуры	

Процедура ЗагрузитьРегистрТрадДниЗапретаПродажиАлкоголя(ПолученныеДанные)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТрадДниЗапретаПродажиАлкоголя.Дата КАК Дата
	                      |ИЗ
	                      |	РегистрСведений.ТрадДниЗапретаПродажиАлкоголя КАК ТрадДниЗапретаПродажиАлкоголя");
						  
	ТЗНач = Запрос.Выполнить().Выгрузить();
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ТЗНач, ПолученныеДанные) Тогда
		Возврат;
	КонецЕсли;
		
	НаборЗаписей=РегистрыСведений.ТрадДниЗапретаПродажиАлкоголя.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ПолученныеДанные);
	НаборЗаписей.Записать();
	 		   	
КонецПроцедуры	

Процедура ЗагрузитьЦены(ТаблицаЦен)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументУстановкиЦен = Документы.УстановкаЦенНоменклатуры.ПустаяСсылка();
	ТаблицаЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Для Каждого Строка Из ТаблицаЦен Цикл
		Строка.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.НоменклатураИД));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыЦен.Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыЦен.Наименование = ""Продажа""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.ИспользоватьПриПродаже
	|	И НЕ ВидыЦен.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		ВидЦены = Выборка.Ссылка;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат;
	КонецЕсли;
	
	ЦенаПродажи = Справочники.ВидыЦен.НайтиПоНаименованию("Продажа", Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таб.Номенклатура,
	|	Таб.Цена
	|ПОМЕСТИТЬ НовыеЦены
	|ИЗ
	|	&Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеЦены.Номенклатура,
	|	НовыеЦены.Цена,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК ТекущаяЦена
	|ИЗ
	|	НовыеЦены КАК НовыеЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО НовыеЦены.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ПО НовыеЦены.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	НовыеЦены.Цена <> ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)";
	
	Запрос.УстановитьПараметр("ВидЦены", ЦенаПродажи);
	Запрос.УстановитьПараметр("Таб", ТаблицаЦен);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	УстановкаЦен = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	УстановкаЦен.Дата = ТекущаяДата();
	УстановкаЦен.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	СтрокаВидов = УстановкаЦен.ВидыЦен.Добавить();
	СтрокаВидов.ВидЦены = ЦенаПродажи;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = УстановкаЦен.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.ВидЦены = ЦенаПродажи;
		НоваяСтрока.Цена = Выборка.Цена;
	КонецЦикла;
	
	Если УстановкаЦен.Товары.Количество() > 0 Тогда
		Попытка
			УстановкаЦен.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ЭтотОбъект.ДокументУстановкиЦен = УстановкаЦен.Ссылка;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуФайлыВнешнихОбработок(пФайлыВнешнихОбработок)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФайлыВнешнихОбработок.Очистить();
		
	Для Каждого Строка Из пФайлыВнешнихОбработок Цикл
		лНоваяСтрока = ФайлыВнешнихОбработок.Добавить();
		ЗаполнитьЗначенияСвойств(лНоваяСтрока,Строка);
	КонецЦикла;
	    	
КонецПроцедуры

Процедура ЗагрузитьРасширение(пФайлРасширения)

	УстановитьПривилегированныйРежим(Истина);
	
	//удаление расширений:
	Массив = РасширенияКонфигурации.Получить();
	Для Каждого Расш Из Массив Цикл
		Расш.Удалить();
	КонецЦикла;
	
	Для Каждого Строка Из пФайлРасширения Цикл
		
		//программное добавление расширения из файла:
		Расш = РасширенияКонфигурации.Создать();
		Расш.ИспользуетсяВРаспределеннойИнформационнойБазе = Ложь;
		Расш.БезопасныйРежим = Ложь;
		Попытка
			Расш.Записать(Base64Значение(Строка.Данные));
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры	   

Процедура УстановитьПарольАдминистратораТТ(ПарольАдминистратораТТ)
	УстановитьПривилегированныйРежим(Истина);

	Попытка 
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени("Администратор"); 
		ПользовательИБ.Пароль =  ПарольАдминистратораТТ; 
		ПользовательИБ.Записать();
	Исключение
	КонецПопытки;	
	
	
КонецПроцедуры	 

Процедура УстановитьФизЛицоКассира(Наименование)  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка    
		
		ФизЛицоКассира  = Справочники.ФизическиеЛица.НайтиПоНаименованию(Наименование);
		Если  НЕ ЗначениеЗаполнено(ФизЛицоКассира) Тогда
			нФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
			нФизЛицо.Наименование = Наименование; 
			нФизЛицо.Записать(); 
			
			ФизЛицоКассира = нФизЛицо.Ссылка;
			
			ЧислоВхождений = СтрЧислоВхождений(Наименование, " ");
			
			Если ЧислоВхождений = 0 Тогда
				Фамилия = Наименование;
				Имя = "";
				Отчество = "";
			ИначеЕсли ЧислоВхождений = 1 Тогда
				ПозицияСимволаПробела = Найти(Наименование, " ");
				Фамилия = Лев(Наименование, ПозицияСимволаПробела - 1);
				Имя = Сред(Наименование, ПозицияСимволаПробела + 1);
				Отчество = "";
			Иначе
				ЧислоПропусков = ЧислоВхождений - 2;
				НаименованиеВОбработке = Наименование;
				Для Индекс = 1 По ЧислоВхождений Цикл
					ПозицияСимволаПробела = Найти(НаименованиеВОбработке, " ");
					НаименованиеВОбработке = Сред(НаименованиеВОбработке, ПозицияСимволаПробела + 1);
					Если ЧислоПропусков > 0 Тогда
						ЧислоПропусков = ЧислоПропусков - 1;
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;
				ДлинаИмениИОтчества = СтрДлина(НаименованиеВОбработке);
				ДлинаНаименования   = СтрДлина(Наименование);
				ПозицияСимволаПробела = ДлинаНаименования - ДлинаИмениИОтчества;
				Фамилия     = Лев(Наименование, ПозицияСимволаПробела - 1);
				
				ПозицияСимволаПробела = Найти(НаименованиеВОбработке, " ");
				Имя      = Лев(НаименованиеВОбработке, ПозицияСимволаПробела - 1);
				Отчество = Сред(НаименованиеВОбработке, ПозицияСимволаПробела + 1)
			КонецЕсли;
						
			МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ФизЛицо = ФизЛицоКассира;
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Фамилия = Фамилия;
			МенеджерЗаписи.Имя = Имя;
			МенеджерЗаписи.Отчество = Отчество;
			МенеджерЗаписи.Записать(Истина);
				
		КонецЕсли;	   
			
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Пользователи.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Пользователи КАК Пользователи
		                      |ГДЕ
		                      |	НЕ Пользователи.ФизическоеЛицо = &ФизическоеЛицо
		                      |	И Пользователи.Наименование = &Наименование");
		
		Запрос.Параметры.Вставить("ФизическоеЛицо",ФизЛицоКассира); 
		Запрос.Параметры.Вставить("Наименование","Кассир"); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ПользовательКассир =  Выборка.Ссылка.ПолучитьОбъект();
		ПользовательКассир.ФизическоеЛицо = ФизЛицоКассира;  
		ПользовательКассир.ОбменДанными.Загрузка = Истина;
		ПользовательКассир.Записать();
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры		

Процедура УстановитьМаркерТребуетсяПроводитьСверкуДанныхСЕгаис(ТребуетсяПроводитьСверкуДанныхСЕгаис)
	УстановитьПривилегированныйРежим(Истина);
	лНастройки = Новый Соответствие;
	лНастройки.Вставить("ТребуетсяПроводитьСверкуДанныхСЕгаис",ТребуетсяПроводитьСверкуДанныхСЕгаис);
	ХранилищеОбщихНастроек.Сохранить("ТребуетсяПроводитьСверкуДанныхСЕгаис", , лНастройки, ,"Администратор");
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	

Процедура УстановитьМаркерКонтролироватьОстатокПриПроведении(КонтролироватьОстатокПриПроведении)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Отключить контроль остатков
	
	Попытка
		Запрос = Новый Запрос("ВЫБРАТЬ
	    	                  |	Пользователи.Ссылка КАК Ссылка
	        	              |ИЗ
	            	          |	Справочник.Пользователи КАК Пользователи");
	
		Результат = Запрос.Выполнить();
	
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьМенеджерЗаписи();
			Запись.Пользователь = Выборка.Ссылка;
			Запись.Право		= ПланыВидовХарактеристик.ПраваПользователей.КонтролироватьОстатокПриПроведении;
			Запись.Значение     = КонтролироватьОстатокПриПроведении;
			Запись.Записать();
		КонецЦикла;	
		          		
	Исключение
	КонецПопытки;	
		
КонецПроцедуры	

Процедура УстановитьКонстантыТрадВремяПродаж(ПолученныеДанные)  
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Попытка
		
		Если ПолученныеДанные.Свойство("ВремяНачалаПродажАлкоголя") Тогда
			Константы.ТрадВремяНачалаПродажАлкоголя.Установить(ПолученныеДанные.ВремяНачалаПродажАлкоголя);
		КонецЕсли;	
		
		Если ПолученныеДанные.Свойство("ВремяОкончанияПродажАлкоголя") Тогда
			Константы.ТрадВремяОкончанияПродажАлкоголя.Установить(ПолученныеДанные.ВремяОкончанияПродажАлкоголя);
		КонецЕсли;	
		
		Если ПолученныеДанные.Свойство("ВремяНачалаПродажНемаркируемойАлкогольнойПродукции") Тогда
			Константы.ТрадВремяНачалаПродажНемаркируемойАлкогольнойПродукции.Установить(ПолученныеДанные.ВремяНачалаПродажНемаркируемойАлкогольнойПродукции);
		КонецЕсли;
		
		Если ПолученныеДанные.Свойство("ВремяОкончанияПродажНемаркируемойАлкогольнойПродукции") Тогда
			Константы.ТрадВремяОкончанияПродажНемаркируемойАлкогольнойПродукции.Установить(ПолученныеДанные.ВремяОкончанияПродажНемаркируемойАлкогольнойПродукции);
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	
КонецПроцедуры		



#КонецОбласти


#Область ПолучениеДанных

Процедура ПолучитьДанные(Узел, СтруктураДанных)
	УстановитьПривилегированныйРежим(Истина);
	СтруктураДанных.Вставить("Поступление", ПолучитьДанныеПоступлений(Узел));
	СтруктураДанных.Вставить("ОтчетОПродажах", ПолучитьДанныеРозничныхПродаж(Узел));
	СтруктураДанных.Вставить("ПродажиЕГАИС", ПолучитьДанныеПродажЕГАИС(Узел));
	СтруктураДанных.Вставить("НепроводныеПродажиЕГАИС", ПолучитьНепроводныеПродажиЕГАИС(Узел));
	СтруктураДанных.Вставить("ВозвратПокупателя", ПолучитьДанныеВозвратовПокупателей(Узел));
	СтруктураДанных.Вставить("Корректировки", ПолучитьДанныеКорректировок(Узел));
	СтруктураДанных.Вставить("РКО", ПолучитьДанныеРКО(Узел));
	СтруктураДанных.Вставить("ПКО", ПолучитьДанныеПКО());
	СтруктураДанных.Вставить("ВозвратПоставщику", ПолучитьДанныеВозвратовПоставщику(Узел));
	СтруктураДанных.Вставить("ВерсияКонфигурации", Метаданные.Версия);
	СтруктураДанных.Вставить("ВерсияСинхронизации", СведенияОВнешнейОбработке().Версия);
	СтруктураДанных.Вставить("ОстатокПоКассеДата", НачалоДня(ТекущаяДата())  - 86400*3);
	СтруктураДанных.Вставить("ОстатокПоКассеСумма", ПолучитьОстатокПоКассеНаЧисло(НачалоДня(ТекущаяДата()) - 86400*3));
	СтруктураДанных.Вставить("ОшибкиБазыДанных", ПолучитьДанныеПоОшибкамБД(Узел));
	СтруктураДанных.Вставить("ЕГАИСВключен",ЕГАИСВключен());
	СтруктураДанных.Вставить("ЭтоКафе",ЭтоКафе());
	
	//Отключено
	//СтруктураДанных.Вставить("ТрадВремяНачалаРаботы",ТрадВремяНачалаПродажАлкоголя());
	//СтруктураДанных.Вставить("ТрадВремяОкончанияРаботы",ТрадВремяОкончанияПродажАлкоголя());
	//Отключено
	
	СтруктураДанных.Вставить("ТрадВремяНачалаПродажАлкоголя",ТрадВремяНачалаПродажАлкоголя());
	СтруктураДанных.Вставить("ТрадВремяОкончанияПродажАлкоголя",ТрадВремяОкончанияПродажАлкоголя());
	СтруктураДанных.Вставить("ТрадВремяНачалаПродажНемаркируемойАлкогольнойПродукции",ТрадВремяНачалаПродажНемаркируемойАлкогольнойПродукции());
	СтруктураДанных.Вставить("ТрадВремяОкончанияПродажНемаркируемойАлкогольнойПродукции",ТрадВремяОкончанияПродажНемаркируемойАлкогольнойПродукции());
	
	СтруктураДанных.Вставить("ТаблицаАкцизныхМарокЕГАИС"		,ПолучитьТаблицуАкцизныхМарокЕГАИС());
	СтруктураДанных.Вставить("КоличествоНоменклатуры"			,ПолучитьКоличествоНоменклатуры());
	СтруктураДанных.Вставить("ДополнительныеОтчетыИОбработки"	,ПолучитьСписокВнешнихОтчетовИОброботок());
	СтруктураДанных.Вставить("Расширения"						,ПолучитьСписокРасширений());
	
	//Отключено
	//СтруктураДанных.Вставить("ОстаткиЕГАИС"					,ПолучитьОстаткиЕГАИС());
	//СтруктураДанных.Вставить("ДанныеУТМ"						,ПолучитьДанныеУТМ());
	//СтруктураДанных.Вставить("TeamViewerID"					,ПолучитьTeamViewerID());
	//Отключено
	
	СтруктураДанных.Вставить("ДатаПоследнейКопии"				,ПолучитьДатуПоследнейКопии()); 
	СтруктураДанных.Вставить("ФизЛицоКассира"					,ПолучитьФизЛицоКассира());
	
	
	Попытка
		СтруктураДанных.Вставить("ДанныеСверкиСРозничнымиТочкамиТрадиция"				,СформироватьДанныеСверкиСРозничнымиТочкамиТрадицияКонецВчерашнегоДня()); 
	Исключение
	КонецПопытки;	
	   	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


Функция ПолучитьДанныеПоступлений(Узел)
	ТаблицаПоступлений = Новый ТаблицаЗначений;
	ТаблицаПоступлений.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаПоступлений.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаПоступлений.Колонки.Добавить("СсылкаПриемник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаПоступлений.Колонки.Добавить("ПоставщикИНН", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
	ТаблицаПоступлений.Колонки.Добавить("ПоставщикКПП", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(9)));
	ТаблицаПоступлений.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаПоступлений.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблицаПоступлений.Колонки.Добавить("НомерВх", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(30)));
	ТаблицаПоступлений.Колонки.Добавить("ДатаВх", Новый ОписаниеТипов("Дата"));
	ТаблицаПоступлений.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаПоступлений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаПоступлений.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаПоступлений.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаПоступлений.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаПоступлений.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровТовары.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровТовары.Ссылка.Контрагент.ИНН КАК ПоставщикИНН,
	               |	ПоступлениеТоваровТовары.Ссылка.Контрагент.КПП КАК ПоставщикКПП,
	               |	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровТовары.Количество КАК Количество,
	               |	ПоступлениеТоваровТовары.Цена КАК Цена,
	               |	ПоступлениеТоваровТовары.Сумма КАК Сумма,
	               |	ПоступлениеТоваровТовары.Ссылка.ДатаВходящегоДокумента КАК ДатаВх,
	               |	ПоступлениеТоваровТовары.Ссылка.НомерВходящегоДокумента КАК НомерВх,
	               |	ПоступлениеТоваровТовары.Ссылка.Дата КАК Дата,
	               |	ПоступлениеТоваровТовары.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """") КАК СсылкаПриемник,
	               |	""Документ.ПоступлениеТоваров"" КАК ТипСсылки,
	               |	ПоступлениеТоваровТовары.Ссылка.Проведен КАК Проведен,
	               |	ПоступлениеТоваровТовары.Ссылка.Номер КАК Номер
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров.Изменения КАК ПоступлениеТоваровИзменения
	               |		ПО ПоступлениеТоваровТовары.Ссылка = ПоступлениеТоваровИзменения.Ссылка
	               |			И (ПоступлениеТоваровИзменения.Узел = &Узел)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |		ПО ПоступлениеТоваровТовары.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	               |			И (СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &Узел)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка,
	               |	НомерСтроки";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПоступлений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка, Номенклатура");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		НоваяСтрока.Номенклатура = Строка(Выборка.Номенклатура.УникальныйИдентификатор());
	КонецЦикла;
	
	Возврат ТаблицаПоступлений;
КонецФункции

Функция ПолучитьДанныеРозничныхПродаж(Узел)
	ТаблицаПродаж = Новый ТаблицаЗначений;
	ТаблицаПродаж.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаПродаж.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаПродаж.Колонки.Добавить("СсылкаПриемник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаПродаж.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаПродаж.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблицаПродаж.Колонки.Добавить("СуммаДокумента", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("СуммаВозвратов", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("СуммаБезнал", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("ЭтоВозврат", Новый ОписаниеТипов("Булево"));
	ТаблицаПродаж.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаПродаж.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("КоличествоМарок", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("Строка"));
	ТаблицаПродаж.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
	ТаблицаПродаж.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахИзменения.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.СуммаВозвратов КАК СуммаВозвратов,
	|	СУММА(ЕСТЬNULL(ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма, 0)) КАК СуммаБезнал,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.Дата КАК Дата,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.Номер КАК Номер,
	|	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """") КАК СсылкаПриемник,
	|	""Документ.ОтчетОРозничныхПродажах"" КАК ТипСсылки,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.Проведен КАК Проведен
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Изменения КАК ОтчетОРозничныхПродажахИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ОтчетОРозничныхПродажахОплатаПлатежнымиКартами
	|		ПО ОтчетОРозничныхПродажахИзменения.Ссылка = ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка
	|			И (ОтчетОРозничныхПродажахИзменения.Узел = &Узел)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	|		ПО ОтчетОРозничныхПродажахИзменения.Узел = СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы
	|			И ОтчетОРозничныхПродажахИзменения.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """"),
	|	ОтчетОРозничныхПродажахИзменения.Ссылка,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.СуммаДокумента,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.СуммаВозвратов,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.Дата,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.Номер,
	|	ОтчетОРозничныхПродажахИзменения.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМТовары.Ссылка.ОтчетОРозничныхПродажах,
	|	ЧекККМТовары.Ссылка.ВидОперации,
	|	ЧекККМТовары.Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧекККМАкцизныеМарки.КодАкцизнойМарки) КАК КоличествоМарок,
	|	ЧекККМТовары.Ссылка
	|ПОМЕСТИТЬ ДанныеЧеков
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
	|			ПО ЧекККМТовары.Ссылка = ЧекККМАкцизныеМарки.Ссылка
	|				И ЧекККМТовары.КлючСвязи = ЧекККМАкцизныеМарки.КлючСвязи
	|		ПО ДанныеДокумента.Ссылка = ЧекККМТовары.Ссылка.ОтчетОРозничныхПродажах
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМТовары.Номенклатура,
	|	ЧекККМТовары.Ссылка.ВидОперации,
	|	ЧекККМТовары.Ссылка.ОтчетОРозничныхПродажах,
	|	ЧекККМТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ОтчетТовары.НомерСтроки КАК НомерСтроки,
	|	ОтчетТовары.Номенклатура,
	|	ОтчетТовары.Характеристика,
	|	ОтчетТовары.Количество,
	|	ЕСТЬNULL(Марки.КоличествоМарок, 0) КАК КоличествоМарок,
	|	ДанныеДокумента.СуммаДокумента,
	|	ДанныеДокумента.СуммаВозвратов,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ВЫБОР
	|		КОГДА ОтчетТовары.Количество = 0
	|			ТОГДА ОтчетТовары.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ОтчетТовары.Сумма / ОтчетТовары.Количество КАК ЧИСЛО(10, 2))
	|	КОНЕЦ КАК Цена,
	|	ОтчетТовары.Сумма КАК Сумма,
	|	ОтчетТовары.СтавкаНДС,
	|	ОтчетТовары.СуммаНДС,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.СсылкаПриемник КАК СсылкаПриемник,
	|	ДанныеДокумента.ТипСсылки КАК ТипСсылки,
	|	ДанныеДокумента.Проведен,
	|	ДанныеДокумента.СуммаБезнал
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтчетОРозничныхПродажахТовары.Ссылка КАК Ссылка,
	|			ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
	|			ОтчетОРозничныхПродажахТовары.Характеристика КАК Характеристика,
	|			СУММА(ОтчетОРозничныхПродажахТовары.Количество) КАК Количество,
	|			СУММА(ОтчетОРозничныхПродажахТовары.Сумма) КАК Сумма,
	|			ОтчетОРозничныхПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|			СУММА(ОтчетОРозничныхПродажахТовары.СуммаНДС) КАК СуммаНДС,
	|			МИНИМУМ(ОтчетОРозничныхПродажахТовары.НомерСтроки) КАК НомерСтроки
	|		ИЗ
	|			Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтчетОРозничныхПродажахТовары.Ссылка,
	|			ОтчетОРозничныхПродажахТовары.Номенклатура,
	|			ОтчетОРозничныхПродажахТовары.СтавкаНДС,
	|			ОтчетОРозничныхПродажахТовары.Характеристика) КАК ОтчетТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ДанныеЧеков.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах,
	|				ДанныеЧеков.Номенклатура КАК Номенклатура,
	|				СУММА(ВЫБОР
	|						КОГДА ДанныеЧеков.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|							ТОГДА -ДанныеЧеков.КоличествоМарок
	|						ИНАЧЕ ДанныеЧеков.КоличествоМарок
	|					КОНЕЦ) КАК КоличествоМарок
	|			ИЗ
	|				ДанныеЧеков КАК ДанныеЧеков
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДанныеЧеков.ОтчетОРозничныхПродажах,
	|				ДанныеЧеков.Номенклатура) КАК Марки
	|			ПО ОтчетТовары.Ссылка = Марки.ОтчетОРозничныхПродажах
	|				И ОтчетТовары.Номенклатура = Марки.Номенклатура
	|		ПО ДанныеДокумента.Ссылка = ОтчетТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ВозвращенныеТовары.НомерСтроки,
	|	ВозвращенныеТовары.Номенклатура,
	|	ВозвращенныеТовары.Характеристика,
	|	ВозвращенныеТовары.Количество,
	|	ЕСТЬNULL(Марки.КоличествоМарок, 0),
	|	ДанныеДокумента.СуммаДокумента,
	|	ДанныеДокумента.СуммаВозвратов,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА ВозвращенныеТовары.Количество = 0
	|			ТОГДА ВозвращенныеТовары.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ВозвращенныеТовары.Сумма / ВозвращенныеТовары.Количество КАК ЧИСЛО(10, 2))
	|	КОНЕЦ,
	|	ВозвращенныеТовары.Сумма,
	|	ВозвращенныеТовары.СтавкаНДС,
	|	ВозвращенныеТовары.СуммаНДС,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.СсылкаПриемник,
	|	ДанныеДокумента.ТипСсылки,
	|	ДанныеДокумента.Проведен,
	|	ДанныеДокумента.СуммаБезнал
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтчетОРозничныхПродажахВозвращенныеТовары.Ссылка КАК Ссылка,
	|			ОтчетОРозничныхПродажахВозвращенныеТовары.Номенклатура КАК Номенклатура,
	|			МИНИМУМ(ОтчетОРозничныхПродажахВозвращенныеТовары.НомерСтроки) КАК НомерСтроки,
	|			СУММА(ОтчетОРозничныхПродажахВозвращенныеТовары.Количество) КАК Количество,
	|			ОтчетОРозничныхПродажахВозвращенныеТовары.Характеристика КАК Характеристика,
	|			СУММА(ОтчетОРозничныхПродажахВозвращенныеТовары.Сумма) КАК Сумма,
	|			ОтчетОРозничныхПродажахВозвращенныеТовары.СтавкаНДС КАК СтавкаНДС,
	|			СУММА(ОтчетОРозничныхПродажахВозвращенныеТовары.СуммаНДС) КАК СуммаНДС
	|		ИЗ
	|			Документ.ОтчетОРозничныхПродажах.ВозвращенныеТовары КАК ОтчетОРозничныхПродажахВозвращенныеТовары
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОтчетОРозничныхПродажахВозвращенныеТовары.Номенклатура,
	|			ОтчетОРозничныхПродажахВозвращенныеТовары.Характеристика,
	|			ОтчетОРозничныхПродажахВозвращенныеТовары.Ссылка,
	|			ОтчетОРозничныхПродажахВозвращенныеТовары.СтавкаНДС) КАК ВозвращенныеТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ДанныеЧеков.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах,
	|				ДанныеЧеков.Номенклатура КАК Номенклатура,
	|				СУММА(ДанныеЧеков.КоличествоМарок) КАК КоличествоМарок
	|			ИЗ
	|				ДанныеЧеков КАК ДанныеЧеков
	|			ГДЕ
	|				ДанныеЧеков.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДанныеЧеков.ОтчетОРозничныхПродажах,
	|				ДанныеЧеков.Номенклатура) КАК Марки
	|			ПО ВозвращенныеТовары.Ссылка = Марки.ОтчетОРозничныхПродажах
	|				И ВозвращенныеТовары.Номенклатура = Марки.Номенклатура
	|		ПО ДанныеДокумента.Ссылка = ВозвращенныеТовары.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ЭтоВозврат,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = ТаблицаПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка, Номенклатура, СтавкаНДС");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		НоваяСтрока.Номенклатура = Строка(Выборка.Номенклатура.УникальныйИдентификатор());
		Попытка
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка().Метаданные().ЗначенияПеречисления[Перечисления.СтавкиНДС.Индекс(Выборка.СтавкаНДС)].Имя;
		Исключение
			НоваяСтрока.СтавкаНДС = "БезНДС";
		КонецПопытки;
	КонецЦикла;
	
	Возврат ТаблицаПродаж;
КонецФункции

Функция ПолучитьДанныеПродажЕГАИС(Узел)
	ТаблицаЧеков = Новый ТаблицаЗначений;
	ТаблицаЧеков.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаЧеков.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаЧеков.Колонки.Добавить("ЧекККМ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаЧеков.Колонки.Добавить("Возврат", Новый ОписаниеТипов("Булево"));
	ТаблицаЧеков.Колонки.Добавить("АдресЧекаЕГАИС", Новый ОписаниеТипов("Строка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахИзменения.Ссылка,
	|	""Документ.ОтчетОРозничныхПродажах"" КАК ТипСсылки,
	|	ЧекККМ.АдресЧекаЕГАИС,
	|	ВЫБОР
	|		КОГДА ЧекККМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Возврат,
	|	ПРЕДСТАВЛЕНИЕ(ЧекККМ.Ссылка) КАК ЧекККМ
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Изменения КАК ОтчетОРозничныхПродажахИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
	|		ПО ОтчетОРозничныхПродажахИзменения.Ссылка = ЧекККМ.ОтчетОРозничныхПродажах
	|			И (ОтчетОРозничныхПродажахИзменения.Узел = &Узел)";
	
	Запрос.УстановитьПараметр("Узел", Узел);      
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.АдресЧекаЕГАИС) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЧеков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
	
	Возврат ТаблицаЧеков;
КонецФункции

Функция ПолучитьНепроводныеПродажиЕГАИС(Узел)
	ТаблицаЧеков = Новый ТаблицаЗначений;
	ТаблицаЧеков.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаЧеков.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаЧеков.Колонки.Добавить("ЧекККМ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаЧеков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаЧеков.Колонки.Добавить("АкцизнаяМарка", Новый ОписаниеТипов("Строка"));
	ТаблицаЧеков.Колонки.Добавить("Информация", Новый ОписаниеТипов("Строка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтчетОРозничныхПродажахИзменения.Ссылка КАК Ссылка,
	               |	""Документ.ОтчетОРозничныхПродажах"" КАК ТипСсылки,
	               |	ПРЕДСТАВЛЕНИЕ(ЧекККМАкцизныеМарки.Ссылка) КАК ЧекККМ,
	               |	ЧекККМАкцизныеМарки.КодАкцизнойМарки КАК АкцизнаяМарка,
	               |	ЧекККМАкцизныеМарки.АкцизнаяМарка.Номенклатура КАК Номенклатура,
	               |	ЧекККМАкцизныеМарки.Ссылка.традОшибкаЕГАИС КАК Информация
	               |ИЗ
	               |	Документ.ОтчетОРозничныхПродажах.Изменения КАК ОтчетОРозничныхПродажахИзменения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
	               |		ПО ОтчетОРозничныхПродажахИзменения.Ссылка = ЧекККМАкцизныеМарки.Ссылка.ОтчетОРозничныхПродажах
	               |			И (ОтчетОРозничныхПродажахИзменения.Узел = &Узел)";
	
	Запрос.УстановитьПараметр("Узел", Узел);      
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.АкцизнаяМарка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;	
				
		НоваяСтрока = ТаблицаЧеков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		НоваяСтрока.Номенклатура = Строка(Выборка.Номенклатура.УникальныйИдентификатор());
	КонецЦикла;
	
	Возврат ТаблицаЧеков;
КонецФункции

Функция ПолучитьДанныеКорректировок(Узел)
	ТаблицаКорректировок = Новый ТаблицаЗначений;
	ТаблицаКорректировок.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаКорректировок.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаКорректировок.Колонки.Добавить("СсылкаПриемник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаКорректировок.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаКорректировок.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблицаКорректировок.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаКорректировок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаКорректировок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаКорректировок.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаКорректировок.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОприходованиеТоваровТовары.Ссылка КАК Ссылка,
	               |	ОприходованиеТоваровТовары.Номенклатура КАК Номенклатура,
	               |	ОприходованиеТоваровТовары.Количество,
	               |	ОприходованиеТоваровТовары.Цена,
	               |	ОприходованиеТоваровТовары.Ссылка.Дата,
	               |	ОприходованиеТоваровТовары.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """") КАК СсылкаПриемник,
	               |	""Документ.ОприходованиеТоваров"" КАК ТипСсылки,
	               |	ОприходованиеТоваровТовары.Ссылка.Проведен,
	               |	ОприходованиеТоваровТовары.Ссылка.Номер КАК Номер
	               |ИЗ
	               |	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОприходованиеТоваров.Изменения КАК ОприходованиеТоваровИзменения
	               |		ПО ОприходованиеТоваровТовары.Ссылка = ОприходованиеТоваровИзменения.Ссылка
	               |			И (ОприходованиеТоваровИзменения.Узел = &Узел)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |		ПО ОприходованиеТоваровТовары.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	               |			И (СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &Узел)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СписаниеТоваровТовары.Ссылка,
	               |	СписаниеТоваровТовары.Номенклатура,
	               |	-СписаниеТоваровТовары.Количество,
	               |	СписаниеТоваровТовары.Цена,
	               |	СписаниеТоваровТовары.Ссылка.Дата,
	               |	СписаниеТоваровТовары.НомерСтроки,
	               |	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """"),
	               |	""Документ.СписаниеТоваров"",
	               |	СписаниеТоваровТовары.Ссылка.Проведен,
	               |	СписаниеТоваровТовары.Ссылка.Номер
	               |ИЗ
	               |	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТоваров.Изменения КАК СписаниеТоваровИзменения
	               |		ПО СписаниеТоваровТовары.Ссылка = СписаниеТоваровИзменения.Ссылка
	               |			И (СписаниеТоваровИзменения.Узел = &Узел)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |		ПО СписаниеТоваровТовары.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	               |			И (СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &Узел)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПересортицаТоваровТовары.Ссылка,
	               |	ПересортицаТоваровТовары.НоменклатураОприходование,
	               |	ПересортицаТоваровТовары.Количество,
	               |	ПересортицаТоваровТовары.Цена,
	               |	ПересортицаТоваровТовары.Ссылка.Дата,
	               |	ПересортицаТоваровТовары.НомерСтроки * 2 - 1,
	               |	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """"),
	               |	""Документ.ПересортицаТоваров"",
	               |	ПересортицаТоваровТовары.Ссылка.Проведен,
	               |	ПересортицаТоваровТовары.Ссылка.Номер
	               |ИЗ
	               |	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПересортицаТоваров.Изменения КАК ПересортицаТоваровИзменения
	               |		ПО ПересортицаТоваровТовары.Ссылка = ПересортицаТоваровИзменения.Ссылка
	               |			И (ПересортицаТоваровИзменения.Узел = &Узел)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |		ПО ПересортицаТоваровТовары.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	               |			И (СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &Узел)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПересортицаТоваровТовары.Ссылка,
	               |	ПересортицаТоваровТовары.Номенклатура,
	               |	-ПересортицаТоваровТовары.Количество,
	               |	ПересортицаТоваровТовары.Цена,
	               |	ПересортицаТоваровТовары.Ссылка.Дата,
	               |	ПересортицаТоваровТовары.НомерСтроки * 2,
	               |	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """"),
	               |	""Документ.ПересортицаТоваров"",
	               |	ПересортицаТоваровТовары.Ссылка.Проведен,
	               |	ПересортицаТоваровТовары.Ссылка.Номер
	               |ИЗ
	               |	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПересортицаТоваров.Изменения КАК ПересортицаТоваровИзменения
	               |		ПО ПересортицаТоваровТовары.Ссылка = ПересортицаТоваровИзменения.Ссылка
	               |			И (ПересортицаТоваровИзменения.Узел = &Узел)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |		ПО ПересортицаТоваровТовары.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	               |			И (СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &Узел)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка,
	               |	НомерСтроки";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаКорректировок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка, Номенклатура");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		НоваяСтрока.Номенклатура = Строка(Выборка.Номенклатура.УникальныйИдентификатор());
	КонецЦикла;
	
	Возврат ТаблицаКорректировок;
КонецФункции

Функция ПолучитьДанныеРКО(Узел)
	ТаблицаРКО = Новый ТаблицаЗначений;
	ТаблицаРКО.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаРКО.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаРКО.Колонки.Добавить("СсылкаПриемник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаРКО.Колонки.Добавить("ПоставщикИНН", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
	ТаблицаРКО.Колонки.Добавить("ПоставщикКПП", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(9)));
	ТаблицаРКО.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаРКО.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблицаРКО.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	ТаблицаРКО.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаРКО.Колонки.Добавить("Основание", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250)));
	ТаблицаРКО.Колонки.Добавить("Выдать", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250)));
	ТаблицаРКО.Колонки.Добавить("ПоДокументу", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250)));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	""Документ.РасходныйКассовыйОрдер"" КАК ТипСсылки,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка КАК Ссылка,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Дата КАК Дата,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Номер КАК Номер,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Контрагент.ИНН КАК ПоставщикИНН,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Контрагент.КПП КАК ПоставщикКПП,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Основание КАК Основание,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Выдать КАК Выдать,
	               |	ВЫРАЗИТЬ(РасходныйКассовыйОрдерИзменения.Ссылка.Комментарий КАК СТРОКА(150)) КАК Комментарий,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.СуммаДокумента КАК Сумма,
	               |	МАКСИМУМ(ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """")) КАК СсылкаПриемник,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.ПоДокументу КАК ПоДокументу,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Проведен КАК Проведен
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер.Изменения КАК РасходныйКассовыйОрдерИзменения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |		ПО РасходныйКассовыйОрдерИзменения.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	               |			И РасходныйКассовыйОрдерИзменения.Узел = СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы
	               |ГДЕ
	               |	РасходныйКассовыйОрдерИзменения.Узел = &Узел
	               |	И РасходныйКассовыйОрдерИзменения.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходныйКассовыйОрдерИзменения.Ссылка,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Дата,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Контрагент.ИНН,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Контрагент.КПП,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Основание,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.СуммаДокумента,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.ПоДокументу,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Проведен,
	               |	ВЫРАЗИТЬ(РасходныйКассовыйОрдерИзменения.Ссылка.Комментарий КАК СТРОКА(150)),
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Номер,
	               |	РасходныйКассовыйОрдерИзменения.Ссылка.Выдать";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРКО.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
	
	Возврат ТаблицаРКО;
КонецФункции

Функция ПолучитьДанныеПКО()
	ТаблицаПКО = Новый ТаблицаЗначений;
	ТаблицаПКО.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаПКО.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаПКО.Колонки.Добавить("СсылкаПриемник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаПКО.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаПКО.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблицаПКО.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	ТаблицаПКО.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаПКО.Колонки.Добавить("Основание", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250)));
	ТаблицаПКО.Колонки.Добавить("ПринятоОт", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250)));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	""Документ.ПриходныйКассовыйОрдер"" КАК ТипСсылки,
	               |	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
	               |	ПриходныйКассовыйОрдер.Ссылка.Дата КАК Дата,
	               |	ПриходныйКассовыйОрдер.Ссылка.Номер КАК Номер,
	               |	ПриходныйКассовыйОрдер.Ссылка.Основание КАК Основание,
	               |	ПриходныйКассовыйОрдер.Ссылка.СуммаДокумента КАК Сумма,
	               |	МАКСИМУМ(ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """")) КАК СсылкаПриемник,
	               |	ПриходныйКассовыйОрдер.Ссылка.Проведен КАК Проведен,
	               |	ПриходныйКассовыйОрдер.Ссылка.ПринятоОт
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.Изменения КАК ПриходныйКассовыйОрдер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |		ПО ПриходныйКассовыйОрдер.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеДоходы)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходныйКассовыйОрдер.Ссылка,
	               |	ПриходныйКассовыйОрдер.Ссылка.Дата,
	               |	ПриходныйКассовыйОрдер.Ссылка.Основание,
	               |	ПриходныйКассовыйОрдер.Ссылка.СуммаДокумента,
	               |	ПриходныйКассовыйОрдер.Ссылка.Проведен,
	               |	ПриходныйКассовыйОрдер.Ссылка.Номер";
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПКО.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
	КонецЦикла;
	
	Возврат ТаблицаПКО;
	
КонецФункции

Функция ПолучитьДанныеВозвратовПокупателей(Узел)
	ТаблицаВозвратов = Новый ТаблицаЗначений;
	ТаблицаВозвратов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаВозвратов.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаВозвратов.Колонки.Добавить("СсылкаПриемник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаВозвратов.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаВозвратов.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблицаВозвратов.Колонки.Добавить("ЧекДата", Новый ОписаниеТипов("Дата"));
	ТаблицаВозвратов.Колонки.Добавить("ЧекНомер", Новый ОписаниеТипов("Строка"));
	ТаблицаВозвратов.Колонки.Добавить("СуммаДокумента", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаВозвратов.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("ОтчетОРПИсточник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаВозвратов.Колонки.Добавить("ОтчетОРППриемник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаВозвратов.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("Строка"));
	ТаблицаВозвратов.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка КАК Ссылка,
	|	ВозвратТоваровОтПокупателяТовары.НомерСтроки КАК НомерСтроки,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Количество,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаДокумента,
	|	ВозвратТоваровОтПокупателяТовары.Цена КАК Цена,
	|	ВозвратТоваровОтПокупателяТовары.Сумма КАК Сумма,
	|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	|	ВозвратТоваровОтПокупателяТовары.СуммаНДС,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Номер,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.ЧекДата,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.ЧекНомер,
	|	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """") КАК СсылкаПриемник,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен,
	|	""Документ.ВозвратТоваровОтПокупателя"" КАК ТипСсылки,
	|	ВозвратТоваровОтПокупателяТовары.ДокументПродажи,
	|	ЕСТЬNULL(СоответствияОбъектовДокПродажи.УникальныйИдентификаторПриемника, """") КАК ОтчетОРППриемник
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Изменения КАК ВозвратТоваровОтПокупателяИзменения
	|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = ВозвратТоваровОтПокупателяИзменения.Ссылка
	|			И (ВозвратТоваровОтПокупателяИзменения.Узел = &Узел)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	|			И (СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &Узел)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовДокПродажи
	|		ПО ВозвратТоваровОтПокупателяТовары.ДокументПродажи = СоответствияОбъектовДокПродажи.УникальныйИдентификаторИсточника
	|			И (СоответствияОбъектовДокПродажи.УзелИнформационнойБазы = &Узел)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаВозвратов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка, Номенклатура, СтавкаНДС");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		НоваяСтрока.Номенклатура = Строка(Выборка.Номенклатура.УникальныйИдентификатор());
		Если ЗначениеЗаполнено(Выборка.СтавкаНДС) Тогда
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка().Метаданные().ЗначенияПеречисления[Перечисления.СтавкиНДС.Индекс(Выборка.СтавкаНДС)].Имя;
		Иначе
			НоваяСтрока.СтавкаНДС = "БезНДС";
		КонецЕсли;
		НоваяСтрока.ОтчетОРПИсточник = Строка(Выборка.ДокументПродажи.УникальныйИдентификатор());
	КонецЦикла;
	
	Возврат ТаблицаВозвратов;
КонецФункции

Функция ПолучитьДанныеВозвратовПоставщику(Узел)
	ТаблицаВозвратов = Новый ТаблицаЗначений;
	ТаблицаВозвратов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаВозвратов.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаВозвратов.Колонки.Добавить("СсылкаПриемник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаВозвратов.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаВозвратов.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	ТаблицаВозвратов.Колонки.Добавить("ПоставщикИНН", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));
	ТаблицаВозвратов.Колонки.Добавить("ПоставщикКПП", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(9)));
	ТаблицаВозвратов.Колонки.Добавить("ДатаВхТТН", Новый ОписаниеТипов("Дата"));
	ТаблицаВозвратов.Колонки.Добавить("НомерВхТТН", Новый ОписаниеТипов("Строка"));
	ТаблицаВозвратов.Колонки.Добавить("ТТН_ЕГАИС", Новый ОписаниеТипов("Строка"));
	ТаблицаВозвратов.Колонки.Добавить("СтатусТТН_ЕГАИС", Новый ОписаниеТипов("Строка"));
	ТаблицаВозвратов.Колонки.Добавить("СделкаЗавершена", Новый ОписаниеТипов("Булево"));
	ТаблицаВозвратов.Колонки.Добавить("СуммаДокумента", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаВозвратов.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("Строка"));
	ТаблицаВозвратов.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
	ТаблицаВозвратов.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВозвратТоваровПоставщикуТовары.Ссылка КАК Ссылка,
	               |	ВозвратТоваровПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	               |	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	ВозвратТоваровПоставщикуТовары.Количество КАК Количество,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.СуммаДокумента КАК СуммаДокумента,
	               |	ВозвратТоваровПоставщикуТовары.Цена КАК Цена,
	               |	ВозвратТоваровПоставщикуТовары.Сумма КАК Сумма,
	               |	ВозвратТоваровПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ВозвратТоваровПоставщикуТовары.СуммаНДС КАК СуммаНДС,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.Дата КАК Дата,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.Номер КАК Номер,
	               |	ЕСТЬNULL(СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника, """") КАК СсылкаПриемник,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.Проведен КАК Проведен,
	               |	""Документ.ВозвратТоваровПоставщику"" КАК ТипСсылки,
	               |	"""" КАК СтатусТТН_ЕГАИС,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка.ТТНИсходящаяЕГАИС.ИдентификаторЕГАИС, """") КАК ТТН_ЕГАИС,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка.ДокументОснование.НомерВходящегоДокумента, """") КАК НомерВхТТН,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка.ДокументОснование.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВхТТН,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент.ИНН, """") КАК ПоставщикИНН,
	               |	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент.КПП, """") КАК ПоставщикКПП,
	               |	ИСТИНА КАК СделкаЗавершена
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Изменения КАК ВозвратТоваровПоставщикуИзменения
	               |		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ВозвратТоваровПоставщикуИзменения.Ссылка
	               |			И (ВозвратТоваровПоставщикуИзменения.Узел = &Узел)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |		ПО ВозвратТоваровПоставщикуТовары.Ссылка = СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	               |			И (СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы = &Узел)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка,
	               |	НомерСтроки";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаВозвратов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, , "Ссылка, Номенклатура, СтавкаНДС");
		НоваяСтрока.Ссылка = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		НоваяСтрока.Номенклатура = Строка(Выборка.Номенклатура.УникальныйИдентификатор());
		Если ЗначениеЗаполнено(Выборка.СтавкаНДС) Тогда
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка().Метаданные().ЗначенияПеречисления[Перечисления.СтавкиНДС.Индекс(Выборка.СтавкаНДС)].Имя;
		Иначе
			НоваяСтрока.СтавкаНДС = "БезНДС";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаВозвратов;
КонецФункции

Функция ПолучитьОстатокПоКассеНаЧисло(пДата)
	 	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ДС.СуммаОстаток) КАК СуммаОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(&Дата, ) КАК ДС");
						  
				  
						  
	Запрос.Параметры.Вставить("Дата",пДата);					  
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе	
		Выборка  = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.СуммаОстаток;		
	КонецЕсли;
	       	
КонецФункции	

Функция ПолучитьДанныеПоОшибкамБД(Узел)
	
	лКассаККМ = Справочники.КассыККМ.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассыККМ.Ссылка
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	НЕ КассыККМ.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("", );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		лКассаККМ = Выборка.Ссылка;
	КонецЕсли;
	  	  	
	ТаблицаОшибокБД = Новый ТаблицаЗначений;
	ТаблицаОшибокБД.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТаблицаОшибокБД.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаОшибокБД.Колонки.Добавить("ПредставлениеОбъекта", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаОшибокБД.Колонки.Добавить("Ошибка", Новый ОписаниеТипов("Строка"));
	ТаблицаОшибокБД.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка"));
	ТаблицаОшибокБД.Колонки.Добавить("ДатаСобытия", Новый ОписаниеТипов("Дата"));
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ДатаПозавчера",НачалоДня(ТекущаяДата() - 86400*2));
	Запрос.Параметры.Вставить("ДатаВчера",НачалоДня(ТекущаяДата() - 86400));
	Запрос.Параметры.Вставить("Дата",НачалоДня(ТекущаяДата() - 86400*30));
	Запрос.Параметры.Вставить("ПустаяДата",Дата(1,1,1));
	Запрос.Параметры.Вставить("КассаККМ",лКассаККМ);
	Запрос.УстановитьПараметр("Узел", Узел);
    Запрос.УстановитьПараметр("Ответственный", Справочники.Пользователи.Автомат);
	
	//Передача в регистр 2
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПередачаВРегистр2ЕГАИС.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ табПередачаВРегистр2
	               |ИЗ
	               |	Документ.ПередачаВРегистр2ЕГАИС КАК ПередачаВРегистр2ЕГАИС
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	               |		ПО ПередачаВРегистр2ЕГАИС.Ссылка = СтатусыДокументовЕГАИС.Документ
	               |ГДЕ
	               |	ПередачаВРегистр2ЕГАИС.Дата >= &ДатаВчера
	               |	И ПередачаВРегистр2ЕГАИС.Проведен
	               |	И (СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиПередачиВРегистр2ЕГАИС.ОшибкаПередачи)
	               |			ИЛИ СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиПередачиВРегистр2ЕГАИС.ОшибкаПроведенияЕГАИС))
	               |	И ПередачаВРегистр2ЕГАИС.Ответственный = &Ответственный
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕГАИСПрисоединенныеФайлы.Документ КАК Документ,
	               |	ЕГАИСПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	               |	ЕГАИСПрисоединенныеФайлы.Ссылка КАК ЕГАИСПрисоединенныеФайлыСсылка
	               |ПОМЕСТИТЬ табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы
	               |ИЗ
	               |	табПередачаВРегистр2 КАК табПередачаВРегистр2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕГАИСПрисоединенныеФайлы КАК ЕГАИСПрисоединенныеФайлы
	               |		ПО табПередачаВРегистр2.Ссылка = ЕГАИСПрисоединенныеФайлы.Документ
	               |ГДЕ
	               |	ЕГАИСПрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыЗапросовИС.Входящий)
	               |	И ЕГАИСПрисоединенныеФайлы.Операция = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЕГАИС.КвитанцияПроведенЕГАИС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Документ.ПередачаВРегистр2ЕГАИС"" КАК ТипСсылки,
	               |	табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.Документ КАК Ссылка,
	               |	табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.Документ.Представление КАК ПредставлениеОбъекта,
	               |	""Ошибка передачи в ЕГАИС"" КАК Ошибка,
	               |	табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.Документ.Дата КАК ДатаСобытия,
	               |	табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.ЕГАИСПрисоединенныеФайлыСсылка.Описание КАК ОписаниеОшибки
	               |ИЗ
	               |	табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы КАК табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.Документ КАК Документ,
	               |			МАКСИМУМ(табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.ДатаСоздания) КАК ДатаСоздания
	               |		ИЗ
	               |			табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы КАК табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.Документ) КАК ЕГАИСДатыПоследнихСообщений
	               |		ПО табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.Документ = ЕГАИСДатыПоследнихСообщений.Документ
	               |			И табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы.ДатаСоздания = ЕГАИСДатыПоследнихСообщений.ДатаСоздания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ табПередачаВРегистр2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ табПередачаВРегистр2ЕГАИСПрисоединенныеФайлы";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаОшибокБД.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УникальныйИдентификатор = ?(Выборка.Ссылка = НЕОПРЕДЕЛЕНО,"",Строка(Выборка.Ссылка.УникальныйИдентификатор()));
	КонецЦикла;

	//Акт списания ЕГАИС
	
	Запрос.Текст = "ВЫБРАТЬ
		               |	АктСписанияЕГАИС.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ табАктСписанияЕГАИС
		               |ИЗ
		               |	Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
		               |		ПО АктСписанияЕГАИС.Ссылка = СтатусыДокументовЕГАИС.Документ
		               |ГДЕ
		               |	АктСписанияЕГАИС.Дата >= &Дата
		               |	И АктСписанияЕГАИС.Проведен
		               |	И (СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПередачи)
		               |			ИЛИ СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПроведенияЕГАИС))
		               |	И АктСписанияЕГАИС.Ответственный = &Ответственный
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕГАИСПрисоединенныеФайлы.Документ КАК Документ,
		               |	ЕГАИСПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
		               |	ЕГАИСПрисоединенныеФайлы.Ссылка КАК ЕГАИСПрисоединенныеФайлыСсылка
		               |ПОМЕСТИТЬ табАктСписанияЕГАИСПрисоединенныеФайлы
		               |ИЗ
		               |	табАктСписанияЕГАИС КАК табАктСписанияЕГАИС
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕГАИСПрисоединенныеФайлы КАК ЕГАИСПрисоединенныеФайлы
		               |		ПО табАктСписанияЕГАИС.Ссылка = ЕГАИСПрисоединенныеФайлы.Документ
		               |ГДЕ
		               |	ЕГАИСПрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыЗапросовИС.Входящий)
		               |	И ЕГАИСПрисоединенныеФайлы.Операция = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЕГАИС.КвитанцияПроведенЕГАИС)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	""Документ.АктСписанияЕГАИС"" КАК ТипСсылки,
		               |	табАктСписанияЕГАИСПрисоединенныеФайлы.Документ КАК Ссылка,
		               |	табАктСписанияЕГАИСПрисоединенныеФайлы.Документ.Представление КАК ПредставлениеОбъекта,
		               |	""Ошибка передачи в ЕГАИС"" КАК Ошибка,
		               |	табАктСписанияЕГАИСПрисоединенныеФайлы.Документ.Дата КАК ДатаСобытия,
		               |	табАктСписанияЕГАИСПрисоединенныеФайлы.ЕГАИСПрисоединенныеФайлыСсылка.Описание КАК ОписаниеОшибки
		               |ИЗ
		               |	табАктСписанияЕГАИСПрисоединенныеФайлы КАК табАктСписанияЕГАИСПрисоединенныеФайлы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			табАктСписанияЕГАИСПрисоединенныеФайлы.Документ КАК Документ,
		               |			МАКСИМУМ(табАктСписанияЕГАИСПрисоединенныеФайлы.ДатаСоздания) КАК ДатаСоздания
		               |		ИЗ
		               |			табАктСписанияЕГАИСПрисоединенныеФайлы КАК табАктСписанияЕГАИСПрисоединенныеФайлы
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			табАктСписанияЕГАИСПрисоединенныеФайлы.Документ) КАК ЕГАИСДатыПоследнихСообщений
		               |		ПО табАктСписанияЕГАИСПрисоединенныеФайлы.Документ = ЕГАИСДатыПоследнихСообщений.Документ
		               |			И табАктСписанияЕГАИСПрисоединенныеФайлы.ДатаСоздания = ЕГАИСДатыПоследнихСообщений.ДатаСоздания
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ табАктСписанияЕГАИС
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ табАктСписанияЕГАИСПрисоединенныеФайлы";

	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаОшибокБД.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УникальныйИдентификатор = ?(Выборка.Ссылка = НЕОПРЕДЕЛЕНО,"",Строка(Выборка.Ссылка.УникальныйИдентификатор()));
	КонецЦикла;
	
	Запрос.Текст = ("ВЫБРАТЬ
	                |	""Документ.ОтчетОРозничныхПродажах"" КАК ТипСсылки,
	                |	НЕОПРЕДЕЛЕНО КАК Ссылка,
	                |	""Не определено"" КАК ПредставлениеОбъекта,
	                |	""Не создана выемка или требуется пересчитать итоги"" КАК Ошибка,
	                |	&ПустаяДата КАК ДатаСобытия
	                |ИЗ
	                |	РегистрНакопления.ДенежныеСредстваККМ.Остатки(&ДатаПозавчера, КассаККМ = &КассаККМ) КАК ДенежныеСредстваККМОстатки
	                |ГДЕ
	                |	ДенежныеСредстваККМОстатки.СуммаОстаток <> 0
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	""Документ.ОтчетОРозничныхПродажах"",
	                |	ЧекККМ.ОтчетОРозничныхПродажах,
	                |	НАЧАЛОПЕРИОДА(ЧекККМ.Дата, ДЕНЬ),
	                |	""Битая ссылка"",
	                |	&ПустаяДата
	                |ИЗ
	                |	Документ.ЧекККМ КАК ЧекККМ
	                |ГДЕ
	                |	НЕ ЧекККМ.ОтчетОРозничныхПродажах ЕСТЬ NULL
	                |	И ЧекККМ.ОтчетОРозничныхПродажах <> ЗНАЧЕНИЕ(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка)
	                |	И ЧекККМ.ОтчетОРозничныхПродажах.Номер ЕСТЬ NULL
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	НАЧАЛОПЕРИОДА(ЧекККМ.Дата, ДЕНЬ),
	                |	ЧекККМ.ОтчетОРозничныхПродажах
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	""Документ.ОтчетОРозничныхПродажах"",
	                |	ОтчетОРозничныхПродажах.Ссылка,
	                |	ОтчетОРозничныхПродажах.Представление,
	                |	""Не проведен"",
	                |	ОтчетОРозничныхПродажах.Дата
	                |ИЗ
	                |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	                |ГДЕ
	                |	ОтчетОРозничныхПродажах.Дата >= &Дата
	                |	И НЕ ОтчетОРозничныхПродажах.Проведен
	                |	И НЕ ОтчетОРозничныхПродажах.ПометкаУдаления
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	""Документ.ПередачаВРегистр2ЕГАИС"",
	                |	ПередачаВРегистр2ЕГАИС.Ссылка,
	                |	ПередачаВРегистр2ЕГАИС.Представление,
	                |	""Ошибка формирования документа"",
	                |	ПередачаВРегистр2ЕГАИС.Дата
	                |ИЗ
	                |	Документ.ПередачаВРегистр2ЕГАИС КАК ПередачаВРегистр2ЕГАИС
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	                |		ПО ПередачаВРегистр2ЕГАИС.Ссылка = СтатусыДокументовЕГАИС.Документ
	                |ГДЕ
	                |	ПередачаВРегистр2ЕГАИС.Дата >= &ДатаВчера
	                |	И ПередачаВРегистр2ЕГАИС.Проведен
	                |	И СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиПередачиВРегистр2ЕГАИС.Черновик)
	                |	И ПередачаВРегистр2ЕГАИС.Ответственный = &Ответственный
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	""Документ.АктСписанияЕГАИС"",
	                |	АктСписанияЕГАИС.Ссылка,
	                |	АктСписанияЕГАИС.Представление,
	                |	""Ошибка записи Акта списания"",
	                |	АктСписанияЕГАИС.Дата
	                |ИЗ
	                |	Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
	                |ГДЕ
	                |	АктСписанияЕГАИС.Дата >= &Дата
	                |	И НЕ АктСписанияЕГАИС.ПометкаУдаления
	                |	И НЕ АктСписанияЕГАИС.Проведен
	                |	И АктСписанияЕГАИС.Ответственный = &Ответственный");
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаОшибокБД.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.УникальныйИдентификатор = ?(Выборка.Ссылка = НЕОПРЕДЕЛЕНО,"",Строка(Выборка.Ссылка.УникальныйИдентификатор()));
	КонецЦикла;
	
	Возврат ТаблицаОшибокБД;
	
КонецФункции	

Функция ПолучитьТаблицуАкцизныхМарокЕГАИС()
	
	СтруктураВозврата = Новый Структура("ЕстьДанныеПомаркам,ТаблицаАкцизныеМаркиЕГАИС");
	
	ТаблицаАкцизныеМаркиЕГАИС = Новый ТаблицаЗначений;
	ТаблицаАкцизныеМаркиЕГАИС.Колонки.Добавить("АкцизнаяМарка"			, Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
	ТаблицаАкцизныеМаркиЕГАИС.Колонки.Добавить("Номенклатура"			, Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36)));
	ТаблицаАкцизныеМаркиЕГАИС.Колонки.Добавить("АлкогольнаяПродукцияКод", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50)));
	ТаблицаАкцизныеМаркиЕГАИС.Колонки.Добавить("Справка1"				, Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(128)));
	ТаблицаАкцизныеМаркиЕГАИС.Колонки.Добавить("Справка2"				, Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(128)));

				
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АкцизныеМаркиЕГАИС.АкцизнаяМарка.ЗначениеШтрихкода КАК АкцизнаяМарка,
	                      |	АкцизныеМаркиЕГАИС.АкцизнаяМарка.Номенклатура КАК Номенклатура,
	                      |	АкцизныеМаркиЕГАИС.АлкогольнаяПродукция.Код КАК АлкогольнаяПродукцияКод,
	                      |	АкцизныеМаркиЕГАИС.Справка2.НомерСправки1 КАК Справка1,
	                      |	АкцизныеМаркиЕГАИС.Справка2.Наименование КАК Справка2
	                      |ИЗ
	                      |	РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
	                      |ГДЕ
	                      |	АкцизныеМаркиЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАкцизныхМарок.ВНаличии)");
	
	
	Результат = Запрос.Выполнить(); 
	
	СтруктураВозврата.ЕстьДанныеПомаркам =  НЕ Результат.Пустой();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаАкцизныеМаркиЕГАИС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Попытка
			НоваяСтрока.Номенклатура = Строка(Выборка.Номенклатура.УникальныйИдентификатор());
		Исключение
		КонецПопытки;	
	КонецЦикла;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ТаблицаАкцизныеМаркиЕГАИС);
	
	СтруктураВозврата.ТаблицаАкцизныеМаркиЕГАИС =  ЗаписьXML.Закрыть();
		
	Возврат СтруктураВозврата;
	
КонецФункции	

Функция ПолучитьКоличествоНоменклатуры()
					
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура.Ссылка) КАК Количество
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура");
	
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции


Функция ПолучитьОстаткиЕГАИС()
	
	// Только пиво
	
	ТаблицаОстаткиЕГАИС = Новый ТаблицаЗначений;
	ТаблицаОстаткиЕГАИС.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаОстаткиЕГАИС.Колонки.Добавить("ВидРегистра", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12)));
	ТаблицаОстаткиЕГАИС.Колонки.Добавить("КодНоменклатуры", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50) ));
	ТаблицаОстаткиЕГАИС.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
				
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка КАК Ссылка,
	                      |	НАЧАЛОПЕРИОДА(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.Дата, ДЕНЬ) КАК Дата,
	                      |	ВЫБОР
	                      |		КОГДА ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре1)
	                      |			ТОГДА ""Регистр1""
	                      |		КОГДА ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре2)
	                      |			ТОГДА ""Регистр2""
	                      |		ИНАЧЕ ""НЕОПРЕДЕЛЕНО""
	                      |	КОНЕЦ КАК ВидРегистра,
	                      |	ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция.Код КАК КодНоменклатуры,
	                      |	СУММА(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Количество) КАК Количество
	                      |ИЗ
	                      |	Документ.ОстаткиЕГАИС.ОстаткиПоДаннымЕГАИС КАК ОстаткиЕГАИСОстаткиПоДаннымЕГАИС
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	                      |		ПО ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка = СтатусыДокументовЕГАИС.Документ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			НАЧАЛОПЕРИОДА(ОстаткиЕГАИС.Дата, ДЕНЬ) КАК ДатаДень,
	                      |			МАКСИМУМ(ОстаткиЕГАИС.Дата) КАК ДатаДокумента,
	                      |			ОстаткиЕГАИС.ВидДокумента КАК ВидДокумента
	                      |		ИЗ
	                      |			Документ.ОстаткиЕГАИС КАК ОстаткиЕГАИС
	                      |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	                      |				ПО ОстаткиЕГАИС.Ссылка = СтатусыДокументовЕГАИС.Документ
	                      |		ГДЕ
	                      |			НЕ ОстаткиЕГАИС.Ссылка.ПометкаУдаления
	                      |			И ОстаткиЕГАИС.Ссылка.Дата >= &ДатаВыгрузки
	                      |			И СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиОстатковЕГАИС.ПолученыОстатки)
	                      |			И ОстаткиЕГАИС.Ссылка.Ответственный = &Ответственный
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			НАЧАЛОПЕРИОДА(ОстаткиЕГАИС.Дата, ДЕНЬ),
	                      |			ОстаткиЕГАИС.ВидДокумента) КАК ПараметрыДокументовОстатков
	                      |		ПО ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.ВидДокумента = ПараметрыДокументовОстатков.ВидДокумента
	                      |			И ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.Дата = ПараметрыДокументовОстатков.ДатаДокумента
	                      |ГДЕ
	                      |	НЕ ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.ПометкаУдаления
	                      |	И ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.Дата >= &ДатаВыгрузки
	                      |	И СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиОстатковЕГАИС.ПолученыОстатки)
	                      |	И ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.Ответственный = &Ответственный
	                      |	И НЕ ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция.ВидПродукции.Маркируемый
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка,
	                      |	НАЧАЛОПЕРИОДА(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.Дата, ДЕНЬ),
	                      |	ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция.Код,
	                      |	ВЫБОР
	                      |		КОГДА ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре1)
	                      |			ТОГДА ""Регистр1""
	                      |		КОГДА ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре2)
	                      |			ТОГДА ""Регистр2""
	                      |		ИНАЧЕ ""НЕОПРЕДЕЛЕНО""
	                      |	КОНЕЦ");
	
	Запрос.Параметры.Вставить("ДатаВыгрузки", НачалоДня(ТекущаяДата() - 86400*3));
	Запрос.Параметры.Вставить("Ответственный", Справочники.Пользователи.Автомат);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаОстаткиЕГАИС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаОстаткиЕГАИС;
	
КонецФункции	

Функция СформироватьДанныеСверкиСРозничнымиТочкамиТрадицияКонецВчерашнегоДня()  
	
	СтруктураСверки = Новый Структура();
				
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТоварыНаСкладахОстатки.Номенклатура)) КАК Идентификатор,
	                      |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаФормирования, ) КАК ТоварыНаСкладахОстатки");
	
	Запрос.Параметры.Вставить("ДатаФормирования", КонецДня(НачалоДня(ТекущаяДата())-1));
	
	СтруктураСверки.Вставить("ОстаткиТоваров",Запрос.Выполнить().Выгрузить());	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, СтруктураСверки, НазначениеТипаXML.Явное);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат  СтрокаJSON;
	
КонецФункции	

Функция ПолучитьСписокВнешнихОтчетовИОброботок()
	
	ТаблицаДополнительныеОтчетыИОбработки = Новый ТаблицаЗначений;
	ТаблицаДополнительныеОтчетыИОбработки.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТаблицаДополнительныеОтчетыИОбработки.Колонки.Добавить("Версия", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10)));
	ТаблицаДополнительныеОтчетыИОбработки.Колонки.Добавить("Вид", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(50)));
	ТаблицаДополнительныеОтчетыИОбработки.Колонки.Добавить("ИмяОбъекта", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(256)));
	ТаблицаДополнительныеОтчетыИОбработки.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(260)));
				
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование,
	                      |	ДополнительныеОтчетыИОбработки.Версия КАК Версия,
	                      |	ПРЕДСТАВЛЕНИЕ(ДополнительныеОтчетыИОбработки.Вид) КАК Вид,
	                      |	ДополнительныеОтчетыИОбработки.ИмяОбъекта КАК ИмяОбъекта,
	                      |	ДополнительныеОтчетыИОбработки.ИмяФайла КАК ИмяФайла
	                      |ИЗ
	                      |	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	                      |ГДЕ
	                      |	ДополнительныеОтчетыИОбработки.Публикация = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется)");
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаДополнительныеОтчетыИОбработки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаДополнительныеОтчетыИОбработки;
	
КонецФункции	

Функция ЭтоКафе()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.ТрадицияКонфигурацияДляКафе.Получить();
	  
КонецФункции	

Функция ТрадВремяНачалаПродажАлкоголя()
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Возврат Константы.ТрадВремяНачалаПродажАлкоголя.Получить();
	Исключение
	КонецПопытки	
	
КонецФункции	
	
Функция	ТрадВремяОкончанияПродажАлкоголя()

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Возврат Константы.ТрадВремяОкончанияПродажАлкоголя.Получить();
	Исключение
	КонецПопытки
	
КонецФункции

Функция ТрадВремяНачалаПродажНемаркируемойАлкогольнойПродукции()
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Возврат Константы.ТрадВремяНачалаПродажНемаркируемойАлкогольнойПродукции.Получить();
	Исключение
	КонецПопытки	
	
КонецФункции	
	
Функция	ТрадВремяОкончанияПродажНемаркируемойАлкогольнойПродукции()

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Возврат Константы.ТрадВремяОкончанияПродажНемаркируемойАлкогольнойПродукции.Получить();
	Исключение
	КонецПопытки
	
КонецФункции

Функция ПолучитьФизЛицоКассира()  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка    
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Пользователи.ФизическоеЛицо.Наименование КАК ФизЛицоКассира
		                      |ИЗ
		                      |	Справочник.Пользователи КАК Пользователи
		                      |ГДЕ
		                      |	 Пользователи.Наименование = &Наименование");
		
		Запрос.Параметры.Вставить("Наименование","Кассир"); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат "";
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		
		Возврат Выборка.ФизЛицоКассира;
		
	Исключение
	КонецПопытки;
	
КонецФункции		

Функция ПолучитьДатуПоследнейКопии()
	СтрокаСоединения = СтрЗаменить(СтрокаСоединенияИнформационнойБазы(), """", Символы.ПС);
	КаталогИнформационнойБазы = СтрПолучитьСтроку(СтрокаСоединения, 2);
			
	КаталогИнформационнойБазыДляБекапов =  КаталогИнформационнойБазы;
	ТрадПутьВыгрузкиРезервнойКопии = Константы.ТрадПутьВыгрузкиРезервнойКопии.Получить();
	Если ЗначениеЗаполнено(ТрадПутьВыгрузкиРезервнойКопии) Тогда
		КаталогИнформационнойБазыДляБекапов = ТрадПутьВыгрузкиРезервнойКопии;
	КонецЕсли;
	
	ИмяФайлаИнформационнойБазы = "1Cv8.1CD";
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("ВремяИзменения", Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		
	НайденныеФайлы = НайтиФайлы(КаталогИнформационнойБазыДляБекапов, ИмяФайлаИнформационнойБазы + "-*.zip");
	Для каждого НайденныйФайл Из НайденныеФайлы Цикл
		Если НайденныйФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.ВремяИзменения = НайденныйФайл.ПолучитьВремяИзменения();
	КонецЦикла;
	
	Если ТаблицаФайлов.Количество() > 0 Тогда
		ТаблицаФайлов.Сортировать("ВремяИзменения Убыв");
		Возврат ТаблицаФайлов[0].ВремяИзменения;
	КонецЕсли;
	
	Возврат 0;
КонецФункции

Функция ПолучитьСписокРасширений()
	
	ТаблицаРасширений = Новый ТаблицаЗначений;
	ТаблицаРасширений.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТаблицаРасширений.Колонки.Добавить("Версия", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(25)));
	ТаблицаРасширений.Колонки.Добавить("БезопасныйРежим", Новый ОписаниеТипов("Булево"));
	ТаблицаРасширений.Колонки.Добавить("Активно", Новый ОписаниеТипов("Булево"));
		
	МассивРасширений = РасширенияКонфигурации.Получить();
	
	Для Каждого элМассива Из МассивРасширений Цикл
		НоваяСтрока =  ТаблицаРасширений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,элМассива);
	КонецЦикла;	
	
	Возврат ТаблицаРасширений;
	
КонецФункции	

#КонецОбласти

